[
    {
        "description_en": "He received his PhD in 2014 from the Computer Science Department of the University of Crete. His research interests include computer architecture, digital circuits and FPGA prototyping, high-performance computing and high-speed interconnects.", 
        "description_gr": "Πήρε το διδακτορικό του το 2014 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην αρχιτεκτονική υπολογιστών, τα ψηφιακά κυκλώματα και διατάξεις προγραμματιζόμενης λογικής, τα υπολογιστικά συστήματα υψηλών επιδόσεων και τα δίκτυα διασύνδεσης υψηλών ταχυτήτων.", 
        "email": "papaef AT ics DOT forth DOT gr", 
        "name_en": "Vassilis Papaefstathiou", 
        "name_gr": "Βασίλης Παπαευσταθίου", 
        "personId": "67", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": ""
    }, 
    {
        "description_en": "She received her PhD in 2004 from the University of Crete, Greece. Her research interests include Business Process Management and Service Value Networks, Auction Theory, Network Economics, Network Management, Game Theory, Queuing Theory, Operational Research, Applied Probabilities, Stochastic Processes, Statistics.", 
        "description_gr": "Πήρε το διδακτορικό της το 2004 από το Πανεπιστήμιο Κρήτης.Τα ερευνητικά της ενδιαφέροντα επικεντρώνονται στην ανάλυση, μοντελοποίηση και διαχείριση επιχειρηματικών διαδικασιών και NULL  υπηρεσιών σε δίκτυα αξιών (value networks), στη θεωρία δημοπρασιών πολλαπλών αντικειμένων και την εφαρμογή τους στην ανάπτυξη μηχανισμών χρέωσης για πώληση εύρους ζώνης και πολυπαραμετρικών συμβολαίων σε δίκτυα, καθώς και στη σχεδίαση ιεραρχικών μοντέλων για μεταπώληση εύρους ζώνης από ενδιάμεσους παρόχους υπηρεσιών. NULL  Άλλα ενδιαφέροντα περιλαμβάνουν τη θεωρία παιγνίων, τη θεωρία ουρών, την επιχειρησιακή έρευνα, τις εφαρμοσμένες πιθανότητες και τη στατιστική.", 
        "email": "marina AT csd DOT uoc DOT gr", 
        "name_en": "Marina Bitsaki", 
        "name_gr": "Μαρίνα Μπιτσάκη", 
        "personId": "27", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://www.tem.uoc.gr/~marina/"
    }, 
    {
        "description_en": "He received his PhD in 2007 from the University of Crete, Greece. His current research interests include Computer Architecture, networks and parallel systems.", 
        "description_gr": "Πήρε το διδακτορικό του το 2007 από το Πανεπιστήμιο Κρήτης. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην αρχιτεκτονική υπολογιστών, δικτύων, και παράλληλων συστημάτων.", 
        "email": "nchrysos AT ics DOT forth DOT gr", 
        "name_en": "Nikolaos Chrysos", 
        "name_gr": "Νικόλαος Χρυσός", 
        "personId": "64", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://users.ics.forth.gr/%7Enchrysos/"
    }, 
    {
        "description_en": "He received his PhD in 2017 from University of Warwick, UK. His research interests include (algorithmic) game theory, algorithms, information theory, communications and signal processing.", 
        "description_gr": "Πήρε το διδακτορικό του από το Πανεπιστήμιο του Warwick το 2017. Τα ενδιαφέροντά του περιλαμβάνουν την (αλγοριθμική) θεωρία παιγνίων, τους αλγόριθμους, τη θεωρία πληροφορίας, τις τηλεπικοινωνίες και την επεξεργασία σήματος.", 
        "email": "mfasoul AT ics DOT forth DOT gr", 
        "name_en": "Michail Fasoulakis", 
        "name_gr": "Μιχαήλ Φασουλάκης", 
        "personId": "54", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "https://uk.linkedin.com/in/michail-fasoulakis-b1697368"
    }, 
    {
        "description_en": "He received his PhD in 2014 in Computer Science from the Computer Science Department of the University of Crete and in Signal Processing & Telecommunications from the University of Rennes 1, France. His research interests include speech and audio signal processing, with emphasis on sinusoidal models and their applications.", 
        "description_gr": "Πήρε το διδακτορικό του το 2014 στην Επιστήμη των Υπολογιστών από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου NULL  Κρήτης NULL  και στην Επεξεργασία Σήματος & Τηλ/νιες από το Πανεπιστήμιο της Rennes 1, στη Γαλλία. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν επεξεργασία σήματος φωνής και ήχου, με έμφαση στα ημιτονοειδη μοντέλα και τις εφαρμογές τους.", 
        "email": "kafentz AT csd DOT uoc DOT gr", 
        "name_en": "George Kafentzis", 
        "name_gr": "Γεώργιος Καφεντζής", 
        "personId": "56", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://www.csd.uoc.gr/~kafentz/"
    }, 
    {
        "description_en": "He received his PhD in 2010 from the University of Crete, Greece. His current research interests include Knowledge Representation & Management; Web Databases; Information Integration and Retrieval Systems; Interoperability of Heterogeneous and Distributed Information Bases; Biomedical Information Systems.", 
        "description_gr": "Πήρε το διδακτορικό του το 2010 από το Πανεπιστήμιο Κρήτης. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην αναπαράσταση και διαχείριση γνώσης, σε συστήματα ολοκλήρωσης και ανάκτησης πληροφορίας, στην διαλειτουργικότητα ετερογενών και κατανεμημένων συστημάτων διαχείρισης πληροφορίας καθώς και σε συστήματα βιοπληροφορικής, ιατρικής και υγείας.", 
        "email": "kondylak AT ics DOT forth DOT gr", 
        "name_en": "Haridimos Kondylakis", 
        "name_gr": "Χαρίδημος Κονδυλάκης", 
        "personId": "57", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://users.ics.forth.gr/~kondylak/"
    }, 
    {
        "description_en": "He received his PhD in Computer Science from the University of California, San Diego in 2013. His research interests include Big Data Analytics, Cloud Computing, and Cluster Management.", 
        "description_gr": "Πήρε το διδακτορικό του στην Επιστήμη Υπολογιστών το 2013 από το University of California, San Diego. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην ανάλυση μεγάλου όγκου δεδομένων, τεχνολογίες Cloud Computing, και Cluster Management.", 
        "email": "kozanitis AT ics DOT forth DOT gr", 
        "name_en": "Christos Kozanitis", 
        "name_gr": "Χρήστος Κοζανίτης", 
        "personId": "66", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": ""
    }, 
    {
        "description_en": "He received his PhD in 2014 from the Computer Science Department of University of Crete. His research interests include programming language design and development, metaprogramming languages and methods, integrated development environments, software engineering tools and game development tools.", 
        "description_gr": "Πήρε το διδακτορικό του το 2014 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου NULL  Κρήτης. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν σχεδιασμό και ανάπτυξη γλωσσών προγραμματισμού, γλώσσες και μεθόδους μεταπρογραμματισμού, ολοκληρωμένα περιβάλλοντας ανάπτυξης λογισμικού, εργαλεία τεχνολογίας λογισμικού και εργαλεία ανάπτυξης παιχνιδιών.", 
        "email": "lilis AT csd DOT uoc DOT gr", 
        "name_en": "Yannis Lilis", 
        "name_gr": "Iωάννης Λιλής", 
        "personId": "62", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": ""
    }, 
    {
        "description_en": "He received his PhD in Computer Science in 2001, from the University of Crete. His research interests focus on the design, development, analysis and experimental evaluation of high-performance computing systems, and data storage systems.", 
        "description_gr": "Πήρε το διδακτορικό του στην Επιστήμη Υπολογιστών το 2001 από το Πανεπιστήμιο Κρήτης. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην σχεδίαση, ανάπτυξη, ανάλυση και πειραματική αξιολόγηση υπολογιστικών συστημάτων υψηλής επίδοσης και συστημάτων απόθήκευσης δεδομένων.", 
        "email": "maraz AT csd DOT uoc DOT gr", 
        "name_en": "Manolis Marazakis", 
        "name_gr": "Εμμανουήλ Μαραζάκης", 
        "personId": "68", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "https://www.linkedin.com/in/mmarazakis/"
    }, 
    {
        "description_en": "Πήρε το διδακτορικό του το 2011 από το Πολυτεχνείο Κρήτης. Τα ενδιαφέροντά του περιλαμβάνουν: Aρχιτεκτονική Υπολογιστών, Γλώσσες Προγραμματισμού, Παράλληλο Προγραμματισμό.", 
        "description_gr": "Πήρε το διδακτορικό του το 2011 από το Πολυτεχνείο Κρήτης. Τα ενδιαφέροντά του περιλαμβάνουν: Aρχιτεκτονική Υπολογιστών, Γλώσσες Προγραμματισμού, Παράλληλο Προγραμματισμό.", 
        "email": "", 
        "name_en": "Iakovos Mavroidis", 
        "name_gr": "Ιάκωβος Μαυροειδής", 
        "personId": "31", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://archvlsi.ics.forth.gr/~jacob/"
    }, 
    {
        "description_en": "She received her PhD in 2009 from the Electrical and Computer Engineering Department, University of Patras, Greece. Her research interests are located in the area of distributed computing and network algorithms for Sensor/Actuator Networks and the Internet of Things.", 
        "description_gr": "H Aθανασία πήρε το διδακτορικό της το 2009 από το Πανεπιστήμιο Πατρών, τμήμα Hλεκτρολόγων Μηχανικών και Τεχνολογίας Υπολογιστών. Τα ερευνητικά της ενδιαφέροντα επικεντρώνονται σε στο σχεδιασμό κατανεμημένων υπολογιστικών και δικτυακών αλγορίθμων, με εφαρμογές στα Δίκτυα Aισθητήρων/Επενεργητών, και το Διαδίκτυο των Πραγμάτων.", 
        "email": "apanouso AT ics DOT forth DOT gr", 
        "name_en": "Athanasia Panousopoulou", 
        "name_gr": "Aθανασία Πανουσοπούλου", 
        "personId": "61", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": ""
    }, 
    {
        "description_en": "Πήρε το Διδακτορικό του το 2009 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ενδιαφέροντα του περιλαμβάνουν: Aσύρματες Κινητές Επικοινωνίες, Εντοπισμός θέσης συσκευών ασυρμάτων και κινητών δικτύων, Διάδοση μικροκυμάτων και απώλειες διάδοσης.", 
        "description_gr": "Πήρε το Διδακτορικό του το 2009 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ενδιαφέροντα του περιλαμβάνουν: Aσύρματες Κινητές Επικοινωνίες, Εντοπισμός θέσης συσκευών ασυρμάτων και κινητών δικτύων, Διάδοση μικροκυμάτων και απώλειες διάδοσης.", 
        "email": "", 
        "name_en": "Stefanos Papadakis", 
        "name_gr": "Στέφανος Παπαδάκης", 
        "personId": "39", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": ""
    }, 
    {
        "description_en": "He received his PhD in Computer Science in 2010 from the University of Crete. His research revolves around areas of Artificial Intelligence that apply formal theories, such as in the fields of Knowledge Representation and Reasoning, Action Languages, Computational Argumentation, Semantic Web, Cognitive Robotics, and others.", 
        "description_gr": "Πήρε το διδακτορικό του το 2010 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Ερευνητικά δραστηριοποιείται στο χώρο της Τεχνητής Νοημοσύνης που βασίζεται σε τυπικές θεωρίες, όπως τις περιοχές της Aναπαράστασης Γνώσης και Συλλογιστικής, των Θεωριών Δράσης, της Υπολογιστικής Επιχειρηματολογίας, του Σημασιολογικού Ιστού, της Γνωσιακής Ρομποτικής κ.α.", 
        "email": "patkos AT csd DOT uoc DOT gr", 
        "name_en": "Theodoros Patkos", 
        "name_gr": "Θεόδωρος Πάτκος", 
        "personId": "70", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "https://www.csd.uoc.gr/~patkos/"
    }, 
    {
        "description_en": "NULL He received his Ph.D. degree in 2011 (summa cum laude) from the University of Munich, Germany under the supervision of Prof. Wolfgang Stephan. His expertise and research lies on the computational and theoretical population genetics and evolutionary biology. He is also interested in Bioinformatics on genomics data.", 
        "description_gr": "Πήρε το Διδακτορικό του από το Πανεπιστήμιο του Μονάχου υπό την επίβλεψη του καθ. Wolfgang Stephan. Τα ερευνητικά του ενδιαφέροντα εστιάζονται στον χώρο της εξελικτικής βιολογίας. Συγκεκριμένα, στο πεδίο της υπολογιστικής πληθυσμιακής γενετικής και της εξέλιξης των πληθυσμών. Με την έρευνα του επιδιώκει να απαντήσει τα ερωτήματα: \"Γιατί οι φυσικοί πληθυσμοί' έχουν την παρούσα γενετική σύσταση; Πώς αυτή έχει εξελιχθεί στο χρόνο και στον χώρο; Ποιες δυνάμεις και διαδικασίες βρίσκονται πίσω από την εξέλιξη των πληθυσμών;", 
        "email": "pavlidis AT ics DOT forth DOT gr", 
        "name_en": "Pavlos Pavlidis", 
        "name_gr": "Παύλος Παυλίδης", 
        "personId": "69", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "https://www.ics.forth.gr/cbml/index_main.php?l=g&c=723"
    }, 
    {
        "description_en": "He holds a B.Sc. and a M.Sc. in Computer Science and received his Ph.D. degree in Computer Science in 2009 from the University of Crete, Heraklion, Greece. NULL His expertise, specialization and research lies in the wider scientific domain of wireless communication networks and computational medicine and in particular on wireless telecommunication networks and theory,  NULL internet of medical things, and biomedical informatics and engineering.", 
        "description_gr": "Πήρε το Διδακτορικό του το 2009 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ενδιαφέροντα του περιλαμβάνουν: Aσύρματες Κινητές Επικοινωνίες, και Ιατρική Πληροφορική.", 
        "email": "spanakis AT ics DOT forth DOT gr", 
        "name_en": "Emmanouil Spanakis", 
        "name_gr": "Εμμανουήλ Σπανάκης", 
        "personId": "30", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://www.spanakis.info/"
    }, 
    {
        "description_en": "He received his PhD in 1979 from Universita di Pisa, Italy. His current research interests include Information Integration (mediators, data warehouses, data mining), Conceptual Modeling, Logic, and Databases.", 
        "description_gr": "Καθηγητής στο Πανεπιστήμιο του Παρισιού στο Orsay στη Γαλλία. Τα ενδιαφέροντα του περιλαμβάνουν Θεωρία Βάσεων Δεδομένων και Γνώσεων.", 
        "email": "spiratos AT csd DOT uoc DOT gr", 
        "name_en": "Nicolas Spyratos", 
        "name_gr": "Νίκος Σπυράτος", 
        "personId": "35", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://www.lri.fr/~spyratos/"
    }, 
    {
        "description_en": "He received his PhD in 2011 from the Center for Imaging Science, Rochester Institute of Technology, New York. His research interests focus on the development of signal processing and machine leaning systems, and their application in astrophysics, remote sensing, and wireless sensor networks.", 
        "description_gr": "Πήρε το διδακτορικό του το 2011 από το Κέντρο Επιστήμης Εικόνας του Τεχνολογικού Ινστιτούτου του Ρότσεστερ στην Νέα Υόρκη. Τα ερευνητικά του ενδιαφέροντα εστιάζονται στην ανάπτυξη συστημάτων επεξεργασίας σήματος και μηχανικής μάθησης και τις εφαρμογές τους σε προβλήματα αστροφυσικής, τηλεπισκόπησης  NULL και ασύρματων δικτύων αισθητήρων. NULL  NULL", 
        "email": "greg AT ics DOT forth DOT gr", 
        "name_en": "Grigorios Tsagkatakis", 
        "name_gr": "Γρηγόριος Τσαγκατάκης", 
        "personId": "60", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": ""
    }, 
    {
        "description_en": "He received his Ph.D. in 2001 from the University of Crete, Greece. His research interests include Stereo & Multiple-View Vision, Real-Time 3D Reconstruction of Static & Dynamic Scenes, Person Localization and Head Pose Estimation, Camera Networks, and Applications of Computer Vision in Interactive Environments.", 
        "description_gr": "Πήρε το Διδακτορικό του το 2002 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ερευνητικά του ενδιαφέροντα βρίσκονται στo χώρο της υπολογιστική όρασης και πιο συγκεκριμένα στις παρακάτω περιοχές: στερεοπτική όραση και όραση πολλαπλών όψεων, 3Δ ανακατασκευή στατικών και δυναμικών σκηνών, ανάκληση οπτικής πληροφορίας με βάση το περιεχόμενο, υπολογιστικά θέματα της ανθρώπινης οπτικής αντίληψης, δίκτυα από κάμερες καθώς και εφαρμογές τηλε-εμβύθισης και Διάχυτης Νοημοσύνης.", 
        "email": "zabulis AT csd DOT uoc DOT gr", 
        "name_en": "Xenophon Zabulis", 
        "name_gr": "Ξενοφών Ζαμπούλης", 
        "personId": "24", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://www.ics.forth.gr/~zabulis/"
    }, 
    {
        "description_en": "He received his PhD diploma on Computer Science in 2016 from the University of Crete. His research interests include the development of systems that aim to increase the programmability of complex multi-core machines. Specifically, he focuses on automatic memory management, dynamic code compilation at run-time, and scheduling.", 
        "description_gr": "Πήρε το διδακτορικό του στην Επιστήμη Υπολογιστών το 2016 από το Πανεπιστήμιο Κρήτης. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν την ανάπτυξη συστημάτων που στοχεύουν στον ευκολότερο προγραμματισμό σύνθετων πολυπύρηνων μηχανημάτων. Ειδικότερα, ερευνά μηχανισμούς αυτόματης διαχείρισης μνήμης, δυναμικής μεταγλώττισης κώδικα κατά τον χρόνο εκτέλεσης της εφαρμογής, και διαχείρισής διεργασιών και νημάτων.", 
        "email": "zakkak AT csd DOT uoc DOT gr", 
        "name_en": "Fivos Zakkak", 
        "name_gr": "Φοίβος Ζακκάκ", 
        "personId": "65", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "https://foivos.zakkak.net/"
    }, 
    {
        "description_en": "He received his PhD in 2014 from the Computer Science Department of University of Crete. His research interests include NULL monitoring and adaptation of Web services, discovery NULL of event patterns and Complex Event Processing in SOA and Cloud computing environments.", 
        "description_gr": "Πήρε το διδακτορικό του το 2014 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν την παρακολούθηση και προσαρμογή υπηρεσιών διαδικτύου, την ανακάλυψη και ανίχνευση μοτίβων γεγονότων και την επεξεργασία σύνθετων συμβάντων (CEP) σε περιβάλλοντα υπηρεσιοστρεφούς αρχιτεκτονικής και υπολογιστικού νέφους (Cloud).", 
        "email": "zegchris AT csd DOT uoc DOT gr", 
        "name_en": "Chrysostomos Zeginis", 
        "name_gr": "Χρυσόστομος Ζεγκίνης", 
        "personId": "63", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://www.ics.forth.gr/~zegchris"
    }
]