[
    {
        "Area": "Core Courses", 
        "Code": "CS-100", 
        "Course email": "hy100 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy100/", 
        "Description": "Γενική εισαγωγή στις έννοιες και την πρακτική της Επιστήμης των Υπολογιστών. Υπολογιστικά συστήματα και η ιστορική εξέλιξη τους. Παράσταση και επεξεργασία πληροφοριών: Aριθμητικά συστήματα, Μετατροπές αριθμών μεταξύ διαφορετικών συστημάτων, Πράξεις στο δυαδικό σύστημα, Παράσταση αριθμών, Μη αριθμητική παράσταση πληροφοριών. Aρχιτεκτονική ηλεκτρονικών υπολογιστών: Τμήματα του υπολογιστή και οργάνωση, Μονάδα μνήμης, Aριθμητική και λογική μονάδα, Μονάδα εισόδου - εξόδου, Δίαυλοι μεταξύ των μονάδων, Επεξεργαστές, Εναλλακτικές αρχιτεκτονικές. Περιφερειακές μονάδες: Μαγνητικά μέσα αποθήκευσης, Οπτικά μέσα αποθήκευσης, Συσκευές εισόδου, Συσκευές εξόδου, Συσκευές επικοινωνιών. Λογισμικό: Κατηγορίες λογισμικού, Λειτουργικά συστήματα, Γλώσσες προγραμματισμού χαμηλού επιπέδου, Γλώσσες προγραμματισμού υψηλού επιπέδου, Γλώσσες τέταρτης γενιάς, Φυσικές γλώσσες, Είδη σχεδίασης προγραμμάτων. Aρχεία και βάσεις δεδομένων: Aρχεία, Βάσεις δεδομένων και Συστήματα βάσεων δεδομένων, Σχεσιακή άλγεβρα, Μοντέλο «Οντοτήτων - Συσχετίσεων», Aσφάλεια δεδομένων. Aλγόριθμοι: Βασικές έννοιες αλγορίθμων, Aνάπτυξη αλγορίθμων, Τεχνικές σχεδίασης αλγορίθμων, Έλεγχος και ανάλυση αλγορίθμων. Προγραμματισμός Υπολογιστών: Προγραμματιστικά περιβάλλοντα, Στοιχεία δομημένου προγραμματισμού, Σχεδιασμός περιβάλλοντος διεπαφής, Έλεγχος και εκσφαλμάτωση προγράμματος, Aξιολόγηση, Τεκμηρίωση, Κύκλος ζωής. Επικοινωνία Aνθρώπου - Μηχανής: Ο άνθρωπος και η μηχανή ως επεξεργαστές πληροφορίας και η μεταξύ τους αλληλεπίδραση, Διεπαφή χρήστη, Σύγχρονες τάσεις στην Επικοινωνία Aνθρώπου - Μηχανής. Δίκτυα και τηλεπικοινωνίες: Μετάδοση δεδομένων, Είδη δικτύων, Τοπολογίες δικτύων. Πολυμέσα: Υπερκείμενα, Υπερμέσα, Πολυμέσα, Στοιχεία σχεδίασης εφαρμογών πολυμέσων. Διαδίκτυο: Ο τρόπος οργάνωσης, Υπηρεσίες, Κατασκευή ιστοσελίδων, Κυβερνοχώρος. Τεχνητή Νοημοσύνη: Μη υπολογισιμότητα, Aναπαράσταση της γνώσης, Κατανόηση, Μάθηση, Γνωστικά πλαίσια, Νευρωνικά δίκτυα. H κοινωνία της πληροφορίας: Εφαρμογές πληροφορικής, Νομικά προβλήματα, Κοινωνικές επιπτώσεις της πληροφορικής, Hλεκτρονική Δημοκρατία, Νοήμονα συστήματα και ρομποτική.", 
        "ECTS": "8", 
        "Name": "Introduction to Computer Science", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-108", 
        "Course website": "http://www.csd.uoc.gr/~hy108/", 
        "Description": "Through a series of lectures, the course aims at offering a grounding in three main areas: mathematics, physics, and engineering. Students are able to revisit concepts that are fundamental for their subsequent induction to computing. Emphasis is placed on the practice of the necessary linguistic tools that will promote the students΄ fluid academic communication.", 
        "ECTS": "4", 
        "Name": "English I", 
        "Prerequisites": "Has no prerequisites", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-109", 
        "Course website": "http://www.csd.uoc.gr/~hy109", 
        "Description": "Students are introduced to the foundations of computer science, gaining knowledge of the basic terminology and the essential field concepts. Content material is reinforced with comprehension and review questions, which gradually build the students΄ skill in field communication.", 
        "ECTS": "4", 
        "Name": "English II", 
        "Prerequisites": "CS-108", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-110", 
        "Course website": "http://www.csd.uoc.gr/~hy110/", 
        "Description": "NULL \r\n\nLimits and continuity of functions\nDerivatives: Meaning, definition, properties, higher order derivatives, mean value theorem.\nApplications of derivatives: concavity and curve sketching, Newton’s method.\nIntegrals: definite and indefinite integrals, definitions, properties, examples, numerical integration.\nApplications of integration: lengths of plane curves, calculation of areas and volumes, simple differential equations\nTranscendental functions: logarithmic functions, exponential functions, inverse trigonometric functions, hyperbolic functions\nTechniques of Integration: basic integration formulas, integration by parts, integration of rational functions by partial fractions. Improper integrals.\nInfinite series: convergence and criteria for convergence, power series convergence, Taylor and Maclaurin series.\n\r\n \r\n NULL", 
        "ECTS": "8", 
        "Name": "Calculus I", 
        "Prerequisites": "-", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-118", 
        "Course email": "winter semester:  \nhy118a AT csd DOT uoc DOT grShow email", 
        "Course website": "winter semester:  http://www.csd.uoc.gr/~hy118a/\nspring semester:  http://www.csd.uoc.gr/~hy118b/", 
        "Description": "Introduction to Mathematical Logic (propositional calculus, predicate calculus)\nIntroduction to Set Theory\nProofs (direct proofs, proof by contradiction, mathematical induction, pigeonhole principle)\nIntroduction to Number Theory\nRelations (properties, equivalence relations, partial orders, total orders)\nCombinatorics\nBinomial Coefficients\nIntroduction to Probability Theory\nIntroduction to Graph Theory\n\r\n NULL  \r\nWhenever this course is not offered by the Computer Science Department, it is possible to substitute it by the Discrete Mathematics course offered by the Mathematics Department (ΜAΘ-205). \r\n NULL", 
        "ECTS": "6", 
        "Name": "Discrete Mathematics", 
        "Prerequisites": "Has no prerequisites", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-119", 
        "Course email": "hy119 AT csd DOT uoc DOT grShow email", 
        "Course website": "winter semester:  http://csd.uoc.gr/~hy119/\nspring semester:  https://elearn.uoc.gr/course/index.php?categoryid=31", 
        "Description": "Introduction to vectors\nSolving linear equations\nVector spaces and subspaces\nOrthogonality and projections\nDeterminants\nEigenvalues and eigenvectors\nPositive definite matrices\nSingular value decomposition", 
        "ECTS": "6", 
        "Name": "Linear Algebra", 
        "Prerequisites": "Has no prerequisites", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-120", 
        "Course email": "hy120 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy120", 
        "Description": "Logic gates. Boolean algebra. Combinational circuits. Simplification through Karnaugh-maps. Ready-made combinational chips and their application in the design of combinational systems. Flip-flops. Sequential Circuits. Registers, counters, shift registers and their application in designing larger systems. Finite-state machines. Electronic realization of gates, integrated circuit families. Laboratory with bread-boards, TTL chips, switches, LEDs.", 
        "ECTS": "8", 
        "Name": "Digital Design", 
        "Prerequisites": "Has no prerequisites", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-150", 
        "Course website": "https://elearn.uoc.gr/course/view.php?id=414", 
        "Description": "This course targets undergraduate students of the computer science department of the University of Crete, that have already attended HY100 (Introduction to computer science). Main aim of this course is to build on the basic principles of programming: design, implementation, correction and articulation of complete s/w programs, based on the C++ programming language. Special focus is ginen to functional, object-oriented as well as template programming: basic types, variables, pointers, classes, virtual functions, method and operator overloading, inheritance, templates, data streams and the standard template library of C++. This course contains a series of lectures, supervised laboratories and assignments.", 
        "ECTS": "8", 
        "Name": "Programming", 
        "Prerequisites": "Has no prerequisites", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-180", 
        "Course email": "hy180 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy180", 
        "Description": "Propositional and clausal logic: normal forms, implication, tautologies, formal proofs, completeness, formal proof systems, resolution. First-order theories. Elements of model theory. Introduction to logic programming. Automated proof systems.", 
        "ECTS": "6", 
        "Name": "Logic", 
        "Prerequisites": "Has no prerequisites", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-208", 
        "Course website": "http://www.csd.uoc.gr/~hy208", 
        "Description": "Through a series of specifically selected texts, students are introduced to the spectrum of interpersonal communications. They are taught all the different types of documents that comprise the field of technical writing. Practice is directed at showing how technical writing differs from other forms of writing.", 
        "ECTS": "4", 
        "Name": "English III", 
        "Prerequisites": "CS-109", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-209", 
        "Course website": "http://www.csd.uoc.gr/~hy209", 
        "Description": "A series of workshops and lectures, offering numerous tools to help create effective written and oral communication in the workplace. Technical writing covers a wide range of genres and technologies. When information has to be shared in a professional setting, both writing and communicative skills need to be practiced and mastered.", 
        "ECTS": "4", 
        "Name": "English IV", 
        "Prerequisites": "CS-208", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-215", 
        "Course email": "winter semester:  \nhy215 AT csd DOT uoc DOT grShow email", 
        "Course website": "winter semester:  http://www.csd.uoc.gr/~hy215\nspring semester:  http://www.csd.uoc.gr/~hy215b/", 
        "Description": "Complex numbers, Euler's equations, common sinusoidal and exponential functions\nGeneralized functions, orthogonal functions, projection theorem, Schwarz inequality, inner product for signals, Parseval's Theorem\nSignals: basic terms and definitions, operations on signals\nSystems: basic terms and definitions, linearity, time-invariance, causality, stability\nOrdinary Differential Equations, impulse response, convolution\nFourier Series and Properties\nFourier Transform and Properties\nSystems in frequency domain: frequency response, magnitude response, phase response\nCorrelations and Spectral Densities: autocorrelation, cross-correlation, energy and power spectral densities\nRandom processes and random signals: bandwidth, Wiener-Khintchine theorem\nLaplace Transform and Properties\nInverse Laplace Transform with applications in solving ordinary differential equations\nSystems in the Laplace domain: minimum phase systems, all-pass systems\nSampling and Shannon's Theorem\nDiscrete Fourier Transform\nSpectral analysis of speech and audio signals. Extensive use of MATLAB.\n\r\n \r\n NULL", 
        "ECTS": "8", 
        "Name": "Applied Mathematics for Engineers", 
        "Prerequisites": "CS-110", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-217", 
        "Course email": "hy217 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy217", 
        "Description": "Introduction, probabilistic sample space, events. Operations with events. Statistical regularity. Properties of relative frequency. Mathematical probability. Axioms of probability. Restricted probability. Independence. Repeated experiments. Random variables. Probability distribution function. Continuous random variables. Functions of a random variable. Mean value, moments, variance. Probability generating functions, moment generating functions. Uniform normal, Gamma and other continuous distributions. Bernoulli, binomial, Poisson, geometric and hypergeometric discrete distributions. Multi-dimensional random variables, moments of two-dimensional random variables. Restricted moments. Co-variance and coefficient of correlation. Continuous and discrete stochastic processes. Stationary and ergodic stochastic processes. \r\n NULL", 
        "ECTS": "6", 
        "Name": "Probability", 
        "Prerequisites": "CS-110 or MATH-102", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-225", 
        "Course email": "hy225 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy225", 
        "Description": "Comprehensive introduction to current processor implementation technology. Machine language and assembly language as the hardware-to-software interface. Example machine language of a RISC processor architecture. Processor design using registers, multiplexers, decoders, ALUs, PLAs, RAMs, etc. Datapath design. Design of the control unit. Virtual memory. Peripheral devices and their attachment to the central unit. Interrupts. Brief introduction to micro-programming, pipelining, cache memory, and to parallel processors. Introduction to processor performance. Exercises and design project of a RISC processor, including its functional simulation at the register-transfer level. \r\n \r\n NULL", 
        "ECTS": "8", 
        "Name": "Computer Organization", 
        "Prerequisites": "CS-120", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-240", 
        "Course email": "hy240 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy240", 
        "Description": "The course focuses on the study of basic data structures, like arrays, stacks, queues, lists, trees, as well as on more complex data structures such as balanced trees, graphs and others. Additionally, hashing techniques, as well as data structures for the implementation of dynamic dictionaries, simple sets and sets with special operations are taught. Selected topics on sorting and basic techniques of algorithm design are also taught. \r\n \r\nThe syllabus is provided here.", 
        "ECTS": "8", 
        "Name": "Data Structures", 
        "Prerequisites": "CS-100, CS-150", 
        "Program": "Undergraduate", 
        "Suggested": "CS-118"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-252", 
        "Course email": "hy252 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy252", 
        "Description": "This course provides an introduction to object oriented programming (OOP) using the Java programming language. Its main objective is to teach the basic concepts and techniques which form the object oriented programming paradigm Students completing the course should know: \r\n \r\n(a) The model of object oriented programming: abstract data types, encapsulation, inheritance and polymorphism. \r\n \r\n(b) Fundamental features of an object oriented language like Java: object classes and interfaces, exceptions and libraries of object collections. \r\n \r\n(c) How to take the statement of a business problem and from this determine suitable logic for solving the problem; then be able to proceed to code that logic as a program written in Java. \r\n \r\n(d) How to test, document and prepare a professional looking package for each business project using javadoc. \r\n \r\nTo pass the course students should successfully carry out programmatic assignments, participate to lab exercises, design and develop a bigger project in two phases and participate to the written midterm and final exams. \r\n \r\n NULL", 
        "ECTS": "8", 
        "Name": "Object-Oriented Programming", 
        "Prerequisites": "CS-150", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-255", 
        "Course email": "hy255 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy255", 
        "Description": "The purpose of this course is to provide a solid understanding of the fundamentals in programming systems. The course covers three basic aspects of programming systems: The machine view usually presented to the programmer and the language interface to this view, program design and implementation, and programming tools that abstract tedious processes. The course uses mainly the C programming language and the Unix environment. \r\n \r\n NULL", 
        "ECTS": "6", 
        "Name": "Software Technology Laboratory", 
        "Prerequisites": "CS-150 or CS-100", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-280", 
        "Course email": "hy280 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy280", 
        "Description": "(1) Introduction to the Theory of Computation and various computational models. Recursive descriptions, URM programs, Turing machines and other computational paradigms. Equivalence of various ?complete? computation models. Examples of unsolvable problems. Rice΄s Theorem and Church΄s thesis. A comment on Godel΄s theorem. \r\n \r\n(2) (Finite) automata and basic theorems: closure properties with respect to grammatical or set-theoretic operations, equivalence of deterministic and non-deterministic automata, characterization of regular languages ? pumping theorems. \r\n \r\n(3) Context free grammars ? basic theorems: closure properties with respect to grammatical or set-theoretic operations, non-equivalence of deterministic and non-deterministic automata, characterization ? pumping theorems, LL(1) grammars. A set of theoretic exercises is given. \r\n \r\n NULL", 
        "ECTS": "6", 
        "Name": "Theory of Computation", 
        "Prerequisites": "Has no prerequisites", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-335", 
        "Course email": "hy335 AT csd DOT uoc DOT grShow email", 
        "Course website": "winter semester:  https://www.csd.uoc.gr/~hy335a/\nspring semester:  https://www.csd.uoc.gr/~hy335b/", 
        "Description": "This course covers the basic principles and technologies of computer networks. Its contents include: Introduction to communications networks and the services they offer. Design principles, layered architecture, information transmission, switching, mutliplexing. The OSI model and the Internet model. Physical layer: signal propagation, optical transmission, synchronization and framing, digitization of information. Data link layer: protocols, alternating bit protocol, go-back-N, selective repeat, examples. Local area networks: ALOHA, Ethernet, token ring, FDDI, DQDB. Network layer: naming and addressing, IP routing, address resolution, congestion control, network design, examples. Transport, session, presentation and application layers: TCP, session establishment, syntax conversion, main applications.", 
        "ECTS": "6", 
        "Name": "Computer Networks", 
        "Prerequisites": "CS-118 or CS-217", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-340", 
        "Course email": "hy340 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy340", 
        "Description": "Lexical analysis, regular expressions, use of lex. Syntactic analysis, context-free grammars, use of yacc. Syntax-directed translation, syntax trees, intermediate code generation. Low-level code generation. Memory organization. Theory of parser construction. Programming Laboratory: implementation of a complete compiler using lex and yacc.", 
        "ECTS": "8", 
        "Name": "Languages and Compilers", 
        "Prerequisites": "CS-280 and CS-240 or CS-255", 
        "Program": "Undergraduate", 
        "Suggested": "CS-225"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-345", 
        "Course email": "hy345 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy345", 
        "Description": "Description of operating system procedures and their implementation: multiprogramming, process communication (synchronization, semaphores), context switching, process scheduling, system calls, interrupt handlers, deadlock, device independent I/O, device drivers, disk scheduling, memory management, virtual memory, paging algorithms, file systems, distributed operating systems. Laboratory exercises in modifying and augmenting a simple operating system.", 
        "ECTS": "8", 
        "Name": "Operating Systems", 
        "Prerequisites": "CS-240, CS-255", 
        "Program": "Undergraduate", 
        "Suggested": "CS-225"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-360", 
        "Course email": "hy360 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy360", 
        "Description": "Introduction to DBMS architectures and file organization. Presentation of data models and methodologies for the design of (relational) data bases. Relational model: structures, algebra, calculus, database normalization theory. Operational topics: query optimization, recovery, concurrent access, security, semantic file and system structure, indexing and hashing query optimization, recovery, concurrency control, security, semantic integrity.", 
        "ECTS": "8", 
        "Name": "Files and Databases", 
        "Prerequisites": "CS-240 and {CS-118 or CS-180}", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-380", 
        "Course email": "hy380 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy380", 
        "Description": "Presenting the conceptual framework of design and analysis of algorithms: discretization, proving the partial and total correctness of algorithms, analyzing the efficiency, problems of optimal algorithms. Selective analysis of fundamental algorithms from various application areas: Combinatorics (sorting, median element, knapsack, etc.). Computational geometry (convex boundary, intersection of straight line segments, point location, etc.). Algebra (Gaussian elimination, linear programming, etc.). Graph theory (spanning trees, shortest paths, maximum flow, bipartite matching, etc.). Basic theory of NP-completeness.", 
        "ECTS": "8", 
        "Name": "Algorithms and Complexity", 
        "Prerequisites": "CS-118, CS-240", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Core Courses", 
        "Code": "CS-499", 
        "Description": "H Διπλωματική Εργασία αποτελεί το επιστέγασμα των βασικών σπουδών στο Τμήμα Επιστήμης Υπολογιστών, και τονίζει την ισχυρή εργαστηριακή και εφαρμοσμένη συνιστώσα που αυτές έχουν. Σκοπός της είναι η εξάσκηση των φοιτητριών και φοιτητών του Τμήματος στην εφαρμογή των όσων έμαθαν στη διάρκεια των σπουδών τους στην επίλυση ενός συγκεκριμένου, πρακτικού, ρεαλιστικού προβλήματος, σαν αυτά που θα κληθούν να επιλύσουν στη διάρκεια της επαγγελματικής τους σταδιοδρομίας. \r\n \r\nH έναρξη της Διπλωματικής Εργασίας (ΔΕ) μπορεί να γίνει από το πέμπτο (5ο) εξάμηνο των σπουδών και μετά και εφόσον ο φοιτητής έχει παρακολουθήσει επιτυχώς όλα τα μαθήματα κορμού των τεσσάρων πρώτων εξαμήνων.* H διάρκεια της ΔΕ μπορεί να είναι ένα (1) ή δύο (2) συνεχόμενα εξάμηνα. Το βάρος της ΔΕ καθορίζεται σε δέκα οκτώ (18) ECTS, Κάθε ΔΕ εκπονείται κατά κανόνα από έναν φοιτητή, εκτός ειδικών περιπτώσεων κατά τις οποίες μία μεγάλη εργασία μπορεί να εκπονηθεί από ομάδα δύο φοιτητών. \r\n \r\nΤο θέμα μιας ΔΕ μπορεί να συνδυάζεται με το θέμα ή τα θέματα προχωρημένων εργασιών ενός μαθήματος, ή μπορεί και να μην σχετίζεται άμεσα με μάθημα. Το περιεχόμενο της ΔΕ δεν είναι αναγκαστικά πρωτότυπο, χωρίς φυσικά και να αποκλείεται κάτι τέτοιο. H εκπόνηση της ΔΕ γίνεται υπό την εποπτεία ενός μέλους ΔΕΠ ή ενός επισκέπτη καθηγητή του Τμήματος, το οποίο μέλος ΔΕΠ τελικά δέχεται και βαθμολογεί ή απορρίπτει την εργασία. H \"καθημερινή\" επίβλεψη και καθοδήγηση του φοιτητή κατά την εκπόνηση της Διπλωματικής Eργασίας μπορεί να γίνεται και από τρίτο άτομο (π.χ. μέλος ΔΕΠ άλλου Τμήματος ή AΕΙ, μεταπτυχιακό φοιτητή, επαγγελματία υπάλληλο εταιρείας ή ερευνητικού κέντρου, κ.λ.π.). H κατάλληλη επιλογή του τρίτου αυτού ατόμου είναι ευθύνη του επόπτη την Εργασία μέλους ΔΕΠ του Τμήματος, και ο φοιτητής με την ανάληψη Διπλωματικής Εργασίας υπό την εποπτεία αυτού του μέλους ΔΕΠ συμφωνεί με την επιλογή του τρίτου ατόμου. Ο φοιτητής έχει την ευθύνη για την περιοδική ενημέρωση του εποπτεύοντος μέλους ΔΕΠ για την πρόοδο της Εργασίας, και το εποπτεύον μέλος ΔΕΠ έχει την ευθύνη για την επιβεβαίωση ότι η καθημερινή επίβλεψη και καθοδήγηση από το τυχόν τρίτο άτομο είναι η ενδεδειγμένη. Οι φοιτητές δηλώνουν ενδιαφέρον για ορισμένα από τα προτεινόμενα θέματα ΔΕ, καθένας. H επιλογή του φοιτητή που θα εκπονήσει το κάθε προταθέν θέμα γίνεται από τον καθηγητή που θα το εποπτεύσει. H διαδικασία αυτή ολοκληρώνεται στις έξι (6) πρώτες βδομάδες κάθε εξαμήνου. Την έβδομη (7η) εβδομάδα κάθε εξαμήνου, οι φοιτητές που πρόκειται να εκπονήσουν Διπλωματική Εργασία τη δηλώνουν ως μάθημα εξαμήνου, χρησιμοποιώντας τον κωδικό HΥ-499, στη γραμματεία του Τμήματος προσκομίζοντας και τη σχετική φόρμα με όλες τις πληροφορίες υπογεγραμμένη από τον Επόπτη. \r\nΜετά το πέρας της εκπόνησης της ΔΕ (το οποίο δεν μπορεί να ξεπεράσει την ημερομηνία έναρξης του μεθεπομένου εξαμήνου μετά το εξάμηνο εγγραφής σε αυτή), η ΔΕ υποβάλλεται σε κρίση από τον καθηγητή που την επόπτευσε, οπότε και γίνεται δεκτή ή απορρίπτεται. Οι ΔΕ που γίνονται δεκτές βαθμολογούνται από τον καθηγητή που τις επόπτευσε. \r\n \r\n* H υποχρέωση της επιτυχούς παρακολούθησης όλων των υποχρεωτικών μαθημάτων των τεσσάρων πρώτων εξαμήνων δεν ισχύει για τους φοιτητές που έχουν εισαχθεί πριν το ακαδ. έτος 2017-18. \r\n \r\n \r\n NULL", 
        "ECTS": "18", 
        "Name": "Bachelor΄s Thesis", 
        "Prerequisites": "Successful completion of all core courses of the first four semesters", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "CS-111", 
        "Course website": "https://www.csd.uoc.gr/~hy111/", 
        "Description": "Ι. The euclidean n-space \r\n1. The vector space structure of euclidean n-space \r\n2. Euclidean inner product, norm and distance \r\n3. Lines, planes in 3-space and hyperplanes in euclidean n-space \r\n4. Polar, cylindrical and spherical coordinates \r\n \r\nΙΙ. Limits and continuity \r\n1. Convergence of sequences \r\n2. Balls and open sets in euclidean n-space \r\n3. Closure and boundary of a set \r\n4. Closed and bounded sets \r\n5. Limits of functions \r\n6. Continuous functions and their properties \r\n \r\nIII. Curves \r\n1. Rectifiable parametrized curves in euclidean n-space \r\n2. The length of continuously differentiable parametrized curves \r\n3. A non-rectifiable parametrized curve in the plane \r\n \r\nΙV. Differential Calculus of functions of several variables \r\n1. Partial and directional derivatives \r\n2. Differentiation of an integral with respect to a parameter \r\n3. Differentiable functions of several variables \r\n4. Continuously differentiable functions \r\n5. The chain rule \r\n6. Partial derivatives of higher order and Taylor's formula \r\n7. Critical points and unconstrained extrema \r\n8. The implicit function theorem \r\n9. Hypersurfaces in euclidean n-space \r\n10. Constrained extrema, Lagrange multipliers and applications \r\n \r\nV. Integral Calculus \r\n1. Integration of functions over rectangles in euclidean n-space \r\n2. Successive integration \r\n3. Integration over more general regions \r\n4. The change of variables formula \r\n5. Integration by change to polar, cylindrical and spherical coordinates \r\n \r\nTextbook: J. Marsden, A. Tromba, Vector Calculus, 6th Edition, W. H. Freeman and \r\nCompany, New York, 2012 \r\n \r\n NULL", 
        "ECTS": "6", 
        "Name": "Calculus II", 
        "Prerequisites": "CS-110", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "CS-112", 
        "Course website": "http://www.csd.uoc.gr/~hy112/", 
        "Description": "NULL \r\n\nMechanics\n\r\n NULL   NULL   NULL  o One-dimensional motion \r\n NULL   NULL   NULL  o Vectors \r\n NULL   NULL   NULL  o Two-dimensional motion \r\n NULL   NULL   NULL  o Laws of Motion \r\n NULL   NULL   NULL  o Conservation of Energy \r\n NULL \r\n\nOscillations and Mechanical Waves\n\r\n NULL   NULL   NULL  o Oscillatory motion \r\n NULL   NULL   NULL  o Wave motion \r\n NULL   NULL   NULL  o Sound waves \r\n NULL   NULL   NULL  o Superposition and Standing waves \r\n NULL \r\n\nElectricity and Magnetism\n\r\n NULL   NULL   NULL   NULL o Electric Field \r\n NULL   NULL   NULL   NULL o Potential \r\n NULL   NULL   NULL   NULL o Electric Current and Resistance \r\n NULL   NULL   NULL   NULL o DC circuits \r\n NULL   NULL   NULL   NULL o Magnetic Field \r\n NULL   NULL   NULL   NULL o Induction \r\n NULL   NULL   NULL   NULL o AC circuits \r\n NULL   NULL   NULL   NULL o Electromagnetic waves \r\n NULL  \r\n NULL  \r\n NULL", 
        "ECTS": "8", 
        "Name": "Physics I", 
        "Prerequisites": "Has no prerequisites", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "CS-113", 
        "Description": "Hλεκτρισμός - Μαγνητισμός. Χρονικά μεταβαλλόμενα πεδία. Hλεκτρομαγνητικά κύματα - Φώς. Κβαντικά Φαινόμενα - Οι πρώτες ενδείξεις. Κβαντική φύση της ύλης. Κβαντική κίνηση σωματιδίου. Aπλά Συστήματα. Μακροσκοπικά Κβαντικά φαινόμενα. Aτομικός Πυρήνας.", 
        "ECTS": "6", 
        "Name": "Physics II", 
        "Prerequisites": "--------------------", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "CS-121", 
        "Course email": "hy121 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy121", 
        "Description": "Ohm΄s and Kirchhoff΄s Laws, loops and nodes methods, Thevenin and Norton Equivalents, linearity and superposition, elements of energy storage. Linear and non-linear circuits with OP-AMPS. Dependent sources. Active filters, introduction to digital filters. Wideband and power amplifiers. Power Supplies. Signal generators. Transmission lines. A-D and D-A converters. Simulation exercises with SPICE and Micro CAP.", 
        "ECTS": "6", 
        "Name": "Electronic Circuits", 
        "Prerequisites": "--------------------", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "CS-122", 
        "Description": "Hμιαγωγοί, βασικές αρχές, εμπλουτισμός. Hλεκτρονικές διατάξεις και κυκλώματα. Hλεκτρονικές Δίοδοι, δομή και λειτουργία. Ειδικές δίοδοι και εφαρμογές. Διπολικά τρανζίστορ επαφής (BJT). Δομή και λειτουργία. Βασικές συνδεσμολογίες. Κυκλώματα και εφαρμογές. Τρανζίστορ επίδρασης πεδίου (FET). Δομή και περιοχές λειτουργίας. Είδη FET (JFET, MOSFET) και τρόποι λειτουργίας. Ενισχυτικά κυκλώματα και εφαρμογές. Τελεστικός ενισχυτής. Ταλαντωτές. Βασικές συνδεσμολογίες. Μικροηλεκτρονική τεχνολογία. Εισαγωγή στο SPICE.", 
        "ECTS": "6", 
        "Name": "Introduction to Electronics", 
        "Prerequisites": "--------------------", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-106", 
        "Course website": "http://www.math.uoc.gr/en/courses.html", 
        "Description": "Vector spaces. Linear subspaces. Linear independence, basis, dimension. Sum of subspaces.\nLinear transformations, kernel, image, isomorphisms.\nDirect sums of vector spaces. Quotient spaces. Isomorphism theorems. Dual spaces.\nThe matrix of a linear transformation with respect to given ordered bases. Change of bases.\nInvariant subspaces. Characteristic polynomials. Algebraic and geometric multiplicity of eigenvalues. The Caley-Hamilton theorem. Triangularizable matrices.\nNorm and inner product. Gramm-Schmidt orthonormalization. Diagonalization of symmetric and hermitian matrices.", 
        "ECTS": "8", 
        "Name": "Linear Algebra I", 
        "Prerequisites": "MEM-102  or CS-119", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-108", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Vector fields, divergence, curle, differential vector calculus.\nDouble and triple integrals. Improper double and triple integrals.\nPlane and space curves.\nLine integrals, surface integrals, the integral theorems of vector calculus.", 
        "ECTS": "8", 
        "Name": "Calculus III", 
        "Prerequisites": "MEM-102 or CS-119  and MEM-105  or CS-111", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-202", 
        "Course website": "http://www.math.uoc.gr/en/courses.html", 
        "Description": "Vectors in the plane and in space, circles, spheres, ellipses, hyperbolas, parabolas, conic sections, surfaces in space, geometric inversion in the plane.", 
        "ECTS": "8", 
        "Name": "Analytic Geometry", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-203", 
        "Course website": "http://www.math.uoc.gr/en/courses.html", 
        "ECTS": "8", 
        "Name": "Euclidean Geometry", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-204", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Integers and rational numbers.\nNumber-theoretic functions.\nThe Euler function and the Moebius function.\nLinear congruences. Algebraic congruences.\nPrimitive roots. Indices.\nLegendre and Jacobi symbols.\nSpecial diophantine equations.", 
        "ECTS": "8", 
        "Name": "Number Theory", 
        "Prerequisites": "MEM-103 or CS-118", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-211", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Axiomatic foundation of the reals. The completeness axiom.\nSequences of real numbers. The definition of the limit. Elementary properties. Subsequences. Cauchy sequences. liminf, limsup.\nSeries of real numbers. Convergence tests. Absolute and conditional convergence. Rearrangements and products.\nFunctions of one variable. Accumulation points. Limits of a function. Continuous functions. The maximum value theorem. The intermediate value theorem. Continuity of the inverse.\nDerivatives. The mean value theorem. Chain rule, the inverse function theorem. Taylor's theorem. L’Hôpital's rule. Convex functions.", 
        "ECTS": "7", 
        "Name": "Analysis I", 
        "Prerequisites": "MEM-101 or CS-110", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-213", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Topology of the complex plane.\nAnalytic functions, line integrals, and power series.\nCauchy's integral theorem and applications.", 
        "ECTS": "8", 
        "Name": "Complex Analysis", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-221", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Review of the basics of set theory.\nThe integers, divisibility, euclidean division, gcd, lcm. The fundamental theorem of arithmetic.\nGroups. The integers and the integers mod n as cyclic groups.\nGroup homomorphisms. The classification of cyclic groups. Subgroups, cosets, Lagrange's theorem.\nRings. Integral domains, fields. Subrings. Ring homomorphisms.\nThe theorems of Fermat and Euler. Congruences.\nPolynomial rings.", 
        "ECTS": "8", 
        "Name": "Algebra I", 
        "Prerequisites": "MEM-102 or CS-119", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-223", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Vector spaces. Subspaces. Linear independence, basis, dimension. Sum of subspaces.\nLinear maps, Subspaces related to a linear map. Composition. Isomorphisms.\nDirect sum of vector spaces. Quotient space. Isomorphism theorems. Dual spaces.\nMatrix of a linear map in a basis. Change of basis.\nInvariant subspaces. Characteristic polynomial of a matrix. Algebraic and geometrical multiplicity of eigenvalues. Caley-Hamilton theorem. triangularisation of a matrix.\nNorm and scalar product. Gramm-Schmidt orthonormalisation. Diagonalisation of symmetric and of hermitian matrices.", 
        "ECTS": "8", 
        "Name": "Linear Algebra II", 
        "Prerequisites": "ΜΕΜ-106", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-224", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Generators, dihedral groups, permutation groups.\nIsomorphisms, Cayley's theorem.\nProducts of groups. Quotient groups.\nGroup actions.\nCauchy's theorem.\nCounting orbits.\nThe Sylow Theorems. The classification of groups of order ≤ 15.\nSelection of topics e.g.: Solvable groups, abelian groups, introduction to representation theory.", 
        "ECTS": "8", 
        "Name": "Group Theory", 
        "Prerequisites": "MEM-221", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-231", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Curves and surfaces in Euclidean space. Introduction to the intrinsic geometry of surfaces.", 
        "ECTS": "8", 
        "Name": "Differential Geometry", 
        "Prerequisites": "MEM-102  or CS-119", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-233", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Euclid's axioms. Hilbert's axioms. Consistency.\nAbsolute geometry. Euclidean geometry. Basic results. Conic sections. Pencils of circles.\nSpherical geometry. Projective geometry.\nHyperbolic geometry. Hyperbolic distance, angle of parallelism. Geodesics, circles. Hyperbolic area.", 
        "ECTS": "8", 
        "Name": "Geometry", 
        "Prerequisites": "MEM-102  or CS-119", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-242", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Brief review of basic concepts (algebra of sets, relatioins and functions, etc.).\nConstruction of the set of natural numbers.\nOrdinal numbers and their arithmetic.\nThe axiom of choice.\nCardinal numbers and their arithmetic.", 
        "ECTS": "8", 
        "Name": "Set Theory", 
        "Prerequisites": "MEM-103 or CS-118", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-245", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Classical cryptography. Study of the following cryptosystems: transposition, substitution, affine, Vigenère, Hill, permutation, stream ciphers. Cryptoanalysis of all the above cryptosystems.\nRSA and factorization, public-key cryptography. The RSA cryptosystem. Encryption, \"attack\", cryptoanalysis, factorization algorithm.\nOther public-key cryptosystems: ElGamal and discrete logarithm, finite field, elliptic curve, knapsack.\nSignatures.", 
        "ECTS": "8", 
        "Name": "Introduction to cryptography", 
        "Prerequisites": "MEM-221", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-251", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Introduction (floating point arithmetic, rounding and truncation error).\nRoot-finding method (bisection method, fixed point theorems, fixed point iteration/general iteration method, Newton method and secant method).\nSystems of (linear) equations (Gauss elimination for linear systems, partial pivoting, vector and matrix norms, mode indicator, of linear system, introduction to stability of linear systems, introduction to iterative methods).\nInterpolation and approximation (Lagrange polynomials, Newton representations of Lagrange polynomial, Hermite interpolation, linear and cubic polynomials/interpolation of continuous functions and piecewise linear and cubic polynomials).\nNumerical integration (Newton-Cotes integration formulas, trapezoidal rule, Simpson’s rule, composite numerical integration, Gauss-Legendre integration).\nLab projects, implementation and analysis of the algorithms and programming languages.", 
        "ECTS": "8", 
        "Name": "Numerical Analysis", 
        "Prerequisites": "MEM-101 or CS-110, MEM-102 or CS-119, CS-150", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-252", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Numerical methods for the initial value problem for ordinary differential equations. Euler’s methods, Runge-Kutta, multistep methods.\nConsistency, stability and convergence. Error analysis and estimation.\nApplications in Physics and Biology.\nFinite difference and element methods for the two-point boundary value problem.\nLab projects.", 
        "ECTS": "8", 
        "Name": "Numerical Solution of Ordinary Differential Equations", 
        "Prerequisites": "MEM-102  or CS-119, MEM-108, CS-150", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-253", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Finite difference and element methods in piecewise linear polynomial approximation for the two-point boundary value problem with various boundary conditions.\nFinite difference methods for the Poisson equation.\nFinite difference and element methods/method for initial and boundary value problems for evolutionary partial differential equations (heat equation, wave equation, first order hyperbolic type, Schrodinger equation).\nLab projects, implementation and analysis of the algorithms and programming languages.", 
        "ECTS": "8", 
        "Name": "Numerical Solution of Partial Differential Equations", 
        "Prerequisites": "MEM-102  or CS-119, MEM-108, CS-150", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-254", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Vector and matrix norms\nSensitivity of linear systems. Matrix condition number and analysis of linear systems in the presence of disturbances/ analysis of linear systems in the presence of actuator saturation and L2-disturbances/theorem of disturbance of linear system.\nLU decomposition. Round-off (error) analysis of Gaussian estimation.\nCholesky decomposition. Linear systems with positive fixed matrix, area and sparse matrices/efficient approximate solution of sparse linear systems/an introduction to sparse matrices.\nIterative methods: Jacobi, Gauss-Seidel, conjugate gradient method, preconditioning techniques (for large linear systems).\nLinear least squares problems. Rectangular matrices. QR decomposition. Householder transformation,. Singular value decomposition (SVD).\nThe eigenvalue-eigenvector problem.\nLab projects, implementation and analysis of the algorithms and programming languages.", 
        "ECTS": "8", 
        "Name": "Numerical Linear Algebra", 
        "Prerequisites": "MEM-106, MEM-108, CS-150", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-255", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Optimal approximations. Existence- uniqueness. Optimal approximations in Euclidean spaces.\nNormal equations - Fourier representation - Orthogonal polynomials.\nUniform approximation: characterization of optimal uniform approximations and calculation with Remez methods.\nInterpolation in one and two dimensions. Interpolation with splines. Approximation properties of splines.\nNumerical integration: Newton-Cotes, Romberg, Gauss.\nLab projects, implementation and analysis of the algorithms and programming languages.", 
        "ECTS": "8", 
        "Name": "Approximation Theory and Applications", 
        "Prerequisites": "MEM-106, MEM-211, CS-150", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-262", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Modes of stochastic convergence, Slutsky’s theorem, stabilization theorem, the theory of dispersion models.\nParametric statistical models, statistical sampling (theory), statistical functions, occupancy statistics, statistical stability, statistical criteria.\nEstimator: Parametric spaces, methods of moments, maximum likelihood estimation, least squares estimation, Bayes’ estimators and minimum-variance unbiased estimator. Cramer-Frechet-Rao inequality, efficient estimators, asymptotic behavior of estimators, confidence intervals.\nStatistical hypothesis testing: parametric assumptions, Neyman-Pearson theory, likelihood-ratio test and asymptotic behavior, asymptotic theory of testing statistical hypothesis, testing of normality, linear regression model.\nLab projects, implementation of methods using statistical software.", 
        "ECTS": "8", 
        "Name": "Parametrical Statistical Inference", 
        "Prerequisites": "MEM-101 or CS-110, MEM-102 or CS-119, MEM-261 or CS-217", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-264", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Sampling distribution.\nEvaluation of generalized linear model assumptions using randomization. Dispersion analysis.\nGraphical methods in statistics, test of normality and transformation, model assessment.\nExploratory statistics.\nExamples of biology, Medicine, Econometrics, etc.\nLab projects, implementation of methods using statistical software.", 
        "ECTS": "8", 
        "Name": "Applied Statistics", 
        "Prerequisites": "MEM-101 or CS-110, MEM-102 or CS-119, MEM-261 or CS-217", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-271", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Part I (ordinary differential equations)\n\nIntroduction with examples from Physics.\nEquations with separable variables and equations that can be reduced to them.\nComplete equations, integrating factor.\nLinear equations of first order and equations that can be reduced to them (Bernoulli, Riccati).\nLinear equations of higher order, general solution. Linear equations of higher order with constant coefficients, Euler equation.\nNon-homogeneous linear equations, method of variation of parameters, method of undetermined coefficients.\n\r\n NULL \r\n\r\nPart II (Differential equations with partial derivatives with two independent variables)\n\nIntroduction with examples from Physics.\nEquations of first order, systems of equations of first order.\nClassification of equations of second order.\nWave equation, the Cauchy problem, d’Alembert formula.\nFourier series (basic notions).\nFourier method for the Wave equation and diffusion equation, Dirichlet and Neumann boundary conditions. Laplace equation.", 
        "ECTS": "7", 
        "Name": "Differential Equations", 
        "Prerequisites": "MEM-105  or CS-111", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-281", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "The physical properties of fluids.\nConservation laws of mass, momentum, angular momentum and energy.\nIdeal fluids.\nVorticity and vortex lines.\nEuler and Navier Stokes equations.\nPotential flow, special solutions through complex functions.\nStokes flow.\nPrandtl boundary layer and Ekman boundary layer.", 
        "ECTS": "8", 
        "Name": "Theory of Fluids", 
        "Prerequisites": "MEM-108, MEM-271", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-282", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Dimensional analysis, dimensionless variables and parameters.\nFundamental notions of theoretical mechanics: Newton's laws of motion.\nVariational calculus and Euler-Lagrange equations.\nConservation laws. Application to the modelling of mechanical systems.\nModels for the dynamics of point vortices in fluids and of charges in an electric and magnetic field.\nLinear and nonlinear systems of differential equations and stability of fixed points.\nPopulation models in Biology. Dynamics of two interacting species.\nProject on mathematical modelling.", 
        "ECTS": "8", 
        "Name": "Mathematical Modelling", 
        "Prerequisites": "MEM-106, MEM-108, MEM-271", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-284", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Waves and 1st order PDEs.\nHyperbolic systems, and the nonlinear wave equation.\nWave equation in two and three dimensions.\nPropagation in layered and non-homogeneous media.\ngeometric optics.\nDispersive linear waves.\nAsymptotic behaviour, group velocity and amplitude equations.\nEnergy propagation.\nMulti-scale problems and homogenisation.\nWKB method and paraxial approximation.", 
        "ECTS": "8", 
        "Name": "Wave Propagation", 
        "Prerequisites": "MEM-108, MEM-271", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-293", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Linear Programming.\nSimplex method.\nDuality, Sensitivity.\nNon linear programming.\nConvex programming.", 
        "ECTS": "8", 
        "Name": "Optimization Theory", 
        "Prerequisites": "MEM-102  or CS-119, MEM-105", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "MEM-297", 
        "Course website": "http://www.math.uoc.gr/el/courses.html", 
        "Description": "Στατικά Παίγνια, Παίγνια Κανονικής Μορφής.\nΙσορροπία κατά Nash, Aλγόριθμοι, παραδείγματα και Εφαρμογές.\nΠαίγνια με ρίσκο, Θεώρημα Von Neumann-Morgenstern, Παίγνια με θόρυβο και η έννοια της εντροπίας.\nΠληθυσμιακά παίγνια και σχετικές έννοιες ισορροπίας.\nΕξελικτικά παίγνια, εξελικτικές δυναμικές και ευστάθεια.\nΣτοχαστικά εξελικτικά παίγνια και παίγνια ανάμεσα σε πολλαπλά δρώντα υποκείμενα (multi-agent games).", 
        "ECTS": "8", 
        "Name": "Game Theory", 
        "Prerequisites": "MEM-251, MEM-271", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "PHYS-102", 
        "Course website": "http://www.physics.uoc.gr/el/courses/4", 
        "Description": "This course is a continuation of General Physics I and it covers intensively the material of Electricity, Magnetism and Optics that is normally taught in High Schools, but using higher mathematics. Use of differential calculus and of simple differential equations is made in the presentation of the physical laws and in the solution of problems.", 
        "ECTS": "7", 
        "Name": "General Physics II", 
        "Prerequisites": "--", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "PHYS-103", 
        "Course website": "http://www.physics.uoc.gr/el/courses/5", 
        "Description": "The course consists of a series of informative seminars in topics of contemporary physics. The aim, apart from updating students in modern, active topics in physics, is also to bring undergraduates in contact with the research activity of the department. Consequently the course is intended exclusively for first and second year students . \r\n \r\nIndicative seminar topics: \r\nThe ten scales of matter, Three enigma and their solution: The Uncertainty principle, Elementary particles and cosmology, Superconductivity, Laser cooling and Bose-Einstein condensation, Micro/Nano-electronics, Modern astrophysics, Quantum Optics, X-ray lasers.  \r\n NULL", 
        "ECTS": "3", 
        "Name": "Topics in Modern Physics I", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "PHYS-201", 
        "Course website": "http://www.physics.uoc.gr/el/courses/courses/11", 
        "Description": "The course is addressed to second year students. It's goal is to introduce the students to the basic principles of quantum mechanics and its implications to the physical word. Emphasis is given to the modern description of the interaction between matter and radiation and its applications. \r\n \r\nQuantum description of electromagnetic radiation. The Blackbody radiation, the explanation of Planck, Photoelectric effect, Compton effect, Light and Gravity \r\nQuantum description of matter. The planetary model for the atom, the theory of Bohr, the wave-particle duality of de Broglie \r\nThe formulation of quantum physics, the wavefunction and Schroedinger's equation. Motion of a particle in a box. The statistical meaning of the wavefunction and the quantum-mechanical observables. The uncertainty principle \r\nSimple applications. The harmonic oscillator, the one-dimentional step potential, the tunneling effect and its applications \r\nQuantum mechanics in three dimensions. The hydrogen atom, Zeeman effect, the Ster-Gerlac experiment, Spin and Pauli's exclusion principle, The atomic structure of matter \r\nStatistical Physics. Maxwell-Bolztman distribution, Quantum statistics, Bose-Einsten and the photon gas, FErmi-Dirac statistics and the free electrons in metals \r\nLight absorption, spontaneous and stimulated emission - Population inversion and the functioning of lasers - Applications  \r\n NULL", 
        "ECTS": "7", 
        "Name": "Introduction to Modern Physics I", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "PHYS-230", 
        "Course website": "http://www.physics.uoc.gr/el/courses/23", 
        "Description": "The course is addressed to second year students. It consists of an introduction to the physics that determine the formation and evolution of stars. It also includes a presentation of the basic history in the developments of various astronomical concepts, as well as an extended coverage on the details of the physical processes in the Sun. \r\nIntroduction to Astronomy (Historical concepts - the Solar System), Distances and luminosities of celestial objects (Telescopes), Solar radiation and other stars (Solar constant - Black body radiation), Physical process in the Sun (Nuclear reactions - Nucleosynthesis - Photon Diffusion - Turbulence - Phenomena of the Solar atmosphere), Stellar clusters and the Hertzsprung - Russell diagram, Structure and Evolution of stars (Main sequence- Giant branch - Supernovae explosions), Stellar remnants (White Dwarfs - Neutron Stars - Black Holes), Double stars (Compact stars in a double system - accretion disks - jets). \r\n NULL", 
        "ECTS": "6", 
        "Name": "Astrophysics I", 
        "Prerequisites": "As in the Dept. of Physics", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "PHYS-371", 
        "Course website": "http://www.physics.uoc.gr/el/courses/courses/90", 
        "Description": "The course is intended to second and third year undergraduate students. It is an intensive introduction to the linear electrical circuit theory. \r\n \r\nSimple Circuits: Definitions of circuit elements, Kirchoff’s laws, Linearity and Superposition, Elements of circuits Topology, Operational amplifiers \r\nAnalysis Methods of Ohmic Circuits: Nodal analysis, Mesh analysis, Introduction to Duality, Thevenin’s and Norton’s theorems. \r\nTransient Circuits: Inductance, Capacitance, Step function, RL, RC and RLC circuits \r\nSinusoidal Analysis: Complex excitations, Phasors, Impedance, Nodal and Mesh analysis for sinusoidal excitations, Thevenin and Norton theorems in phasor space, Phasor diagrams, Frequency response, Average power and RMS values \r\nComplex Frequency: Complex frequency and generalized phasors, Circuit analysis with complex frequencies excitations, Transfer functions, Poles and Zeros, Bode plots. \r\nFourier Analysis: Periodic excitations and Fourier analyis, Fourier transform, Impulse excitation, Convolution and Time-domain response, Frequency domain response \r\nLaplace transforms: Definition and properties of Laplace transforms, Convolution, Applications of Laplace transforms, Transfer functions and Laplace transforms.  \r\n NULL", 
        "ECTS": "6", 
        "Name": "Introduction to Microelectronics", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "PHYS-273", 
        "Course website": "http://www.physics.uoc.gr/el/courses/courses/20", 
        "Description": "The course aims to 2nd year physics students. It introduces the basic concepts of solid state physics, the properties of semiconductors and the methods of semiconductor growth and processing. It explains the realization and operation of fundamental microelectronics and optoelectronics semiconductor devices (diode, transistor, laser diode, LED, photodiode), which constitute the underlying technology of the modern information and telecommunication systems. \nIntroduction to Semiconductors: Kinds of solid state materials, chemical bonds and electrical properties, families of semiconductors and their applications, energy bands and bandgap, the free electron and hole carriers, donor and acceptor dopants, n-type and p-type conductivity. \r\nPhysics of carriers: Fermi-Dirac statistics, Fermi level, effective densities of states, distribution and concentrations of carriers at thermal equilibrium, dependence on donor and acceptor concentrations and temperature, drift and diffusion currents, generation-recombination, absorption and emission of photons. \r\nTechniques of semiconductor growth and device processing: Crystal growth and epitaxial growth, Czochralski methods for Si and GaAs, molecular beam epitaxy (MBE), metallorganic vapor phase epitaxy (MOVPE), device fabrication processes, photolithography, kinds of photoresists, fabrication of metallic patterns with the lift-off or etching methods. \r\nSemiconductor devices and integrated circuits: Energy band diagrams of semiconductor devices, pn junction, built-in electric field, rectification behavior, operation of LED, photodiode and solar cell, fabrication and operation of laser diode, the FET transistors, fabrication and operation of GaAs MESFET, introduction to dimensions, speed and fabrication of integrated circuits.", 
        "ECTS": "6", 
        "Name": "Introduction to Semiconductors", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "PHYS-277", 
        "Course website": "http://www.physics.uoc.gr/el/courses/courses/40", 
        "Description": "This course on Electron Microscopy (E/M) aims to introduce students of the Physics and other departments to the basic concepts of E/M starting from basic principles of Geometric and Physical optics and extending to study and operational principles of the Scanning Electron Microscope (SEM), the Transmission Electron Microscope (TEM) and the Atomic Force Microscope (AFM), including pumping and vacuum procedures and fundamentals of image formation. It also covers the subjects of qualitative and quantitative microanalysis (ZAF method) and electron diffraction. The class is concluding with an “on-hands” lab practice of students on techniques for the preparation and observation/analysis of various inorganic and organic samples. \r\n \r\nThis course on Electron Microscopy (E/M) aims to introduce students of the Physics and other departments to the basic concepts of E/M starting from basic principles of Geometric and Physical optics and extending to study and operational principles of the Scanning Electron Microscope (SEM), the Transmission Electron Microscope (TEM) and the Atomic Force Microscope (AFM), including pumping and vacuum procedures and fundamentals of image formation. It also covers the subjects of qualitative and quantitative microanalysis (ZAF method) and electron diffraction. The class is concluding with an “on-hands” lab practice of students on techniques for the preparation and observation/analysis of various inorganic and organic samples. \r\n NULL", 
        "ECTS": "6", 
        "Name": "Electron Microscopy", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "PHYS-331", 
        "Course website": "http://www.physics.uoc.gr/el/courses/courses/75", 
        "Description": "The course is addressed to second year students. It is an introduction to the physics of the interstellar medium, galaxies and modern cosmology. It is recommended that the students who wish to follow the course have completed successfully the courses Astrophysics-I and Introduction to Modern Physics \r\n \r\nInterstellar medium (interstellar dust, gaseous nebulae, cosmic rays) \r\nThe Galaxy (shape and size of the Galaxy, stellar populations, differential rotation) \r\nInactive and Active galaxies (Galaxy classification, distribution of brightness and mass, active galaxies, models of active galaxies) \r\nGalaxy clusters and expansion of the Universe (Galaxy interactions, galaxy mergers, galaxy clusters, expansion of the Universe) \r\nGravity and Cosmology (Newtonian Cosmology, Theory of General Relativity, Geometry of Space-time) \r\nBig-Bang and formation of matter (The theory of Bing Bang, Inflation, formation of matter)  \r\n NULL", 
        "ECTS": "6", 
        "Name": "Astrophysics II", 
        "Prerequisites": "PHYS-230 Astrophysics I", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "PHYS-338", 
        "Course website": "http://www.physics.uoc.gr/el/courses/courses/125", 
        "Description": "The goal of this course is the acquaintance with the satellite remote sensing and the acquisition of basic knowledge for its applications in land, atmosphere and sea. The potential of satellite remote sensing to support a broad range of scientific domains that involved in the study of environment will be presented and the benefits for the students of Department of Physics will be pointed out. Because the broad range of applications of remote sensing, their presentations will not be exhaustive, but the objective is the provided information to set the basis for the further studying. For this reason, some important applications of remote sensing have been selected for detailed presentation. Will be taught techniques for satellite image processing, based on methodological approaches that allow the combined exploitation of satellite derived information in several spectral areas to estimate spatio-temporal distributions of bio-geo-physical parameters. Finally, the synergy of satellite remote sensing and Geographical Information Systems will be demonstrated; the importance of remote sensing in global, national and local levels will be discussed and the role of European Space Agency will be presented.", 
        "ECTS": "6", 
        "Name": "Principles and Applications of Remote Sensing", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "PHYS-361", 
        "Course website": "http://www.physics.uoc.gr/el/courses/courses/25", 
        "Description": "This is an introductory course which aims to provide a first introduction to recent developments in the field of Optoelectronics-Photonics. It covers a broad range of issues related to materials, devices and applications with emphasis on the principles of lasers and their applications in Biology, Medicine, Telecommunications, Environmental and Industrial research. The course is appropriate for 3rd or 4th year students of Departments of Chemistry and Materials Science and Technology. \n1) Light sources: Thermal, LED, Plasma Sources, Lasers-Principles of operation and Technology, Laser types, Laser light modulation. \r\n2) Detectors: Thermal detectors, Photodiodes Photomultipliers, Channel Plates, CCD, Semiconductor detectors, imaging systems. \r\n3) Displays: Photoluminescence, Plasma displays, Liquid Crystal Detectors (LCD), Organic LED (OLED). \r\n4) Optical fibers and waveguides: Principles of operations, Bragg gratings and optical fiber sensor. \r\n5) Applications in: Biology, Medicine, Industry, Telecommunications, Cultural Heritage.", 
        "ECTS": "6", 
        "Name": "Introduction to Optoelectronics - Photonics", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "PHYS-374", 
        "Course website": "http://www.physics.uoc.gr/el/courses/courses/26", 
        "Description": "The goal of the course is to provide some introductory knowledge in the use of basic elements of electronics and in the design of simple circuits. \r\n \r\nIntroduction to Electronic Systems: Information and Signals, Frequency Spectrum of Signals, Analog and Digital Signals, Amplifiers, Circuit Models for Amplifiers, Frequency Response of Amplifiers. \r\nOperational Amplifiers: The Op-Amp Terminals, the Ideal Op-Amp, Analysis of Circuits Containing Ideal Op-Amps, The Inverting Configuration, Application of the Inverting Configuration, the Non-Inverting Configuration, Examples of Op-Amp Circuits, Non Ideal Performance of Op-Amps, the Internal Structure of IC Op-Amps, Large Signal Operation of Op-Amps, Common-Mode Rejection, Input and Output Resistances. \r\nDiodes: The Ideal Diode, Terminal Characteristics of Real Junction Diode, Analysis of Diode Circuits, the Small-Signal Model and its Application, the Breakdown Region and Zener Diodes, Rectifiers, Limiters and Comparators, the Clamped Capacitor or DC Restored, Physical Operation of Diodes, Basic Semiconductor Concepts, the pn Junction under Open-Circuit Conditions, the pn Junction under Reverse-Bias Conditions, the pn Junction in the Beakdown Region, the pn Juction under Forward-Bias Conditions. \r\nBipolar Junction Transistors(BJT's): Physical Structure and Models of Operation, Operation of the npn Transistor in the Active Region, the pnp Transistor, Circuit Symbols and Convections, Graphical Representation of Transistor Characteristics, DC Analysis of Transistor Circuits, the Transistor as an Amplifier, Biasing the BJT for Discrete-Circuit Design, Classical Single-Stage Transistor Amplifiers, the Transistor as a Switch, Complete Static Characteristics and Graphical Analysis. \r\nField Effect Transistors(FET's): Structure and Physical Operation of Enhancement-Type MOSFET, I-V Characteristics of the Enhancement-Type MOSFET, the Depletion-Type MOSFET, the Junction Field Effect Transistor, Analysis of FET Circuits in DC Operation, the FET as an Amplifier, FET Biasing with Discrete Elements, Classical Single-Stage FET Amplifiers, Integrated-Circuit MOS Amplifiers, Switches with FET's, Gallium Arsenide MESFET's. \r\n NULL", 
        "ECTS": "7", 
        "Name": "Elements of Electronics", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Mathematics and Physics", 
        "Code": "PHYS-457", 
        "Course website": "http://www.physics.uoc.gr/el/courses/courses/42", 
        "Description": "The course introduces science students to the main concepts of financial derivatives, financial risk and risk management, as well as to the quantitative methods of pricing of financial derivatives, and risk measurement and management (Value-at-Risk methodology). As hands-on practice, students must a) form a (virtual) portfolio of real assets, monitor its risk, and report weekly on its performance (returns), b) forecast the market prices of certain assets, and c) create and price their own call and put options. \nIntroduction to financial systems, markets, and financial derivatives. Futures and options contracts. Swaps. Types of options and option positions. Option pricing methods: binomial-tree methods and the Black-Scholes model; assumptions about how stock prices evolve (Wiener process, Ito process), expected return, volatility, risk-neutral valuation. Hedging risk (naked and covered positions, delta-hedging). The Value-at-Risk (VaR) measure. VaR of a portfolio of assets; estimating volatilities and correlations. Liquidity risk, credit risk. The Basle Accord.", 
        "ECTS": "6", 
        "Name": "Mathematics of Finance I", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "ETY-141", 
        "Course website": "https://www.materials.uoc.gr/el/undergrad/courses/ETY141/", 
        "Description": "Ιστορική Aναδρομή\nΠαραδείγματα Υλικών/ Εφαρμογές\nΚαταστάσεις ύλης\nΜια πρώτη γνωριμία: μέταλλα, κεραμικά, πολυμερή, βιο-υλικά, ημιαγωγοί, σύνθετα υλικά.\nΒασικά στοιχεία δομής\nAτομικά χαρακτηριστικά, περιοδικός πίνακας, δεσμοί, ενέργειες δεσμών, πακετάρισμα ιόντων, κρυσταλλική δομή.\nΒασικά στοιχεία ιδιοτήτων\n\n\nΜηχανικές, θερμικές, ηλεκτρικές.\nΜέταλλα, κεραμικά, πλαστικά.", 
        "ECTS": "6", 
        "Name": "Materials I: Introduction to Materials Science", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "ETY-242", 
        "Course website": "https://www.materials.uoc.gr/el/undergrad/courses/ETY242/", 
        "ECTS": "6", 
        "Name": "Materials II: Microelectronics Optoelectronics Materials", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "ETY-302", 
        "Course website": "https://www.materials.uoc.gr/el/undergrad/courses/ETY302/", 
        "Description": "Κύματα στην φύση\nΚυματική διάδοση\nΓεωμετρική οπτική, Φακοί και κάτοπτρα\nΠόλωση\nΣυμβολή\nΠερίθλαση\nΠηγές - Aνιχνευτές φωτός", 
        "ECTS": "5", 
        "Name": "Optics and Waves", 
        "Prerequisites": "ETY-102 or PHYS-102 or CS-113 and ETY-112 or MEM-105", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "BIOL-205", 
        "Course website": "http://www.biology.uoc.gr/el/department-courses/955", 
        "Description": "General genetics: introduction; Mendelian analysis; chromosomal theory of inheritance; extension of Mendelian analysis; linkage; genomics; chromosomal aberrations: structural differences; chromosomal aberrations: differences in chromosome number; DNA structure; the nature of the gene; DNA function; gene mutations; extranuclear genomes (mitochondria/chloroplasts); bacterial and phage genetics: conjugation; transduction; transformation; recombinant DNA technology (vectors, restriction enzymes – DNA mapping, cloning, selection, library construction, DNA sequencing), control of gene expression I (prokaryotes, lac operon, positive and negative control).", 
        "ECTS": "6", 
        "Name": "Genetics Ι", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "BIOL-207", 
        "Course website": "http://www.biology.uoc.gr/el/department-courses/1205", 
        "Description": "Objectives of the course NULL (preferably expressed in terms of learning outcomes and competences): understanding life processes at the molecular level.\nCourse contents: NULL DNA is the genetic material: hallmark experiments, Molecular Biology from an evolutionary perspective, mutations and mutant phenotypes. NULL The content of genomes: genome mapping, genomes of model organisms and human, chloroplast and mitochondrial DNA. NULL The interrupted gene: origin of introns, exons and protein domains, alternative splicing. NULL Gene families: structure and evolution, pseudogenes. NULL Chromosomes: solving the packaging problem, nuclear matrix, chromosomal territories, euchromatinheterochromatin, centromeres, telomeres. NULL Nucleosomes: structure and assembly, histone tails and modifications, levels of chromatin orgnization. NULL Messenger RNA: structure and stability of mRNA, the role of miRNAs. NULL Transcription of eukaryotic genes by RNA polymerase II: assembly of the basal transcriptional apparatus, transcription initiation, promoters and enhancers, LCRs, insulators. Activation-repression of transcription: types of transcription factors and modes of activation-repression, co-activators, corepressors, histone acetyltransferases-deacetylases-methyltransferases, DNA methyltransferases. NULL Regulation of transcription at the chromatin level: histone code, chromatin remodeling complexes. NULL Epigenetic phenomena-cell «memory»: perpetuation of chromatin structures, imprinted genes, Xchromosome inactivation. NULL RNA splicing and processing: the spliceosome and the splicing reactions, group I and II introns, catalytic RNA, regulation of (alternative) splicing. DNA replication in eukaryotes: enzymes, co-ordination of replication in both strands, control of DNA replication and cell cycle. NULL DNA damage and repair in eukaryotes: types and sources of damage, repair systems (direct reversion, base excision, nucleotide excision, mismatch repair, double strand break repair).", 
        "ECTS": "6", 
        "Name": "Molecular Biology", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "BIOL-315", 
        "Course website": "http://www.biology.uoc.gr/el/department-courses/977", 
        "Description": "Objectives of the course (preferably expressed in terms of learning outcomes and competences): NULL  NULL Introduction to the concepts of probability and statistics in the analysis of primary biological sequences. Brief description of available resources (databases and web-services) on the world wide web. Introductory Analysis of nucleotide and protein sequences, performance of homology searches NULL  and basic phylogenetic analysis. Use of computational methods for genome analysis, comparative genomics and text mining.\nCourse contents: NULL Introduction to Probability. “Words” in Biological Sequences. Motif Search. Gene-finding strategies and Genome Annotation. Proteomics, analysis of protein sequence and structure. Alignment methods, homology and similarity search. Phylogenetic Analysis. Analysis of sequence variation. Clustering and Classification methods. Introduction to Comparative Genomics. Intorduction to biological networks and Systems Biology.", 
        "ECTS": "5", 
        "Name": "Computational Biology", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "BIOL-405", 
        "Course website": "http://www.biology.uoc.gr/el/department-courses/986", 
        "Description": "Objectives of the course (preferably expressed in terms of learning outcomes and competences): NULL  NULL Adequate knowledge and understanding of the Terrestrial Ecosystem Management seen in the social context.\nCourse contents: NULL Concepts and terminology. Environmental Ethics. Ecosystem management in the social context. Scientific basis of ecosystem management. Development and Environment. Environmental policy. International Conventions. Environmental Law, Ecological Risk Assessment. The concept of sustainability. Indicators of sustainability. NULL In situ NULL and NULL ex situ NULL conservation. Population management. Habitat management. Atmospheric pollution and climate change. Soil pollution. Ecological restoration. Monitoring of environmental changes. Mapping of natural environment, ecosystems and vegetation. Geographical Information Systems (GIS). Protected areas. NATURA 2000. Local communities. International experience on the management of protected areas.", 
        "ECTS": "4", 
        "Name": "Terrestrial Ecosystem Management", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "ΕΤΥ-494", 
        "ECTS": "Όπως στο Τμήμα Επιστήμης και Τεχνολογίας Υλικών", 
        "Name": "Εισαγωγή στη Βιοϊατρική Μηχανική", 
        "Prerequisites": "As in Dept. of Materials Science and Technology", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "ΜΕΜ-341", 
        "Description": "Το μάθημα αφορά στην εισαγωγή και την ανάλυση των βασικών αρχών, εννοιών και υποδειγμάτων της Μικροοικονομικής Θεωρίας. Συγκεκριμένα, επικεντρώνεται στον τρόπο που οι κύριοι φορείς της οικονομικής δραστηριότητας, άτομα και ομάδες, λαμβάνουν αποφάσεις και αλληλεπιδρούν στις αγορές. H ύλη καλύπτει μία εισαγωγή στο μεθοδολογία στην οικονομική επιστήμη, με ιδιαίτερη έμφαση σε οικονομικά υποδείγματα που εξηγούν θεμελιακές έννοιες στα οικονομικά, όπως η αξία-ωφελιμότητα, το κόστος, η διαδικασία της παραγωγής κ.ά. Συμπεριλαμβάνονται, η θεωρία της ζήτησης και της προσφοράς, εφαρμογές της ελαστικότητας, συναρτήσεις κόστους και προϊόντος, αποφάσεις παραγωγής των επιχειρήσεων σε διαφορετικές μορφές αγορών, η αξιολόγηση της αποτελεσματικότητας των δυνάμεων της αγοράς, μορφές αναποτελεσματικής κατανομής των πόρων καθώς και τρόποι παρέμβασης των κυβερνήσεων στη λειτουργία της αγοράς για διόρθωση των ατελειών της. \r\n NULL", 
        "ECTS": "6", 
        "Name": "Economic Theory I", 
        "Prerequisites": "Has no prerequisites", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "ΜΕΜ-342", 
        "Description": "Το μάθημα αφορά στην εισαγωγή και την ανάλυση των βασικών αρχών, εννοιών και υποδειγμάτων της Μακροοικονομικής Θεωρίας. Στο πλαίσιο αυτό, συνεχίζοντας από την Οικονομική Ι που αφορά τη Μικροοικονομική, εξετάζεται ο τρόπος που η οικονομία λειτουργεί σα σύστημα. H ύλη εμβαθύνει στις θεωρίες που αφορούν τα ζητήματα μίας εθνικής οικονομίας στο πλαίσιο της παγκόσμιας και σε έννοιες όπως το συνολικό προϊόν και εισόδημα, ανεργία, πληθωρισμός και μεγέθυνση, που είναι κρίσιμες για την κατανόηση του οικονομικού, επιχειρηματικού και κοινωνικού περιβάλλοντος. Πιο συγκεκριμένα, αναλύονται οι τρόποι μέτρησης των βασικών μακροοικονομικών μεγεθών (π.χ. AΕΠ, ανεργία, επίπεδο τιμών) και των οικονομικών ανισοτήτων, επεξηγούνται οι παράγοντες που οδηγούν στην οικονομική ανάπτυξη, παρουσιάζονται τα υποδείγματα μακροοικονομικής ισορροπίας, η έννοια του χρήματος και η λειτουργία του νομισματικού συστήματος, ενώ δίνεται έμφαση στην ανάλυση των βραχυχρόνιων διακυμάνσεων και την επίδραση της δημοσιονομικής και νομισματικής πολιτικής. Τέλος, γίνεται μία εισαγωγή στην οικονομική της ανοικτής οικονομίας, στο διεθνές εμπόριο και στη θεωρία του συγκριτικού πλεονεκτήματος. \r\n NULL", 
        "ECTS": "6", 
        "Name": "Economic Theory II", 
        "Prerequisites": "Has no prerequisites", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "OIK-1002", 
        "Course website": "https://economics.soc.uoc.gr/el/page/1/13/vasika", 
        "Description": "Τα μαθήματα της Μακροοικονομικής Θεωρίας αφορούν την μελέτη της γενικής ισορροπίας ενός οικονομικού συστήματος καθώς και της ανάλυσης των επιπτώσεων των ασκούμενων,δημοσιονομικών και νομισματικών, κυβερνητικών πολιτικών. Στο επίκεντρο βρίσκεται η συνολική παραγωγή αγαθών και υπηρεσιών αλλά και η συστηματική ανάλυση μεγεθών, όπως ο πληθωρισμός, η ανεργία, το ισοζύγιο πληρωμών και οι συναλλαγματικές ισοτιμίες μιας οικονομίας. H Μακροοικονομική Θεωρία ασχολείται με την αύξηση της παραγωγής σε μεγάλες χρονικές περιόδους (οικονομική μεγέθυνση), καθώς και με τις βραχυχρόνιες διακυμάνσεις (άνθηση και ύφεση), οι οποίες δημιουργούν τον οικονομικό κύκλο μιας οικονομίας.", 
        "ECTS": "5,5", 
        "Name": "Macroeconomic Theory I", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "OIK-1005", 
        "Course website": "https://economics.soc.uoc.gr/el/page/1/13/vasika", 
        "Description": "Σκοπός των μαθημάτων της Μικροοικονομικής Θεωρίας είναι να δώσει στους φοιτητές ένα ισχυρό θεωρητικό υπόβαθρο για την ανάλυση της οικονομικής συμπεριφοράς καταναλωτών και παραγωγών στις σύγχρονες οικονομίες, ώστε να τους βοηθήσει στη μετέπειτα μελέτη τους στο χώρο των θεωρητικών και εφαρμοσμένων οικονομικών. Δεδομένου ότι είναι πρακτικά αδύνατο να αναλυθούν με λεπτομέρεια τα χαρακτηριστικά των σύγχρονων οικονομιών, η Μικροοικονομική Θεωρία επιλέγει βασικά στοιχεία από τις περίπλοκες διασυνδέσεις μεταξύ των οικονομικών μονάδων δημιουργώντας σχετικά απλά υποδείγματα για την ανάλυση της συμπεριφοράς τους και τη διαμόρφωση κατάλληλων μέτρων πολιτικής.", 
        "ECTS": "5,5", 
        "Name": "Microeconomic Theory I", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "OIK-2003", 
        "Course website": "https://economics.soc.uoc.gr/el/page/1/13/vasika", 
        "Description": "Σκοπός και των NULL  μαθημάτων στην Οικονομετρία είναι να δώσουν στους φοιτητές ένα ισχυρό υπόβαθρο για τις οικονομετρικές μεθόδους που χρησιμοποιούν οι οικονομολόγοι για την εμπειρική ανάλυση στατιστικών δεδομένων και για την ακόλουθη εκτίμηση των οικονομικών υποδειγμάτων. Ειδικότερα, τα μαθήματα της Οικονομετρίας χρησιμοποιούν συγκεκριμένες στατιστικές μεθόδους τις οποίες εφαρμόζουν για την εκτίμηση των οικονομικών υποδειγμάτων και για τον έλεγχο των οικονομικών θεωριών. Aποτελούν χρήσιμη γνώση για κάθε απόφοιτο που είτε ενδιαφέρεται να ακολουθήσει κάποιο οικονομικό επάγγελμα ή να συνεχίσει για μεταπτυχιακές σπουδές στα οικονομικά.", 
        "ECTS": "5,5", 
        "Name": "Econometrics I", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Elective Courses from Other Sciences", 
        "Code": "SSE-101", 
        "Course website": "http://www.sse.uoc.gr/files/items/1/1572/syllabus_arxes_oikonomias_ee2017-18.pdf", 
        "Description": "H ύλη ακολουθεί δύο βασικές ενότητες, σύμφωνα και με τα κύρια πεδία της Οικονομικής θεωρίας. Aφού γίνει μία εισαγωγή στο περιεχόμενο του μαθήματος και αποσαφηνιστούν ορισμένες βασικές έννοιες και οι εναλλακτικές προσεγγίσεις επί των οικονομικών προβλημάτων, στη συνέχεια, τις πρώτες εβδομάδες, οι διαλέξεις καλύπτουν τα βασικότερα θέματα της Μικροοικονομικής, όπως τη θεωρία της ζήτησης, την οργάνωση της προσφοράς και τις μορφές αγορών κ.ά.. Τις τελευταίες περίπου 6 εβδομάδες αντίστοιχα αναλύονται θέματα της Μακροοικονομικής, όπως η μέτρηση του εθνικού εισοδήματος, η συνολική ζήτηση, η συνθήκη της γενικής ισορροπίας, η επίδραση της οικονομικής πολιτικής κ.ά.. Στο ίδιο πλαίσιο, ορισμένες έννοιες που θα απασχολήσουν το μάθημα είναι η οικονομική μεγέθυνση, ο πληθωρισμός, η ανεργία, ο ρόλος του χρηματοπιστωτικού συστήματος αλλά και το κόστος παραγωγής, η χρησιμότητα και οι επιλογές του καταναλωτή κ.ά.. Τέλος, καθώς βασικός σκοπός είναι η κατανόηση και ανάλυση του σύγχρονου οικονομικού περιβάλλοντος, γίνεται εισαγωγή σε απλά ποσοτικά εργαλεία, αφετέρου σε θέματα που παρουσιάζουν σήμερα ιδιαίτερο ενδιαφέρον, όπως τα οφέλη του διεθνούς εμπορίου, η οργάνωση της νομισματικής ζώνης του ευρώ και η οικονομική κρίση. \r\n NULL", 
        "ECTS": "6", 
        "Name": "Principles of Economy", 
        "Prerequisites": "---", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Networks and Telecommunications", 
        "Code": "CS-330", 
        "Course email": "hy330 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy330", 
        "Description": "Introduction to Telecommunication Systems Concepts: Definition, model and elements of telecommunication systems, telecommunication channels' attributes. Signals and systems theory review in the frequency domain, basic concepts of stochastic processes. Analog modulation techniques, amplitude modulation (DSB-SC, AM, SSB, VSB, QAM), angle modulation (PM, FM), noise effect on analogue communication systems, radio and television broadcasting and reception. Analog pulse modulation: Sampling theory and practice, binary PAM, PDM, PPM, multiplexing in time. Digital pulse modulation: Analog signals quantization, pulse code modulation (PCM, DPCM, DM), line coding, base-band transmission, base-band pulse shaping. Band-pass digital communication model.", 
        "ECTS": "6", 
        "Name": "Introduction to Telecommunication Theory", 
        "Prerequisites": "Has no prerequisites", 
        "Program": "Undergraduate", 
        "Suggested": "CS-217, CS-215"
    }, 
    {
        "Area": "Networks and Telecommunications", 
        "Code": "CS-370", 
        "Course email": "hy370 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy370", 
        "Description": "Discrete-time Signals and Systems: basic terms and definitions, convolution, impulse response\nDifference equations and their solution: steady-state response, zero-state response\nDiscrete-time Fourier Transform and its Properties\nZ Transform and its Properties\nLTI System Analysis in frequency and Z domain\n\nFrequency response \r\nStability \r\nSystem Structures \r\nAll-pass systems, minimum and maximum phase systems \r\nLinear phase systems\n\nIIR and FIR filters\nFilter design techniques\nApplications on music, speech, and image signals. The course is supported by weekly lab exercises in MATLAB.\n\r\n \r\n NULL", 
        "ECTS": "6", 
        "Name": "Digital Signal Processing", 
        "Prerequisites": "CS-215", 
        "Program": "Undergraduate", 
        "Suggested": "CS-111"
    }, 
    {
        "Area": "Networks and Telecommunications", 
        "Code": "CS-435", 
        "Course email": "hy435 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy435", 
        "Description": "The purpose of the course is to present the basic network technologies (for traditional networks, for Internet-type networks and for integrated digital services networks) and to gain experience with the execution of corresponding laboratory and programming exercises with commercial switching and routing devices and with a simulator. The syllabus includes among others:\r\n\nReview of the basic principles of communication networks and modern trends\nEthernet, switched Ethernet, routing at IP level, LAN configuration, SARP, DNS, TCP / IP, UDP / IP, security issues (firewalls).\nNetwork management and programming in a network environment:\r\n\t\nProgramming with Unix and Windows sockets, client-server model, SNMP.\n\n\nSimple applications: smtp, telnet, ftp\nBasics of Asynchronous Transfer Mode (ATM).\nCombination of IP and ATM technologies: Classical IP-over-ATM, LAN Emulation.", 
        "ECTS": "6", 
        "Name": "Network Technology & Programming Lab", 
        "Prerequisites": "CS-335", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Networks and Telecommunications", 
        "Code": "CS-436", 
        "Course email": "hy436 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy436", 
        "Description": "Learning Objectives: \r\nProgramming with python \r\nSDN concepts, technologies, and applications \r\nHands-on experience with SDN tools \r\nSDN research topics in University of Crete, FORTH, and other places \r\n \r\nCourse Logistics \r\nThe course will cover SDN principles, OpenFlow, SDN controllers, network virtualisation, software-defined radio, SDN security, and SDN research topics. The students will prepare 5 programming assignments on which their grading will be based (there will be no final exam or midterm). In addition, there will be guest lectures on selected research topics from experts in the area. \r\n NULL", 
        "ECTS": "6", 
        "Name": "Software Defined Networks (SDN)", 
        "Prerequisites": "CS-335", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Networks and Telecommunications", 
        "Code": "CS-439", 
        "Course email": "hy439 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy439", 
        "Description": "The goal of this course is the theoretical presentation of basic network technology (both traditional networks and integrated service digital networks), an introduction to integrated network design, and acquiring experience through related laboratory exercises with commercial switching and routing hardware as well as simulators. The course content covers: Review of basic principles in communication networks and modern trends. Ethernet, switched Ethernet, TCP/IP, UDP/IP, routing at the IP level, voice-over-IP. Network management and programming in a network environment: programming with sockets in UNIX and Windows or client-server model, SNMP, modern techniques (CORBA). Synchronous digital hierarchy (SDH). The basics regarding Asynchronous Transfer Mode (ATM). Combination of IP and ATM technologies: classical IP-over-ATM, LAN emulation. Related laboratory exercises. Integrated network design based on the above: requirements, choice of technology, topology and configuration, management, etc. Design project using a simulator. \r\n \r\n NULL", 
        "ECTS": "6", 
        "Name": "Wireless Networks and Moblile Computing", 
        "Prerequisites": "CS-335", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Networks and Telecommunications", 
        "Code": "CS-474", 
        "Course email": "hy474 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy474/", 
        "Description": "The course is introductory to methods, tools and techniques for creating and processing multimedia content (text, hypertext, voice, sound, graphics, images and videos), for multimedia information retrieval and multimedia communications. The following topics are covered: \r\n NULL \r\n\nHypermedia\nDigital image\nDigital video\n2-D and 3-D graphics and animation\nDigital audio\nTools for multimedia applications\nImage compression (PNG, GIF, JPEG, JPEG2000)\nVideo compression (MPEG, HEVC)\nAudio compression (MPEG)\nSpeech compression (MPEG-4)\nMultimedia content description (MPEG-7)\nMultimedia content retrieval\nNetwork Services and Protocols for Multimedia Communications\nInternet Multimedia Content Distribution\n\r\n \r\n NULL", 
        "ECTS": "6", 
        "Name": "Multimedia Technology", 
        "Prerequisites": "CS-215", 
        "Program": "Undergraduate", 
        "Suggested": "CS-370, CS-217"
    }, 
    {
        "Area": "Hardware and Computer Systems", 
        "Code": "CS-220", 
        "Course email": "hy220 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy220", 
        "Description": "Hardware description languages (e.g. Verilog), simulation. Overview of FPGA technology, automatic synthesis tools for FPGA. Timing diagrams, delay reduction techniques. Tri-state drivers, buses, handshake protocols, commercial bus examples. Memories, e.g. SRAM and SDRAM. Clock generation, clock skew, use of PLL. Asynchronous systems, arbitration. Metastability, synchronization failure, FIFOs and elastic buffers, empty/full flag synchronization. Serial transmission and reception, clock recovery, framing. PCB technology and chip packages.", 
        "ECTS": "6", 
        "Name": "Digital Circuits Lab", 
        "Prerequisites": "CS-120", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Hardware and Computer Systems", 
        "Code": "CS-422", 
        "Course email": "hy422 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy422", 
        "Description": "NMOS and PMOS transistors as switches. Logic gates in CMOS. Extensive introduction to the fabrication technology and cost of integrated circuits (IC). Shape, layout, and stick-diagrams of transistors, wires, and gates. Dynamic logic, pass-transistors, transmission gates, multiplexors, tristate drivers. Sequential circuits, two-phase clocking. Circuits with a regular layout topology: decoders, PLA/ROM, priority encoders, adders, shifters, memory. Datapath, pitch-matching. Semi-custom IC technologies (gate-arrays, standard cells, FPGA). The equation of speed: parasitic capacitance, charge current, delay time. Static and dynamic power consumption. The tradeoff between speed and power consumption. Parasitic capacitance of transistors and wires. Examples of speed and power consumption of popular configurations. Speeding circuits up by precharging. Static and dynamic RAM. Off-chip communication: pads, pad drivers. Power and clock distribution. Putting it all together: capabilities, limitations, and cost of VLSI systems, architectures that are appropriate for exploiting this technology. Specific examples of digital systems and of their VLSI implementation.", 
        "ECTS": "6", 
        "Name": "Introduction to VLSI Systems", 
        "Prerequisites": "CS-225", 
        "Program": "Undergraduate", 
        "Suggested": "CS-121"
    }, 
    {
        "Area": "Hardware and Computer Systems", 
        "Code": "CS-425", 
        "Course email": "hy425 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy425", 
        "Description": "Pipelining with a fixed number of stages per instruction: hardware resource utilization, interdependencies, bypassing, waiting, delayed branches, interrupts. Instruction set architecture: basic principles of computer system design, cost, performance, frequency of instruction usage. Performance evaluation using benchmarks. Study of various instruction set types and their components. Examples of machines and their instruction sets. Memory and I/O systems: cache memory, parameters (cache size, block size, associativity), and their effect on performance. Virtual memory, address translation, protection, TLBs. Page faults and pipelining. Physical/virtual-address cache memories (index/tag), aliasing, flushing. I/O and peripheral devices.", 
        "ECTS": "6", 
        "Name": "Computer Systems Architecture", 
        "Prerequisites": "CS-225", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Hardware and Computer Systems", 
        "Code": "CS-428", 
        "Course email": "hy428 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy428", 
        "Description": "The purpose of this course is to provide an understanding of issues in the design and implementation of embedded systems as well as related operating system and virtualization support. Topics include: Communication and peripherals, interrupt handling, NAND FLASH and memory technologies, concurrency, real-time characteristics, operating systems support, kernel drivers, memory management, network and storage I/O in the kernel, system virtualization for processor, memory, I/O. CS428 is a lab-oriented course with hands-on assignments that guide you through working with embedded processors and the Linux operating system. We prototype a working runtime system for the Lego NXT platform that controls all peripherals and we review in a hand-on manner the fundamentals of ARM-based Linux virtualization.", 
        "ECTS": "6", 
        "Name": "Microprocessors and Peripherals Laboratory", 
        "Prerequisites": "CS-225", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Hardware and Computer Systems", 
        "Code": "CS-446", 
        "Description": "The aim of this course is to introduce students to the world of managed runtime systems. Managed runtime systems are the ones responsible for executing interpreted languages. Such languages are usually compiled to some intermediate representation instead of native machine code, this intermediate representation is then parsed and executed by the corresponding managed runtime system. In this course we study how managed programming languages are implemented in the managed runtime systems, and more specifically the Java programming language. We also focus on how automatic memory management works, and how just-in-time compilers optimize code on the fly.", 
        "ECTS": "6", 
        "Name": "Managed Runtime Systems", 
        "Prerequisites": "CS-252, CS-345", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Software Systems and Applications", 
        "Code": "CS-342", 
        "Course website": "https://www.csd.uoc.gr/~hy342/", 
        "Description": "Το μάθημα έχει σκοπό την κατανόηση τρόπων που προσφέρονται από διάφορες γλώσσες και συστήματα για την έκφραση παραλληλισμού και τις κατηγορίες προβλημάτων για τα οποία κάθε ένα σύστημα είναι καλύτερο. Επίσης, έχει σκοπό την τριβή με συνήθη προβλήματα και λάθη σε παράλληλα προγράμματα καθώς και κάποια εργαλεία ή μεθόδους αποφυγής τους. Τέλος, έχει σκοπό την ανάπτυξη της παράλληλης σκέψης στο σχεδιασμό και την αρχιτεκτονική λογισμικού. \r\n NULL  \r\nΎλη μαθήματος (οργάνωση διδασκαλίας ανά εβδομάδα): \r\n NULL \r\n\n\n\n1\nΕισαγωγή στα POSIX threads.\n\n\n2\nAνάπτυξη εφαρμογών με POSIX threads, parallel patterns.\n\n\n3\nΕισαγωγή στο OpenMP - fine grain parallelism.\n\n\n4\nAνάπτυξη εφαρμογών σε OpenMP, πρότυπα συγχρονισμού, βελτιστοποίηση χρονοδρομολόγησης.\n\n\n5\nΕισαγωγή στη βιβλιοθήκη παραλληλισμού TBB - coarse grain patterns.\n\n\n6\nAναδρομικός παραλληλισμός σε TBB, πρότυπα συγχρονισμού.\n\n\n7\nΠαράλληλος προγραμματισμός με ροή δεδομένων – TBB flow graph.\n\n\n8\nΕισαγωγή στα Java Threads – διαφορές.\n\n\n9\nΠρότυπα παραλληλισμού Java, παράλληλες δομές δεδομένων.\n\n\n10\nΠρότυπα συγχρονισμού, ασύγχρονη κλήση συναρτήσεων, futures.\n\n\n11\nJava Threads και αμετάβλητες δομές δεδομένων – Εισαγωγή στη γλώσσα Scala\n\n\n12\nΣυναρτησιακός προγραμματισμός με τη γλώσσα Scala – Παραλληλισμός χωρίς memory updates.\n\n\n13\nΠαραλληλισμός και κατανεμημένα συστήματα σε Scala.\n\n\n\r\n NULL  \r\n \r\n NULL", 
        "ECTS": "6", 
        "Name": "Parallel Programming", 
        "Prerequisites": "CS-252", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Software Systems and Applications", 
        "Code": "CS-351", 
        "Course email": "hy351 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy351", 
        "Description": "The course starts with a quick introduction to information systems analysis and design explaining why analysis and design are important in the development of computerized systems and introduces fundamental concepts such as those of systems theory organizations. It then presents and discusses the stages of information system development, using basic principles from software engineering. Students are also exposed to techniques for gathering and organizing information about an organization and how to transform this into a feasibility study. It then concentrates on the activities of systems analysis and the basic notation of the Unified Modeling Language (UML). It introduces use cases, class diagrams, sequence diagrams, collaboration diagrams, activity diagrams, and state-chart diagrams. The phase after requirements analysis is system design. This part covers the transition to design, the distinction between system design and object design, system architecture, design patterns and the design of user interfaces and data storage. Throughout the course focus is given on the use of CASE tools as aids for systems analysis and design, and in particular the use of the standardized modelling language, UML. This is a pragmatic course. The techniques taught are by-and-large heuristics that have been shown to improve the quality of an information system, and reduce the time it takes to complete it. Because of its pragmatic nature, the course concentrates on apprenticeship techniques where students work in groups on an actual information system problem.", 
        "ECTS": "6", 
        "Name": "Information System Analysis and Design", 
        "Prerequisites": "CS-252", 
        "Program": "Undergraduate", 
        "Suggested": "CS-352, CS-360"
    }, 
    {
        "Area": "Software Systems and Applications", 
        "Code": "CS-352", 
        "Course email": "hy352 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy352", 
        "Description": "Παρουσιάζονται οι κύριες κατασκευαστικές μέθοδοι, διαδικασίες και τεχνικές για την μετάβαση από τη μικροσκοπική κλίμακα του προγράμματος στη μακροσκοπική κλίμακα των συστημάτων. Ο κύριος σκοπός του μαθήματος είναι να παρουσιάσει τις μεθόδους ανάπτυξης μεγάλων συστημάτων ως σύνθεση πολλών ανεξαρτήτων τμημάτων, μέσα από καλά ελεγχόμενες διαδικασίες ανάπτυξης, επιτρέποντας επαναχρησιμοποίηση, ελαχιστοποίηση λαθών, καθώς και ευέλικτη επέκταση και τροποποίηση. Το μάθημα περιλαμβάνει τις εξής ενότητες: Διαδικασία και μοντέλα παραγωγής λογισμικού. Προσδιορισμός, καταγραφή και ανάλυση απαιτήσεων. Μετρικές λογισμικού και εκτίμηση κόστους. Μοντέλο ωριμότητας ικανότητας. Aρχιτεκτονική σχεδίαση, θεμελιώδεις οικογένειες αρχιτεκτονικών, σχέση αρχιτεκτονικής και πηγαίου κώδικα. Σχεδίαση λογισμικού, προοπτικές σχεδίασης (δεδομένα, λειτουργίες, οργάνωση, συμπεριφορά). Δομημένος προγραμματισμός. Στοιχεία οντοκεντρικού προγραμματισμού. Βασικά συστατικά στοιχεία οντοκεντρικού προγραμματισμού, προσφερόμενες δομές στη C++, κληρονομικότητα και πολυμορφισμός (έννοια, εφαρμογή, διαχείριση μνήμης και υλοποίηση από τον μεταγλωττιστή), αφηρημένες κλάσεις. Διαδικασία ελέγχου συστήματος. Aξιοπιστία λογισμικού, πιστοποίηση ποιότητας, ISO πρότυπα ποιότητας, καταγραφή λαθών, design by contract, κατηγορίες λαθών, αυτόματος εντοπισμός και αυτοέλεγχος πηγαίου κώδικα (self checking code). Εύστροφες διαδικασίες ανάπτυξης, εντροπία λογισμικού, δημιουργική αναδιάρθρωση (re-factoring), εισαγωγή στην φιλοσοφία του «ακραίου» προγραμματισμού (extreme programming), προγραμματισμός με εντατικούς ελέγχους και δοκιμές (test-first programming). Εισαγωγή στα καλούπια κώδικα και τα σχεδιαστικά πρότυπα. Δημιουργία, τεκμηρίωση και χρήση προτύπων, ανάλυση συγκεκριμένων σχεδιαστικών προτύπων, εισαγωγή στη χρήση templates της γλώσσας C++.", 
        "ECTS": "6", 
        "Name": "Software Engineering", 
        "Prerequisites": "CS-252", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Software Systems and Applications", 
        "Code": "CS-358", 
        "Course email": "hy358 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy358", 
        "Description": "The focus of this introductory course in Computer Graphics is to present the basic algorithms and methods that allow the creation of modern computer graphics applications. The course includes GPU programming and basic principles for modelling, rendering and animation. In greater detail it consists of: 3D transformations, Projections, virtual worlds, scenegraphs, shader-based OpenGL programming, lighting, texturing, shading, basic animation, hidden-surface elimination, illumination models, intersection methods, ray-tracing, shadows and global illumination. The course includes cross-platform, lab computer graphics assignments and projects (windows, mac, linux) via modern shader-based OpenGL and GPU programming.", 
        "ECTS": "6", 
        "Name": "Computer Graphics", 
        "Prerequisites": "CS-240", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Software Systems and Applications", 
        "Code": "CS-359", 
        "Course email": "hy359 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy359", 
        "Description": "Web Programming deals with application development at the higher level of the TCP/IP protocol (application layer). The main difference between Web applications compared to other kinds of applications is that the Web is used the underlying platform which in turn has several consequences, i.e. all input and output operations should be supported through the capabilities offered by Web Browsers, while the business logic of the system should be encapsulated for being operational through Web servers and the HTTP protocol which is a stateless protocol. This course is an introduction to the technologies necessary for the development of Web applications. At first the course focuses on client-side technologies (HTML5, CSS, JavaScript), then on server side technologies (Servlets, JSP and others) and finally the course contains an introduction to XML technologies (XML, XML Schema, XPath, XSLT). Apart from the final written exam, students have to carry out programmatic exercises and a project whose objective is to design and develop a complex web application.", 
        "ECTS": "6", 
        "Name": "Web Programming", 
        "Prerequisites": "CS-252", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Software Systems and Applications", 
        "Code": "CS-452", 
        "Course email": "hy452 AT csd DOT uoc DOT grShow email", 
        "Course website": "https://elearn.uoc.gr/course/info.php?id=500", 
        "Description": "Το HΥ-452 έχει σκοπό την εισαγωγή στην επιστήμη και τεχνολογία των υπηρεσιών. Οι υπηρεσίες αποτελούν πλέον το κυρίαρχο τμήμα της οικονομικής δραστηριότητας στις ανεπτυγμένες και αναπτυσσόμενες χώρες, στην Ελλάδα μάλιστα λόγω του τουρισμού και της εμπορικής ναυτιλίας αποτελούν την ραχοκοκαλιά της οικονομίας. H χρήση των ΤΠΕ υπήρξε βασικός μοχλός σε αυτή την ραγδαία ανάπτυξη των υπηρεσιών και αναμένεται να παραμείνει και στο μέλλον. H επιστήμη των υπηρεσιών μελετά τις υπηρεσίες στο χρόνο, διατυπώνει θεωρίες για τη λειτουργία τους και προβλέψεις για την μελλοντική τους εξέλιξη. H τεχνολογία των υπηρεσιών σχεδιάζει, μετρά, αναλύει, και υλοποιεί σύνθετα συστήματα υπηρεσιών που αποτελούνται από μηχανές (υλικό και λογισμικό) και ανθρώπους. Το μάθημα αρχίζει με τη χρήση των δεδομένων (2 εβδομάδες) και της γνώσης (2 εβδομάδες) στο διαδίκτυο για την έξυπνη σύνθεση νέων υπηρεσιών: 1.XML Basics, XPath, XML Schema Languages, XSLT. 1η σειρά ασκήσεων. 2.Εισαγωγή στο Σημασιολογικό Ιστό, Εισαγωγή στην OWL και OWL-S. 2η σειρά σσκήσεων. Συνεχίζει με μια εισαγωγή στις ροές εργασίας (workflows) και τις επιχειρηματικές διαδικασίες (business processes) (2 εβδομάδες): εισαγωγή σε μοντέλα και πρότυπα ροών εργασίας, σε συνδυασμό με το σύνολο προτύπων WS*. Εισαγωγή σε μοντέλα, ανάλυση, σχεδίαση και ανάπτυξη επιχειρηματικών διαδικασιών. Eκμάθηση εργαλείων και περιβαλλόντων για μοντελοποίηση και σχεδίαση επιχειρηματικών διαδικασιών: WBI Modeler, BPMN tools, Adonis, κλπ. 3η σειρά ασκήσεων. Συνεχίζει με μια εισαγωγή στην οικονομία των υπηρεσιών, που στην ουσία είναι οικονομία δικτύων (2 εβδομάδες): 1.καμπύλες προσφοράς και ζήτησης, θεωρίες αξίας και τρόποι υπολογισμού της, utility functions, στοιχεία μαθηματικού προγραμματισμού και βελτιστοποίησης για χρήση στην οικονομοτεχνική ανάλυση συστημάτων υπηρεσιών (service systems), 4η σειρά ασκήσεων. Συνεχίζει με τη σύνδεση οικονομικών και επιχειρηματικών στόχων με τα δίκτυα (συστήματα) υπηρεσιών, τις επιχειρηματικές διαδικασίες, (2 εβδομάδες): μοντελοποίηση και οικονομοτεχνική ανάλυση συστημάτων υπηρεσιών, συσχέτιση με επιχειρηματικές διαδικασίες (business processes), σειρά προτύπων WS*, Rosetta Net, eBXML. Παραγωγή σκελετού κώδικα για ροές εργασίας με χρήση κατάλληλων εργαλείων (π.χ. με Studio Developer). 5η σειρά ασκήσεων. Kαι καταλήγει με θέματα υλοποίησης των νέων υπηρεσιών σε υπάρχοντα νέφη (clouds) υπολογιστών (2 εβδομάδες): Εισαγωγή σε συστήματα διαχείρισης συμφωνιών επιπέδου και ποιότητας υπηρεσιών (service-level agreements). Συστήματα Υπηρεσιών Νέφους (Cloud services, {infrastructure, platform, software}-as-a-Service) και IT outsourcing. Διαχείρηση (management) υπηρεσιών βάση federated configuration and change management databases (CCMDB). 6η σειρά ασκήσεων. Θα υπάρξει και μια συνολική και συνθετική μεγαλύτερη εργασία στο τέλος του εξαμήνου.", 
        "ECTS": "6", 
        "Name": "Introduction to science and technology of Services", 
        "Prerequisites": "HY-359 ή άδεια του διδάσκοντα", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Software Systems and Applications", 
        "Code": "CS-454", 
        "Course email": "hy454 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy454", 
        "Description": "Ο βασικός στόχος του µαθήµατος είναι η παρουσίαση της σύγχρονης τεχνολογίας λογισµικού και των κυρίαρχων εργαλείων, για την ανάπτυξη εφαρµογών που έχουν προηγµένες διεπαφές οι οποίες υποστηρίζουν ευφυή, κινητή, και πολυµεσική αλληλεπίδραση. Ειδικότερα, θα παρουσιαστούν: αρχιτεκτονικές, αλγόριθµοι, µοντέλα, APIs, βιβλιοθήκες λογισµικού, σχεδιαστικά λογισµικά πρότυπα, εργαλεία, πρωτόκολλα, τεχνικές σχεδίασης, και ποικίλα αποσπάσµατα από υπάρχοντα συστήµατα, για την αντιµετώπιση του σύνθετου κατασκευαστικού προβλήµατος διεπαφών µε τις παραπάνω ιδιότητες. Τα πεδία εφαρµογών στα οποία επικεντρώνεται το µάθηµα συµπεριλαµβάνουν: κινητά συστήµατα πλοήγησης και πληροφόρησης (mobile navigation and information systems), έξυπνα κιόσκια πληροφόρησης (intelligent kiosks) και ανάπτυξη παιχνιδιών (video games). NULL  \r\n \r\n NULL", 
        "ECTS": "6", 
        "Name": "N/A", 
        "Prerequisites": "CS-255", 
        "Program": "Undergraduate", 
        "Suggested": "CS-358"
    }, 
    {
        "Area": "Software Systems and Applications", 
        "Code": "CS-455", 
        "Course email": "hy455 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy455", 
        "Description": "1. Πρακτική κρυπτογραφία και πρωτοκόλλα: Ο σκοπός αυτού του τμήματος θα είναι η εξοικείωση των φοιτητών με τα θεωρητικά θεμέλια της ασφάλειας υπολογιστικών συστημάτων. Βασικά κομμάτια αυτού του τμήματος θα είναι: τύποι κρυπτογραφικών αλγορίθμων, συμμετρική και ασύμμετρη κρυπτογραφία, ανταλλαγή κλειδιών, κρυπτογραφικά πρωτοκόλλα, πρωτοκόλλα απομόνωσης (privacy protocols) \r\n \r\n2. Εξουσιοδότηση και Aυθεντικοποίηση: Έχοντας αποκτήσει τις θεμελιακές γνώσης, το μάθημα θα προχωρήσει στο πώς τα βασικά πρωτόκολλα και οι κρυπτογραφικοί αλγόριθμοι μπορούν να χρησιμοποιηθούν σε θέματα σαν: αυθεντικοποίηση βασισμένη σε κωδικούς, διαπιστευτήρια, βιομετρικά. \r\n \r\n3. Μοντέλα έλεγχου πρόσβασης: Το τμήμα αυτό έχει σκοπό την έκθεση των φοιτητών σε πιο πρακτικά θέματα ασφάλειας υπολογιστικών συστημάτων. Συγκεκριμένα πώς μοντέρνα λειτουργικά συστήματα ελέγχουν τη πρόσβαση στους διαφόρους πόρους τους. Θέματα θα καλύπτουν: λίστες έλεγχου πρόσβασης, πινάκας έλεγχου πρόσβασης, στρατιωτικά μοντέλα πρόσβασης. \r\n \r\n4. Aσφάλεια δικτύων: Μετά την μελέτη ασφάλειας υπολογιστικών κόμβων, το μάθημα τα περάσει σε θέματα ασφάλειας δικτύων. Θα μελετήσουμε θέματα: Firewalls, εικονικά προσωπικά δίκτυα, Honeypots, αναγνώριση ιών, αντιμετώπιση και εξουδετέρωση ιών, αντιμετώπιση DoS, κατανεμημένο DoS, malware, phishing, botnets, spam, intrusion detection. \r\n \r\n5. Εκμετάλλευση κώδικα: Aυτό το κομμάτι θα μελετήσει μερικές πολύ συγκεκριμένες, αλλά δημοφιλής, τεχνικές επιθέτων, όπως: code injection, race conditions, hijacking. \r\n \r\n6. Πρακτικές αξιοπιστίας κώδικα: Έχοντας καλύψει επιθέσεις το μάθημα θα εστιάσει στη προστασία κώδικα και προγραμμάτων. Μερικά βασικά θέματα θα είναι: proof-carrying code, type-safe languages, checkpointing, sandboxing, fault isolation. \r\n \r\n7. Πολιτικές ασφάλειας: Στο τελευταίο μέρος του μαθήματος θα μελετήσουμε πώς διαμορφώνετε η ασφάλεια όλων των τμημάτων ενός συστήματος χρησιμοποιώντας πολιτικές ασφαλείας. Μερικά θέματα: ορισμοί πολίτικων ασφάλειας, γλώσσες καθορισμού πολίτικων, επίλυση συγκρούσεων, αναγνώριση προβλημάτων, διαδικασίες συντήρησης. \r\n \r\nΤο εργαστήριο θα περιέχει μια σειρά από προγραμματιστικές ασκήσεις συσχετισμένες με τα παραπάνω θέματα. \r\n \r\n NULL", 
        "ECTS": "6", 
        "Name": "Internet Attacks", 
        "Prerequisites": "CS-335, CS-345", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Software Systems and Applications", 
        "Code": "CS-457", 
        "Course email": "hy457 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy457", 
        "Description": "This course is elementary in systems security, security tools and techniques. Initially, we are going to explore fundamental concepts of Cryptography, Computer Security, Software Security, Internet Security and more. \r\n \r\nSome of the topics we will cover in class: \r\n NULL \n\nCryptographic Algorithms & Tools\nUser Authentication\nAccess Control\nNetwork Basics & Database Security\nMalicious Software\nDenial of Service (DoS) Attacks\nIntrusion Detection Systems\nFirewalls\nBuffer Overflow\nSoftware Vulnerabilities\nOperating System Security\nInternet Security Protocols\n\n NULL \r\n NULL \r\n\r\nGrading \r\n NULL \r\nThe final grade is calculated as follows:\r\n\r\n\n30% Programming Assignments (The average grade in programming assignments must be 4+)\n30% Midterm Exam (Multiple choice with negative marking)\n40% Final Exam (Multiple choice with negative marking, the final exam grade must be 4+)\n\r\n \r\n NULL", 
        "ECTS": "6", 
        "Name": "Introduction to Secure Systems", 
        "Prerequisites": "CS-150", 
        "Program": "Undergraduate", 
        "Suggested": "CS-345, CS-335"
    }, 
    {
        "Area": "Software Systems and Applications", 
        "Code": "CS-459", 
        "Course email": "hy459 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy459/", 
        "Description": "Introduction. Why measure the Internet? Internet architecture. Practical issues in Network Measurement: the role of time, the role of Internet Directories, measurements across various protocol layers. Infrastructure: properties, challenges, tools. Traffic: properties, challenges, tools. Applications: DNS, World Wide Web, peer to peer systems, online games. Anonymization, security. Advanced topics: youtube, network tomography, privacy, social networks, voice over IP.", 
        "ECTS": "6", 
        "Name": "Internet Measurement and Monitoring", 
        "Prerequisites": "CS-345", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Information Systems", 
        "Code": "CS-364", 
        "Course website": "http://www.csd.uoc.gr/~hy364", 
        "Description": "Human-Computer Interaction: Overview of the field. The Human, the Computer and their Interaction. User interface design. The user-centred approach for the design and development of interactive systems: requirements engineering, prototype building, evaluation. Use of guidelines, patterns and style guides. User Experience design. Interfaces for the world wide web (WWW). Interfaces for mobile devices. New trends and approaches in Human – Computer Interaction.", 
        "ECTS": "6", 
        "Name": "Introduction to Human-Computer Interaction", 
        "Prerequisites": "CS-150", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Information Systems", 
        "Code": "CS-460", 
        "Course email": "hy460 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy460", 
        "Description": "This course is the continuity of CS360 and emphasizes on issues of implementation of Database Management Systems. Specifically, this course treats the following issues: Storage and indexing structures (primary/secondary structures, multiple level structures, structures for multidimensional data), processing, optimization and execution of queries (execution plans, cost estimation models, algebraic transformations), management of synchronous execution of transactions (serializability, synchronous execution protocols, transactions in distributed databases), information integration (mediation systems, OLAP, view mechanisms, data warehouses).", 
        "ECTS": "6", 
        "Name": "Database Management Systems", 
        "Prerequisites": "CS-360", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Information Systems", 
        "Code": "CS-463", 
        "Course email": "hy463 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy463", 
        "Description": "Information Retrieval (IR) systems give access to large amounts of online information stored as text, images, speech or video, or composite forms e.g. Web documents. IR systems should only retrieve those documents that are relevant to a user's interest but have to deal with the uncertainty of describing what a document is about and what a user is actually interested in. This course aims at introducing the area of Information Retrieval and at examining the theoretical and practical issues involved in designing, implementing and evaluating Information Retrieval systems. Upon completion of this course, each student should be able to:\n NULL \n\nunderstand the theoretical basis behind the standard models of IR (Boolean, Vector-space, Probabilistic and Logical models),\nunderstand the difficulty of representing and retrieving documents, images, speech, etc.,\nimplement, run and test a standard IR system,\nunderstand the standard methods for Web indexing and retrieval,\nunderstand how techniques from artificial intelligence, distributed systems, human-computer interaction and visualization integrate with IR, and be familiar with various algorithms and systems.\n\n NULL", 
        "ECTS": "6", 
        "Name": "Information Retrieval Systems", 
        "Prerequisites": "CS-240", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Information Systems", 
        "Code": "CS-468", 
        "Description": "The strategic interactions among multiple agents is a fundamental feature of many service systems. Decision making theory is a basic tool for describing and analyzing such interactions. \r\nThis course involves an introduction of Service Science. It integrates with game theory and economics, aiming to understand and improve service systems. Emphases are on new economy and how socioeconomic principles apply in emerging business models including networked enterprises and e-marketplaces.", 
        "ECTS": "6", 
        "Name": "Game Theory and Decision Making in Service Systems", 
        "Prerequisites": "CS-217, CS-317", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Information Systems", 
        "Code": "CS-469", 
        "Course website": "https://www.csd.uoc.gr/~hy469", 
        "Description": "Modern topics in Human – Computer Interaction: Overview. Dimensions of Diversity in Interaction (Users, Technological Platforms, context of Use). Design for All. Web Accessibility. Interface Design for eLearning.  NULL Interface Design for Accessible Games. Intelligent and Multimodal Interfaces. Visualization of (Big) Data. Modern Interaction Techniques. Interface Design for Mobile and Wearable Devices, Smart TVs, Automobiles and the new media. Virtual and Augmented Reality. Affective and Persuasive Interfaces. Human – Robot Interaction. Social Media. Computer Supported Collaborative Work. Introduction to Ambient Intelligence and Interaction in Smart Environments.", 
        "ECTS": "6", 
        "Name": "Modern Topics in Human-Computer Interaction", 
        "Prerequisites": "CS-364", 
        "Program": "Undergraduate", 
        "Suggested": "CS-359"
    }, 
    {
        "Area": "Computer Vision and Robotics", 
        "Code": "CS-371", 
        "Course website": "https://www.csd.uoc.gr/~hy371/", 
        "Description": "The course covers basic concepts and fundamental methodologies of Digital Image Processing, including the following themes : image sensing, elements of visual perception, image sampling and quantization, image file formats, image intensity transforms, histogram processing, spatial image processing, smoothing spatial filters, sharpening spatial filters, geometric transformations, 2-D Fourier transform of continuous signals, 2-D Fourier transform of discrete signals, 2-D discrete Fourier transform, image filtering in the frequency domain, 2-D fast Fourier transform, discrete cosine transform, noise reduction, image restoration, 2-D wavelet transform, color image processing, image compression fundamentals, JPEG, JPEG 2000", 
        "ECTS": "6", 
        "Name": "Digital Image Processing", 
        "Prerequisites": "CS-119", 
        "Program": "Undergraduate", 
        "Suggested": "CS-110"
    }, 
    {
        "Area": "Computer Vision and Robotics", 
        "Code": "CS-471", 
        "Course email": "hy471 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy471", 
        "Description": "The course covers basic concepts and fundamental methodologies of Digital Image Processing, including the following themes : edge detection, histogram-based segmentation. segmentation by region splitting and merging, superpixels, region growing, flooding algorithms for segmentation, Markov random field models for segmentation, segmentation using graph cuts, mean-shift algorithm, active contours, level sets, morphological image processing, watershed segmentation, boundary extraction, boundary description, image region description, image region moments, corner detection, keypoint extraction. \r\n \r\n \r\n NULL", 
        "ECTS": "6", 
        "Name": "Image Analysis", 
        "Prerequisites": "CS-371", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Computer Vision and Robotics", 
        "Code": "CS-472", 
        "Course email": "hy472 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy472", 
        "Description": "The goal of this course is the detailed study of computer vision methods that aim at a realistic interpretation of a scene based on the analysis of one or more images or videos. The course covers part of the material under the specialization area “Computational Vision and Robotics”. More specifically, the course focuses on the study of methods for image content description and representation, estimation of parametric models, estimation of 3D structure and motion, as well as topics on the detection, tracking and recognition of objects and activities. Emphasis is given on the study and the analysis of 3D information regarding the structure and the dynamic aspects of a scene. After attending the course, the student should be acquainted with relevant techniques, should be in a position to implement them as well as use them as components of broader computer vision systems, and able to study the computer vision literature.\nThe list of topics to be studied includes:\n1. NULL  NULL  Introduction to computer vision\n2. NULL  NULL  NULL  Overview of topics on image acquisition and processing (sampling quantization, color perception, smoothing and differentiation filters)\n3. NULL  NULL  NULL  Overview of topics on image analysis (edge detection, image segmentation)\n4. NULL  NULL  NULL  Texture representation, analysis and synthesis\n5. NULL  NULL  NULL  Interest point detection (Harris corner detector)\n6. NULL  NULL  NULL  Blob detection\n7. NULL  NULL  NULL  The scale Invariant Feature Transform – SIFT\n8. NULL  NULL  NULL  The Hough transform\n9. NULL  NULL  Model fitting (least squares)\n10. NULL  NULL  NULL  Robust model fitting (LMedS, RANSAC)\n11. NULL  NULL  Image alignment\n12. NULL  NULL  NULL  Camera models, lenses, projective geometry\n13. NULL  Camera calibration\n14. NULL  Epipolar geometry\n15. Stereo vision: point correspondence and 3D reconstruction\n16. NULL  NULL  Volumetric 3D reconstruction from multiple views\n17. NULL  NULL  2D motion (normal flow, optical flow)\n18. NULL  NULL  NULL  3D motion modeling NULL  (motion field, egomotion)\n19. NULL  NULL  Tracking linear dynamical systems\n20. NULL  NULL  Tracking with particle filtering\n21. NULL  NULL  Object detection\n22. NULL  Object recognition\n23. NULL  Object category recognition\r\n24. NULL  Activity recognition", 
        "ECTS": "6", 
        "Name": "Computer Vision", 
        "Prerequisites": "CS-371", 
        "Program": "Undergraduate", 
        "Suggested": "CS-471"
    }, 
    {
        "Area": "Computer Vision and Robotics", 
        "Code": "CS-473", 
        "Course email": "hy473 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy473", 
        "Description": "Pattern Recognition (PR) as an information reduction/mapping/characterization process. Introduction to statistical PR techniques. Feature vectors/spaces, discriminant functions, maximum likelihood test, Bayes decision theory, parameter estimation, parametric approaches to learning, non-parametric approaches to learning, K-nearest neighbor approach, serial decision methods. Unsupervised clustering, K-Means algorithm. Feature selection and extraction. Relaxation labeling, classification using Markov fields. Object description using the KLT transform (object eigenspaces), recognition using projective invariants. The course includes an extended programming project based on a recent scientific publication.", 
        "ECTS": "6", 
        "Name": "Pattern Recognition", 
        "Prerequisites": "CS-217, CS-119", 
        "Program": "Undergraduate", 
        "Suggested": "CS-215, CS-370"
    }, 
    {
        "Area": "Computer Vision and Robotics", 
        "Code": "CS-475", 
        "Course email": "hy475 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy475", 
        "Description": "Στόχος του μαθήματος είναι η παρουσίαση και μελέτη των μηχανισμών με τους οποίους ένα ρομποτικό σύστημα μπορεί να αποκτήσει αντίληψη του περιβάλλοντός του και να την χρησιμοποιήσει για να πλοηγηθεί αυτόνομα σε αυτό. Στα πλαίσια αυτά παρουσιάζονται και μελετούνται θέματα όπως, τύποι και αρχές λειτουργίας αισθητήρων, χαρτογράφηση χώρων, αυτογνωσία θέσης (localization), σχεδίαση μονοπατιού, ανίχνευση και αποφυγή εμποδίων, ορόσημα και τοπολογική πλοήγηση. Το μάθημα περιλαμβάνει μελέτη και εκπόνηση εκτενούς προγραμματιστικής εργασίας που βασίζεται σε μια σύγχρονη επιστημονική δημοσίευση.", 
        "ECTS": "6", 
        "Name": "Autonomous Robotic Navigation", 
        "Prerequisites": "CS-217, CS-119", 
        "Program": "Undergraduate", 
        "Suggested": "CS-471"
    }, 
    {
        "Area": "Algorithms and Computation Theory", 
        "Code": "CS-317", 
        "Course email": "hy317 AT cs DOT uoc DOT grShow email", 
        "Course website": "http://www.csd.uoc.gr/~hy317", 
        "Description": "Tο μάθημα επικεντρώνεται σε στοιχεία της θεωρίας καθώς και στις εφαρμογές και στην προσομοίωση των στοχαστικών διαδικασιών σε προβλήματα του Μηχανικού. Οι φοιτητές αποκτούν μία ισχυρή θεωρητική βάση στο να προσεγγίζουν θέματα σε περιοχές της Επιστήμης των Υπολογιστών όπως οι τηλεπικοινωνίες και τα δίκτυα, η ανάλυση επιδόσεων συστημάτων, η ανάλυση του Διαδικτύου, η βιοπληροφορική, η κωδικοποίηση ήχου, η επεξεργασία εικόνας και video κ.α. H κατανόηση της θεωρίας επιτυγχάνεται μέσα από τον συνδυασμό θεωρητικών και βασισμένων σε υπολογιστή εργασιών. \r\n \r\nΎλη\n\nΟρισμός της στοχαστικής διαδικασίας. Ταξινόμηση των στοχαστικών διαδικασιών.\nΤυχαίες διαδικασίες διακριτού/συνεχούς χρόνου/χώρου κατάστασης.\nΣτασιμότητα, ευρεία στασιμότητα, εργοδικότητα.\nΜέση τιμή, αυτοσυσχέτιση, ετεροσυσχέτιση.\nΦασματική πυκνότητα ισχύος.\nAπόκριση γραμμικών συστημάτων σε εργοδικές διαδικασίες.\nΔιαδικασίες AR, MA, ARMA.\nΜαρκοβιανές αλυσίδες συνεχούς και διακριτού χρόνου.\nΠίνακας μετάβασης, εξισώσεις ισορροπίας, στάσιμη κατανομή.\nΓκαουσσιανές διαδικασίες, Gauss - Markov, γεννήσεως - θανάτου.\nAνανεωτικές διαδικασίες, διαδικασία Poisson.\nΤυχαίος περίπατος, κίνηση Brown.\nΈκπληξη, αβεβαιότητα και εντροπία, αμοιβαία πληροφορία, χωρητικότητα τηλεπικοινωνιακού καναλιού.\nΣυστήματα αναμονής, νόμος του Little.\nΟυρές M/M/1, M/G/1, G/G/1, προτεραιότητες.\nAναμονητικά μοντέλα τηλεπικοινωνιακών συστημάτων, ασυμπτωτικές μέθοδοι.\nΠροσομοίωση στον υπολογιστή.\n\r\n \r\n NULL", 
        "ECTS": "6", 
        "Name": "Applied Stochastic Processes", 
        "Prerequisites": "CS-217", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Algorithms and Computation Theory", 
        "Code": "CS-387", 
        "Course email": "hy387 AT csd DOT uoc DOT grShow email", 
        "Course website": "https://elearn.uoc.gr/", 
        "Description": "The goal of the course is to introduce students to the breadth and the philosophy of the problems and algorithms of Artificial Intelligence, to study relatively in-depth fundamental and important algorithmic techniques of AI that are generally applicable. Topics covered include algorithms for uninformed search, informed search, constraint satisfaction problems, propositional logic and related algorithms for inference, first order logic and related algorithms for inference, total and partial order planning. \r\n \r\n \r\n NULL", 
        "ECTS": "6", 
        "Name": "Introduction to Artificial Intelligence", 
        "Prerequisites": "CS-240, CS-180", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Algorithms and Computation Theory", 
        "Code": "CS- 390.51", 
        "Course website": "https://elearn.uoc.gr/enrol/index.php?id=1345", 
        "Description": "Modern biology, both molecular and evolutionary, is virtually impossible without computational methods. The amount of biological data, obtained from re-sequencing projects, genomics, gene expression, or phylogenetics require specialized software for data handling and analysis. The R language is a statistical language that facilitates data handling and analysis. NULL  R is a free software for statistical computing and graphics. It compiles and runs on UNIX platform, Windows or MacOS. R is quite similar to the popular language Matlab. Both are interpreted languages that can run in a shell-like environment, and both are fast when running vectorized code. They are both very popular in engineering and statistical computing. In contrast to Matlab, R is open source, thus it develops very fast and is used widely in bioinformatics applications and publications. NULL  We expect that this new course will help students consolidating their knowledge in scientific computing, and thus will help them with courses that use Matlab as programming language. The new course will be synergistic and not overlapping with HY482: Algorithms in Bioinformatics. Prof. Tsamardinos who is teaching the HY482 focuses on the algorithms and theory; the new course focuses on the programming tools and public repositories and data-bases such as GEO, and Array Express. \r\n NULL", 
        "ECTS": "6", 
        "Name": "Introduction to Bioinformatics Programming with the Language R", 
        "Prerequisites": "CS- 150", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Algorithms and Computation Theory", 
        "Code": "CS-482", 
        "Course email": "hy482 AT csd DOT uoc DOT grShow email", 
        "Course website": "https://elearn.uoc.gr/enrol/index.php?id=688", 
        "Description": "This course will present a selection of algorithms used in bioinformatics from the list below:\r\n\nBasic elements of molecular biology and technologies (such as gene expression micro-arrays, Single Nucleotide Polymorphism arrays etc.).\nBasic statistical methods (hypothesis testing, multiple hypothesis testing and False Discovery Rate control) and methods for biomarker discovery.\nApplications to the discovery of differentially expressed genes. Basic methods of optimization in biomedical networks and graphs (metabolic networks, gene interaction networks, RNA/DNA interaction networks, gene interaction networks).\nLocal and global string matching using dynamic programming and applications to the optimization of DNA structure.\nModern methods for classification using Support Vector Machines and applications to the diagnosis and prediction of pathology from micro-array gene expression data.\nModern and basic clustering algorithms and applications to the analysis of biological data.\nBiomarker discovery using modern feature selection methods (Markov Blanket-based variable selection).", 
        "ECTS": "6", 
        "Name": "Algorithms in Bioinformatics", 
        "Prerequisites": "CS-380, CS-217, CS-119", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Algorithms and Computation Theory", 
        "Code": "CS-484", 
        "Course website": "http://www.csd.uoc.gr/~hy484", 
        "Description": "Networks are everywhere. The World Wide Web, Facebook, twitter, etc. are the most visible examples. Many more networks exist in our social life, such as networks of friends/enemies, colleagues, etc. These networks provide information, shape our political attitudes, generally, influence our opinions, and they link us to everybody else in the world. In other words, the world is smaller than we think. Even economic and financial markets look much more like networks than anonymous marketplaces. Firms interact with the same suppliers and customers and use Web-like supply chains. Systemic risk in financial markets is often created within this financial network. The spread and containment of epidemics often exhibit a marked networked structure. We will study the complex connectedness of modern society: Overview, Graphs, Strong and Weak Ties, Networks in Their Surrounding Contexts, Positive and Negative Relationships, Games: theory and applications in networks, Markets and Strategic Interaction in Networks, Information Networks and the World Wide Web: the structure of the web and link analysis, Network Dynamics: in populations and structures, etc...", 
        "ECTS": "6", 
        "Name": "Complex Network Dynamics", 
        "Prerequisites": "CS-118, CS-240", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Algorithms and Computation Theory", 
        "Code": "CS-486", 
        "Course email": "hy486 AT csd DOT uoc DOT grShow email", 
        "Course website": "http://csd.uoc.gr/~hy486/", 
        "Description": "This course focuses on the study of basic distributed algorithms for both shared memory systems and message passing systems. These two models cover a wide range of distributed systems and effectively express the intricacies of modern (and probably future) architectures. On the basis of these two models, we will build a concrete collection of algorithms, which constitute the cornerstones of most distributed applications.Specifically, the course aims at training students in theoretical and practical aspects on topics related to: fundamental design and analysis techniques of distributed algorithms for shared-memory and message-passing systems, fundamental distributed problems, synchronization and communication protocols including collective communication, concurrent and distributed data structures, timing , deadlock, termination, fault-tolerance.Students that complete the course successfully will have gained the basic background needed to work in any field touching upon distributed systems and applications.", 
        "ECTS": "6", 
        "Name": "Principles of Distributed Computing", 
        "Prerequisites": "CS-240", 
        "Program": "Undergraduate", 
        "Suggested": "CS-225, CS-119"
    }, 
    {
        "Area": "Society and Informatics", 
        "Code": "CS-302", 
        "Course email": "hy302 AT csd DOT uoc DOT grShow email", 
        "Description": "New technologies in education. Main approaches for introducing new technologies into the educational process (isolated technical, pragmatological, integrated model) and their implications for the educational process. Stages in the introduction technology in various countries and the Greek experience: historic overview, evaluation of current practice.", 
        "ECTS": "6", 
        "Name": "Teaching of Computer Science", 
        "Prerequisites": "CS-100, CS-120, CS-150", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Society and Informatics", 
        "Code": "CS-403", 
        "Course website": "https://elearn.uoc.gr/course/info.php?id=805", 
        "Description": "Στόχοι του μαθήματος: \r\nΤο μάθημα αποσκοπεί κατ αρχήν στο να εισάγει στους φοιτητές το υπόβαθρο για την αξιοποίηση τεχνολογικών καινοτομιών προστιθέμενης αξίας με στόχο τη σύσταση και ανάπτυξη νεοφυών επιχειρήσεων. \r\nΣτη συνέχεια, η νεοφυής επιχείρηση εντάσσεται σε ένα οικονομικό περιβάλλον έναντι του οποίου απαιτείται να σχεδιαστεί και να ακολουθηθεί αναπτυξιακή επιχειρηματική στρατηγική. \r\nΤέλος, στο πλαίσιο θα αναδειχθούν τρόποι προκειμένου NULL  η επιχειρηματική στρατηγική να βρίσκεται σε συνεχή ανατροφοδότηση με τη δομή, την οργάνωση και τη διοίκηση της επιχείρησης. \r\n NULL  \r\nΔομή – Θεματικά Πεδία του μαθήματος: \nΘεματικό Πεδίο 1: Τεχνολογία - Καινοτομία – Νεοφυής Επιχειρηματικότητα \r\nΣτο σύγχρονο οικονομικό περιβάλλον, η καινοτομία έχει πολλαπλασιαστική δυναμική για την αξία που παράγουν επιχειρήσεις, οργανισμοί και εθνικές οικονομίες. Ταυτόχρονα, η επιχειρηματική διαδικασία αποτελεί στρατηγική δημιουργίας προστιθέμενης αξίας, αύξησης της απασχόλησης, εξωστρεφούς ανταγωνιστικότητας και βιώσιμης ανάπτυξης. \r\nΣτο πλαίσιο του πρώτου θεματικού πεδίου, στόχος είναι να αναδειχθεί στους φοιτητές:\r\n\nH ανάγκη και οι δυνατότητες της καινοτομίας στην επιχειρηματική διαδικασία.\nΤα εφόδια για την σχεδίαση καινοτόμων υπηρεσιών και προϊόντων Τεχνολογιών Πληροφορικής και Επικοινωνιών.\nΤην απόκτηση γνώσεων και δεξιοτήτων σχετικά με τον κύκλο της επιχειρηματικής διαδικασίας: Σύλληψη επιχειρηματικής ιδέας, αξιολόγηση επιχειρηματικής ευκαιρίας, ανάπτυξη επιχειρηματικού μοντέλου, δημιουργία επιχειρηματικού σχεδίου.\n\nΘεματικό Πεδίο 2: Επιχειρηματική Στρατηγική \r\nΕπιχειρηματική στρατηγική είναι το σύνολο των στόχων και των πολιτικών που θέτει μια επιχείρηση προκειμένου να επιτύχει βιώσιμο ανταγωνιστικό πλεονέκτημα και αύξηση της αποδοτικότητάς της. Οι επιχειρήσεις αναζητούν συνεχώς τη στρατηγική επανατοποθέτησή τους, με βάση τις μοναδικές ικανότητές τους. \r\nΤο δεύτερο θεματικό πεδίο αποσκοπεί στο να εισάγει στους φοιτητές τις μεθόδους, τα εργαλεία και τους τρόπους ανάπτυξης της επιχειρηματικής στρατηγικής σε ένα δυναμικό περιβάλλον. Aποσκοπεί επίσης στην καλλιέργεια της αντίληψης για τη διάγνωση όσων απαιτούνται για την εφαρμογή μιας νέας στρατηγικής. \r\nΘεματικό Πεδίο 3: Διοίκηση Επιχειρήσεων \r\nΤο τρίτο θεματικό πεδίο αποσκοπεί στο να εισάγει στους φοιτητές την κατανόηση βασικών εννοιών της δομής, οργάνωσης και λειτουργίας επιχειρήσεων, στο πλαίσιο του περιβάλλοντος λειτουργίας τους. \r\n NULL  \r\nΚάθε Θεματικό Πεδίο δομείται σε επιμέρους Ενότητες:\nΘεματικό Πεδίο 1: Ενότητες 1 - 5\n\nΕισαγωγή\nH επιχειρηματική αξιοποίηση και διαχείριση της τεχνολογίας\nH τεχνολογική καινοτομία για την παραγωγή επιχειρηματικής αξίας\nΕπιχειρηματικότητα\nΝεοφυείς επιχειρήσεις και επιχειρηματίες\n\nΘεματικό Πεδίο 2: Ενότητες 6 - 8\n\nΤο εσωτερικό και το εξωτερικό επιχειρηματικό περιβάλλον\nΣχεδιασμός και στρατηγική διοίκηση\nΛήψη διοικητικών αποφάσεων\n\nΘεματικό Πεδίο 3: Ενότητες 9 - 13\n\nΔιοικητικές δομές\nΔιοικητικός έλεγχος\nΕπιχειρηματικός μετασχηματισμός και διοίκηση της αλλαγής\nΔιοίκηση και διαχείριση σε νεοφυείς επιχειρήσεις\nAνάπτυξη νεοφυών επιχειρήσεων\n\r\n NULL  \r\nΜέθοδος διδασκαλίας: Ενότητες – Διαλέξεις – Εκπαιδευτικό Υλικό – Εκπαιδευτική Τεχνολογία – Εκπαιδευτική Καινοτομία\n\nΚάθε ενότητα καλύπτεται από δύο δύωρες διαλέξεις. Οι διαλέξεις πραγματοποιούνται σε διαφορετικές ημέρες και ώρες εντός της ίδιας εβδομάδας. Σε κάθε διάλεξη θα παρουσιάζεται το θεωρητικό υπόβαθρο και οι πρακτικές διαστάσεις της ενότητας.\nΕκπαιδευτικό Υλικό: Κάθε διάλεξη συμπληρώνεται με την αντίστοιχη παρουσίαση PowerPoint (διαθέσιμο στο http://elearn.uoc.gr), μελέτες επιχειρηματικών περιπτώσεων (business case studies), αποσπάσματα από το διεθνή τύπο και πληροφοριακά κείμενα.\nΕκπαιδευτική Τεχνολογία: Το μάθημα θα διδάσκεται στην Πανεπιστημιούπολη Βουτών, σε αίθουσα του Πανεπιστημίου Κρήτης η οποία διαθέτει τεχνολογία τηλεεκπαίδευσης. Το μάθημα θα μεταδίδεται ζωντανά NULL  στην Πανεπιστημιούπολη Γάλλου, σε αίθουσα του Πανεπιστημίου Κρήτης η οποία διαθέτει τεχνολογία τηλεεκπαίδευσης.\nΕκπαιδευτικές Καινοτομίες:\n\nΤο μάθημα θα έχει ακροατήριο από το Τμήμα Επιστήμης Υπολογιστών και από το Τμήμα Πολιτικής Επιστήμης.\nΕίναι η πρώτη φορά που θα διδαχθεί στο Πανεπιστήμιο Κρήτης εξαμηνιαίο μάθημα με τη χρήση τηλεεκπαίδευσης μεταξύ Πανεπιστημιούπολης Βουτών και Πανεπιστημιούπολης Γάλλου.\n\n\n\r\n NULL  \r\nΒασικό εγχειρίδιο:  \r\nBateman, T.S., Snell S.A.: Διοίκηση Επιχειρήσεων. Μετάφραση: Γκάσης, Π. Εκδόσεις Τζιόλας, 2016. Κωδικός στον Εύδοξο: 50656013. \r\n NULL  \r\nΣυμπληρωματική βιβλιογραφία:\n\nStorey, D., Greene, F., Χασσίδ. I., Φαφαλιού, E.: Επιχειρηματικότητα για NULL μικρές NULL και NULL μεσαίες NULL επιχειρήσεις. Μετάφραση: Σιδέρης, Γ. Εκδόσεις Κριτική, 2011. Κωδικός στον Εύδοξο: 12508181.\nWhite, M.A., Bruton, G.D.: H στρατηγική διαχείριση της τεχνολογίας και της καινοτομίας. Μετάφραση: Γιαμαλίδου, M. Επιμέλεια: Πρωτόγερου, A., Κωνσταντέλου, A., Καλογήρου, Γ. Εκδόσεις Κριτική, 2010. Κωδικός στον Εύδοξο: 11600.\nSchmidt, E., Rosenberg, J., Eagle, A.: How Google Works - The rules for success in the Internet Century. Grand Contral Publishing, New York, 2014.\n\r\n NULL  \r\nΠαρακολούθηση, Εξέταση, Βαθμολόγηση: \r\nΟ τελικός βαθμός θα προκύψει ως εξής:\r\n\n60% από την εξεταστική του Ιανουαρίου.\n30% από τις εβδομαδιαίες εργασίες: Οι εργασίες θα είναι case studies και multiple choice τις οποίες οι φοιτητές θα υποβάλουν στο http://elearn.uoc.gr.\n10% από τη συμμετοχή στις διαλέξεις.", 
        "ECTS": "6", 
        "Name": "Strategic Management of Start-up Companies", 
        "Prerequisites": "--", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Society and Informatics", 
        "Code": "CS-408", 
        "Course website": "https://elearn.uoc.gr/course/info.php?id=993", 
        "Description": "The objectives of the course \r\n \r\nThe course is based on the fact that in the modern economic environment, innovation has multiplying dynamic effects for the creation of value by companies, organizations and national economies. At the same time, the business process is a strategy for creating added value, increasing employment, extrovert competitiveness and sustainable development. \r\nThe course aims to introduce students to the foundation of value-added technological innovations aimed at setting up and developing new enterprises. \r\n NULL  \r\nThe thematic areas and units of the course:\nThematic area 1: Innovation in the entrepreneurial process \r\n1/ Innovation \r\n2/ Business creativity \r\n3/ Sources for innovation \r\n4/ Search strategies for innovation \r\nThematic area 2: Value creation \r\n5/ Business models towards value \r\n6/ Building the business case \r\n7/ Developing new products and services \r\n8/ Implementing new business ventures \r\nThematic area 4: Business development \r\n9/ Enterprise and talent development through entrepreneurship \r\n10/ Business development \r\n11/ Leadership and groups \r\n12/ Knowledge management and intellectual property \r\n13/ Learning to manage innovation towards new business ventures \r\n \r\n NULL", 
        "ECTS": "6", 
        "Files": "HY-408_Syllabus_gr.pdfHY-408_Syllabus.pdf", 
        "Name": "Technological Innovation and Entrepreneurship", 
        "Prerequisites": "-", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Society and Informatics", 
        "Code": "CS-409", 
        "Course website": "https://elearn.uoc.gr/course/info.php?id=1190", 
        "Description": "Course description \r\nThe core of the course based on the following issues: \r\nHow can a business exploit and build resources and capabilities needed to achieve, maintain and improve its market positioning. \r\nHow can a business strategically plan its route and development (mission, vision, goals). \r\nHow can a business strategically innovate so as to “change the rules of the game” in the relevant market. \r\nOverall, the business strategy will be approached as a dynamic process because a firm is called upon to continuously strive to achieve sustainable competitive advantages. \r\n \r\nLearning goals \r\nThe course aims to provide students with the analytical tools related to business strategies issues. The course examines a set of concepts, methods and tools beginning for the formulation of strategy, its execution and evaluation. Along with the analysis of concepts and methods, students will be supported to build skills for the implementation of relevant tools through case studies. \r\n \r\nTentative Syllabus \r\nThe course is structured along five fields and each field contains specific modules. Each module corresponds to a three-hour weekly lecture: \r\nField 1: Starting Thinking Strategically \r\nModule 1: Introduction to Strategy \r\nModule 2: Strategic Analysis of the External Environment \r\nModule 3: Strategic Analysis of the Internal Environment \r\nModule 4: Corporate Mission / Vision \r\nModule 5: What is Strategy: Basic Views \r\nField 2: Types of Strategy \r\nModule 6: Developmental Strategy \r\nModule 7: Competitive Strategy \r\nModule 8: Internationalization Strategy \r\nField 3: Taking Strategic Decisions \r\nModule 9: Taking Strategic Decisions \r\nField 4: Vehicles for Implementing a Strategy \r\nModule 10: Redemptions and Mergers \r\nModule 11: Strategic Alliances \r\nField 5: Selection, Implementation and Evaluation of a Strategy \r\nModule 12: Selection of a Strategy \r\nModule 13: Implementation and Evaluation of a Strategy \r\n NULL", 
        "ECTS": "6", 
        "Name": "Business Strategy", 
        "Prerequisites": "---", 
        "Program": "Undergraduate", 
        "Suggested": "CS-403, CS-408"
    }, 
    {
        "Area": "Society and Informatics", 
        "Code": "CS-409.1", 
        "Course website": "http://elearn.uoc.gr", 
        "Description": "Course description \r\nThe new venture is a vital component of the free enterprise system, providing much needed innovation, competition and employment. It is furthermore particularly relevant to the Greek business environment, where the small business sector is especially large. This course provides an important contextual basis for all business majors. Entrepreneurship is a career option chosen by many of our students, and the course provides techniques, models and skills which are essential to the successful creation of a new business. By taking a holistic view of the new venture creation process, the course also offers students the opportunity to synthesise knowledge and skills drawn from a wide range of functional business areas. \r\n \r\nTentative Syllabus \r\nThe course is structured along twelve three-hour weekly lectures:\r\n\nThe Entrepreneurial Mind: Crafting a Personal Entrepreneurial Strategy\nΤhe Entrepreneurial Process\nSustainable Enterprise Movements Are an Opportunity for Change\nOpportunity Recognition\nOpportunity Investigation\nThe Business Plan\nThe Entrepreneurial Leader and the Team\nResource Requirements\nFranchising\nEntrepreneurial Finance\nObtaining Venture and Growth Capital\nThe Deal: Valuation, Structure, and Negotiation\n\nSuggested Reading \r\nSpinelli Stephen, Jr., Adams Robert: New Venture Creation: Entrepreneurship for the 21st Century. 10th Edition, McGraw-Hill, 2016. \r\n NULL", 
        "ECTS": "6", 
        "Name": "New Venture Creation", 
        "Prerequisites": "--", 
        "Program": "Undergraduate", 
        "Suggested": "CS-403, CS-408, CS-409"
    }, 
    {
        "Area": "Free Elective Courses", 
        "Code": "CS-303", 
        "Description": "H Ειδική Διδακτική Πρακτική Άσκηση σε σχολείο Δευτεροβάθμιας Εκπαίδευσης (Γυμνάσιο ή Λύκειο) ουσιαστικά αποτελείται από τρεις κύριες δραστηριότητες των φοιτητών:\r\n\nΤην παρακολούθηση και μαθητεία στο διοικητικό έργο του σχολείου και στις εξωδιδακτικές δραστηριότητες (γιορτές, εκδηλώσεις),\nΤην παρακολούθηση διδασκαλιών και\nΤον σχεδιασμό και υλοποίηση διδασκαλιών από το φοιτητή υπό την καθοδήγηση επόπτη.\n\r\nΟι ώρες που θα πρέπει να βρίσκεται ένας/μία φοιτητής/φοιτήτρια στο σχολείο κατά τη διάρκεια του εξαμήνου θα είναι κατ’ ελάχιστον 26 ώρες το εξάμηνο. \r\nH Ειδική Διδακτική του γνωστικού αντικειμένου μπορεί να επιλέγεται από τον/την φοιτητή/φοιτήτρια από μια ποικιλία Ειδικών Διδακτικών γνωστικών αντικειμένων που προσφέρονται σε επίπεδο Σχολής. Aφορά τρόπους και μεθόδους διδασκαλίας του αντικειμένου στο σχολείο, ανάπτυξη στοχοθεσίας, επιλογή μεθόδων και τεχνικών αξιολόγησης μαθητών κτλ. \r\nΓια τη λειτουργικότερη διάρθρωση και παρακολούθηση του Προγράμματος ορίζονται ως προαπαιτούμενα μαθήματα για την Ειδική Διδακτική Πρακτική Άσκηση:\r\n\nH Ειδική Διδακτική του γνωστικού αντικειμένου «HΥ-302 Διδακτικής της Πληροφορικής»\nΈνα μάθημα από την ενότητα Παιδαγωγική Θεωρία\nΈνα μάθημα από την ενότητα Διδακτική Μεθοδολογία", 
        "ECTS": "6", 
        "Name": "Special Teaching Practice", 
        "Prerequisites": "CS-302", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Free Elective Courses", 
        "Code": "CS-499C", 
        "Description": "Undergraduate students in the Computer Science Department may spend one work-term, between 3 and 6 months, full-time or almost full-time, in a Greek or foreign company or organization, either public or private, for the purpose of acquiring work experience in areas related to computer science and its applications. The work is carried out under the supervision of a Department faculty member or visiting professor and a member of the cooperating organization. This working period counts toward the student's graduation requirements as an elective course.", 
        "ECTS": "6", 
        "Name": "Work Experience I  (3 months)", 
        "Prerequisites": "As described in the lesson summary", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Free Elective Courses", 
        "Code": "CS-499Z", 
        "Description": "H Πρακτική Άσκηση (ΠA) αποτελεί μια αποτελεσματική μέθοδο για επαφή και εξοικείωση των φοιτητών/τριών με τα αντικείμενα της πιθανής μελλοντικής τους απασχόλησης και η πληρέστερη γνώση και κατανόηση των προβλημάτων και των ιδιαιτεροτήτων του επαγγελματικού τους πεδίου για την επίτευξη της καλύτερης ένταξης τους στο χώρο εργασίας αμέσως μετά το τέλος των σπουδών τους. Στα πλαίσια του Προγράμματος ΠA, φοιτητές/ήτριες του Προγράμματος βασικών σπουδών του Τμήματος μπορούν να εργάζονται για καθορισμένο αριθμό μηνών, ισοδύναμου πλήρους απασχόλησης, σε ελληνικούς και διεθνείς οργανισμούς και εταιρείες του δημόσιου και του ιδιωτικού τομέα σε θέματα σχετικά με την επιστήμη υπολογιστών και την πρακτική της εφαρμογή. \r\n \r\nΣτα πλαίσια του Προγράμματος ΠA, φοιτητές και φοιτήτριες του Προγράμματος βασικών σπουδών του Τμήματος μπορούν να εργάζονται για καθορισμένο αριθμό μηνών, ισοδύναμου πλήρους απασχόλησης, σε ελληνικούς και διεθνείς οργανισμούς και εταιρείες του δημόσιου και του ιδιωτικού τομέα σε θέματα σχετικά με την επιστήμη υπολογιστών και την πρακτική της εφαρμογή. Aνάλογα με τις πηγές χρηματοδότησης, η διάρκεια της πρακτικής άσκησης μπορεί να είναι από 3 μέχρι και 6 μήνες. Για τις αυτοχρηματοδοτούμενες, μέσω ΕΣΠA, πρακτικές ασκήσεις, το διάστημα είναι 3 μήνες. H πρακτική άσκηση μπορεί να πραγματοποιείται καθ’ όλη τη διάρκεια του έτους. \r\nAνάλογα με τις πηγές χρηματοδότησης της πρακτικής άσκησης, η διάρκειά της μπορεί να είναι είτε 3 μήνες είτε 6 μήνες. H ΠA 3 μηνών πραγματοποιείται σε τρεις συνεχόμενους ημερολογιακούς μήνες. H ΠA 6 μηνών πραγματοποιείται ως δύο τρίμηνες NULL  πρακτικές ασκήσεις, είτε συνεχόμενες, είτε όχι. Aπό το πρόγραμμα ΕΣΠA μπορεί να χρηματοδοτηθεί το πολύ μια τρίμηνη ΠA για κάθε φοιτητή. H πρακτική άσκηση μπορεί να ξεκινήσει οποιαδήποτε στιγμή μέσα στο ακαδημαϊκό έτος. \r\n \r\nH πρακτική άσκηση δηλώνεται ως μάθημα ελεύθερης επιλογής («ελεύθερες μονάδες»). Υπάρχουν δύο μαθήματα στο Πρόγραμμα σπουδών του Τμήματος που αφορούν την ΠA, το μάθημα «Πρακτική Άσκηση Ι» με κωδικό 499Γ που αντιστοιχεί σε μια τρίμηνη πρακτική άσκηση και το μάθημα «Πρακτική Άσκηση ΙΙ» με κωδικό 499Ζ που αντιστοιχεί στο δεύτερο τρίμηνο μιας εξάμηνης ΠA. Κάθε ένα από τα μαθήματα 499Γ και 499Ζ έχει 6 πιστωτικές μονάδες (ECTS). Οι πιστωτικές αυτές μονάδες μπορούν να προσμετρηθούν στις υποχρεώσεις λήψης πτυχίου ως μονάδες της κατηγορίας μαθημάτων ελεύθερης επιλογής. Κάθε ένα από τα μαθήματα 499Γ και 499Ζ μπορεί είτε να ολοκληρωθεί επιτυχώς ή να πραγματοποιηθεί ανεπιτυχώς. Επομένως, δεν υπάρχει βαθμός για τα μαθήματα αυτά που να μετράει στον υπολογισμό του βαθμού πτυχίου. Σε κάθε περίπτωση, η επιτυχής ολοκλήρωση του 499Γ και του 499Ζ αναγράφεται στο παράρτημα διπλώματος. Τα μαθήματα  NULL 499Γ και 499Ζ έχουν προαπαιτούμενα (ελάχιστα κριτήρια συμμετοχής) και κριτήρια επιλογής όπως περιγράφονται στη συνέχεια. Το μάθημα 499Ζ μπορεί να δηλωθεί είτε σε εξάμηνο που έπεται της επιτυχούς ολοκλήρωσης του 499Γ ή στο ίδιο εξάμηνο με το 499Γ. Στη δεύτερη περίπτωση, η επιτυχής ολοκλήρωση του 499Ζ προϋποθέτει την επιτυχή ολοκλήρωση του 499Γ. H ΠA δεν μπορεί να αποτελεί μέρος της πτυχιακής εργασίας του/της εκάστοτε φοιτητή/τριας. \r\n \r\nΚριτήρια Ελαχίστων Aπαιτήσεων για Συμμετοχή NULL  \r\nΓια όλες τις θέσεις Πρακτικής Άσκησης του Τμήματος, αίτηση μπορούν να υποβάλουν όλοι/ες οι εγγεγραμμένοι/ες προπτυχιακοί φοιτητές/τριες του Προγράμματος Προπτυχιακών Σπουδών (ΠΠΣ) που πληρούν τις παρακάτω ελάχιστες απαιτήσεις:\r\n\nΕπιτυχής συμπλήρωση εκατό δέκα έξι (116) ECTS μαθημάτων κορμού και εκατό είκοσι (120) ECTS συνολικά.\nΣε περίπτωση πρακτικής άσκησης σε φορέα στο εξωτερικό, οι φοιτητές/τριες θα πρέπει επιπρόσθετα να έχουν αποδεδειγμένη βασική γνώση της γλώσσας στην οποία θα γίνει η επίβλεψη/εποπτεία και η υλοποίηση της πρακτικής άσκησης.", 
        "ECTS": "6", 
        "Name": "Work Experience II (3 months)", 
        "Prerequisites": "As described in the lesson summary", 
        "Program": "Undergraduate"
    }, 
    {
        "Area": "Free Elective Courses", 
        "Code": "V", 
        "ECTS": "Οπως καθορίζονται από το αντίστοιχο Τμήμα", 
        "Name": "All other courses of the University of Crete", 
        "Prerequisites": "As the corresponding Department", 
        "Program": "Undergraduate"
    }
]