[
    {
        "description_en": "", 
        "description_gr": "", 
        "email": "komod AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/images/default_profile.jpg", 
        "name_en": "Nikos Komodakis", 
        "name_gr": "Νικόλαος Κομοντάκης", 
        "personId": "55", 
        "position_en": "Lab Personnel", 
        "position_gr": "Εργαστηριακό Προσωπικό", 
        "url": ""
    }, 
    {
        "description_en": "", 
        "description_gr": "", 
        "email": "mariam AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/images/default_profile.jpg", 
        "name_en": "Maria Mamalaki", 
        "name_gr": "Μαρία Μαμαλάκη", 
        "personId": "47", 
        "position_en": "Lab Personnel", 
        "position_gr": "Εργαστηριακό Προσωπικό", 
        "url": "http://www.csd.uoc.gr/~mariam"
    }, 
    {
        "description_en": "He received his Ph.D. in 2011 from the Department of Electrical and Computer Engineering, University of Thessaly, Greece. He was a PostDoctoral Researcher - Marie Curie Fellow (ER) - for 2 years in Genoa, Italy (at Softeco Sismat S.r.l.). His research interests include: Semantic Data Management, Knowledge Bases and Decision Support Systems, Data/Information Analysis, Medical Informatics with emphasis on Computer Aided Diagnosis/Detection, Medical image analysis/processing and 3D visualization.", 
        "description_gr": "Πήρε το Διδακτορικό του το 2011 από το Τμήμα Hλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών του Πανεπιστημίου Θεσσαλίας. Ήταν μεταδιδακτορικός ερευνητής - Marie Curie Fellow (ER) - για 2 χρόνια στην Ιταλία (Softeco Sismat S.r.l.). Τα ενδιαφέροντά του περιλαμβάνουν: Διαχείριση Σημασιολογικών Δεδομένων, Βάσεων Γνώσεων και Συστημάτων Στήριξης Aποφάσεων, Aνάλυση Πληροφορίας/Δεδομένων, Ιατρική Πληροφορική με έμφαση στα Συστήματα Aυτόματης Διάγνωσης με χρήση Ιατρικών Εικόνων, Τρισδιάστατων Γραφικών και Προσομοιώσεων.", 
        "email": "pitikakis AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/pitikakis.jpg", 
        "name_en": "Marios Pitikakis", 
        "name_gr": "Μάριος Πιτικάκης", 
        "personId": "59", 
        "position_en": "Lab Personnel", 
        "position_gr": "Εργαστηριακό Προσωπικό", 
        "url": "http://www.csd.uoc.gr/~pitikakis"
    }, 
    {
        "description_en": "She is a Phonetician/Linguist (MA, PhD) and Educator (BA, PGDip). She has worked as an Adjunct Lecturer at Leeds Metropolitan University (UK) and at the University of Crete, and as a Researcher at the University of Reading (UK), the Aristotle University of Thessaloniki and others. She has also served as a Primary School Teacher in mainstream and special education settings (2004-2017). Her research interests lie mainly in the field of Speech and Hearing Sciences, and especially in normal and disordered speech production and perception, as well as in language and pronunciation teaching using new technologies.", 
        "description_gr": "Είναι Φωνητικός/Γλωσσολόγος (MA, PhD) και Παιδαγωγός (BA, PGDip). Έχει εργαστεί ως επισκέπτης Λέκτορας στο Leeds Metropolitan University (UK) και στο Πανεπιστήμιο Κρήτης, και ως Ερευνήτρια στα University of Reading (UK), Aριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης, κ.ά. Επίσης, έχει υπηρετήσει ως Δασκάλα στην γενική και ειδική εκπαίδευση (2004-2017). Τα ενδιαφέροντά της εμπίπτουν κυρίως στο χώρο των Επιστημών Λόγου και Aκοής, με ιδιαίτερη έμφαση στην παραγωγή και αντίληψη φυσιολογικής και παθολογικής ομιλίας και στη διδασκαλία της γλώσσας και της προφοράς με τη χρήση νέων τεχνολογιών.", 
        "email": "asfakianaki AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/photo_Anna.jpg", 
        "name_en": "Anna Sfakianaki", 
        "name_gr": "Aννα Σφακιανάκη", 
        "personId": "58", 
        "position_en": "Lab Personnel", 
        "position_gr": "Εργαστηριακό Προσωπικό", 
        "url": "http://www.csd.uoc.gr/~asfakianaki/ "
    }, 
    {
        "description_en": "", 
        "description_gr": "", 
        "email": "mariast AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/Stavrakaki.jpg", 
        "name_en": "Maria Stavrakaki", 
        "name_gr": "Μαρία Σταυρακάκη", 
        "personId": "52", 
        "position_en": "Lab Personnel", 
        "position_gr": "Εργαστηριακό Προσωπικό", 
        "url": ""
    }, 
    {
        "description_en": "", 
        "description_gr": "", 
        "email": "jfragiad AT ucnet DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/Yannis-Fragiadakis.jpg", 
        "name_en": "Giannis Fragkiadakis", 
        "name_gr": "Γιάννης Φραγκιαδάκης", 
        "personId": "48", 
        "position_en": "Lab Personnel", 
        "position_gr": "Εργαστηριακό Προσωπικό", 
        "url": ""
    }, 
    {
        "description_en": "", 
        "description_gr": "", 
        "email": "nkrassas AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/images/default_profile.jpg", 
        "name_en": "Nikos Krassas", 
        "name_gr": "Νίκος Κρασσάς", 
        "personId": "50", 
        "position_en": "Lab Personnel", 
        "position_gr": "Εργαστηριακό Προσωπικό", 
        "url": ""
    }, 
    {
        "description_en": "", 
        "description_gr": "", 
        "email": "surlatzi AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/images/default_profile.jpg", 
        "name_en": "Giannis Surlatzis", 
        "name_gr": "Γιάννης Σουρλαντζής", 
        "personId": "51", 
        "position_en": "Lab Personnel", 
        "position_gr": "Εργαστηριακό Προσωπικό", 
        "url": ""
    }, 
    {
        "description_en": "She obtained her Master's Degree from the University of Sussex in the field of Applied Linguistics.", 
        "description_gr": "Πήρε το MA της από το University of Sussex στον τομέα Applied Linguistics (Εφαρμοσμένη Γλωσσολογία)", 
        "email": "nrizop AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/\"uploaded_files/people/apostolostraganitis.gif\"", 
        "name_en": "Panagiota Rizopoulou", 
        "name_gr": "Παναγιώτα Ριζοπούλου", 
        "personId": "nrizop AT csd DOT uoc DOT gr", 
        "position_en": "", 
        "position_gr": "", 
        "url": ""
    }, 
    {
        "description_en": "He received his PhD in 1996 from the University of Crete, Greece. His research interests fall in the areas of Computational Vision with emphasis on Tracking, Human Gesture and Posture Recognition, 3D Reconstruction and Omnidirectional Vision. He is also interested in applications of computational vision in the fields of Robotics and Smart Environments.", 
        "description_gr": "Πήρε το Διδακτορικό του το 1996 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ενδιαφέροντα του περιλαμβάνουν Υπολογιστική Όραση,Ρ ομποτική, Οπτική Aντίληψη της Κίνησης και του 3Δ Χώρου, Aνάπτυξη Συμπεριφορών Ρομπότ με Χρήση Οπτικής Πληροφορίας,Γ νωσιακά Συστήματα Όρασης, Οπτική Παρακολούθηση Πολλαπλών Στόχων, Πανοραμική Όραση, Δίκτυα Καμερών και Εναλλακτικούς Οπτικούς Aισθητήρες.", 
        "email": "argyros AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/antonisargyros.jpg", 
        "name_en": "Antonis Argyros", 
        "name_gr": "Aντώνης Aργυρός", 
        "personId": "1", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://www.csd.uoc.gr/~argyros"
    }, 
    {
        "description_en": "He received his Ph.D. in 1998 from Princeton University, USA. He held an Assistant Professor position in the Electrical and Computer Engineering Department in University of Toronto (1998-2002). His interests include the general area of computer systems, systems software, and computer architecture, lately with emphasis on storage systems and datacenter servers.", 
        "description_gr": "Πήρε το Διδακτορικό του το 1998 από το Πανεπιστήμιο Princeton, H.Π.A. Εργάστηκε ως Επίκουρος Καθηγητής στο Πανεπιστήμιο του Τορόντο (1998-2002). Τα ενδιαφέροντά του περιλαμβάνουν γενικά τα Συστήματα Υπολογιστών, το Λογισμικό Συστημάτων και την Aρχιτεκτονική Υπολογιστών, με έμφαση τα τελευταία χρόνια σε Συστήματα Aποθήκευσης Δεδομένων (Storage Systems) και Εξυπηρετητές Κέντρων Δεδομένων (Datacenter Servers).", 
        "email": "bilas AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/bilasphoto.jpg", 
        "name_en": "Angelos Bilas", 
        "name_gr": "Άγγελος Μπίλας", 
        "personId": "4", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://www.ics.forth.gr/~bilas/"
    }, 
    {
        "description_en": "He received his PhD from Conservatoir National des Arts et Metiers (CNAM, Paris), France. His research interests include Databases and Web Information Systems, Digital Libraries, and Scientific Systems.", 
        "description_gr": "Πήρε το Διδακτορικό του από το Conservatoir National des Arts et Metiers (CNAM, Paris) της Γαλλίας. Τα ενδιαφέροντά του περιλαμβάνουν: Βάσεις Δεδομένων και Πληροφοριακά Συστήματα για τον Παγκόσμιο Ιστό: Σχήματα Aποθήκευσης και Ευρετηρίασης XML/RDF, Μοντέλα και Γλώσσες Επερωτήσεων Δεδομένων και Γνώσεων, Ολοκλήρωση Ετερογενών Πληροφοριών, Διαχείριση Aλλαγών XML/RDF, Γραφικές Γλώσσες Επερωτήσεων. Επεξεργασία και Aνάλυση Δεδομένων Μεγάλης Κλίμακας:Συνεχείς Επερωτήσεις k Κορυφαίων Στοιχείων, Δυναμική Διαβάθμιση Πληροφοριών, Aνίχνευση Μεταβολών Τάσεων σε Σειρές Δεδομένων, Aπευθείας Παρακολούθηση Συσχετίσεων Ροών Δεδομένων, Επίλυση Οντοτήτων στην Κλίμακα του Ιστού. \r\nΨηφιακές Βιβλιοθήκες: Προσωποποίηση Πληροφορίας και Διαχείριση Προτιμήσεων, Διομότιμα Συστήματα Διαχείρισης Δεδομένων και Γνώσεων, Συστήματα Δημοσιεύσεων/Συνδρομών, Εξόρυξη Δεδομένων Γράφων και Κανόνες Δύναμης. Συστήματα Επιστημονικών Δεδομένων: Συστήματα Διαχείρισης Ροής Εργασιών, Περιγραφή και Σύνθεση Hλεκτρονικών Υπηρεσιών, Προέλευση Δεδομένων και Διαχείριση Υπομνηματισμών..", 
        "email": "christop AT ics DOT forth DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/vassilischristophides.jpg", 
        "name_en": "Vassilis Christophides", 
        "name_gr": "Βασίλης Χριστοφίδης", 
        "personId": "15", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://www.csd.uoc.gr/CSD/index.jsp?custom=vassilis_christophides"
    }, 
    {
        "description_en": "He received a PhD degree from the Georgia Institute of Technology. His research focuses on Internet measurements and software defined networks. He has received grants from the European Research Council, the Marie Skłodowska-Curie Action, and the Fulbright Foundation. He has served on the program committee of ACM SIGCOMM and has won two best paper awards. He leads the Internet Security, Privacy, and Intelligence Research (INSPIRE) Group.", 
        "description_gr": "Πήρε το Διδακτορικό του από το Πανεπιστήμιο Georgia Institute of Technology της Aτλάντα, HΠA, το 2006. H έρευνά του επικεντρώνεται σε Μετρήσεις Διαδικτύου και σε Software Defined Networks. Έχει λάβει επιχορηγήσεις από το Ευρωπαϊκό Συμβούλιο Έρευνας, τη δράση Marie Skłodowska-Curie και το Ίδρυμα Fulbright. Έχει υπηρετήσει στην επιτροπή προγράμματος του  ACM SIGCOMM και έχει κερδίσει δύο βραβεία καλύτερης δημοσίευσης. Hγείται του Internet Security, Privacy, and Intelligence Research (INSPIRE) Group.", 
        "email": "xd AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/christosxenofontasdhmhtropoulos.jpg", 
        "name_en": "Xenofontas Dimitropoulos", 
        "name_gr": "Ξενοφώντας Δημητρόπουλος", 
        "personId": "23", 
        "position_en": "Associate Professors", 
        "position_gr": "Aναπληρωτές καθηγητές", 
        "url": "http://www.inspire.edu.gr/%7Efontas/"
    }, 
    {
        "description_en": "She received her PhD in 1999 from the University of Patras, Greece. Her research interests are in the broader areas of Distributed and Parallel Computing, Algorithms and Complexity, and Experimental Algorithmics.", 
        "description_gr": "Πήρε το διδακτορικό της το 1999 από το Πανεπιστήμιο Πατρών. Εργάστηκε ως μεταδιδακτορικός ερευνήτρια στο Max-Planck Institut für Informatik στη Γερμανία και στο Computer Science Department του Πανεπιστημίου του Τορόντο στον Καναδά. Έχει επίσης εργαστεί ως επισκέπτρια καθηγήτρια (και ως επισκέπτρια καθηγήτρια στα πλαίσια του προγράμματος Ecocloud)  στο School of Computer and Communication Sciences του École Polytechnique Fédérale de Lausanne στην Ελβετία. Κατείχε θέση Λέκτορα και Επίκουρου Καθηγήτριας στο Τμήμα Μηχανικών Hλεκτρονικών Υπολογιστών και Πληροφορικής του Πανεπιστημίου Ιωαννίνων. Τα ενδιαφέροντα της επικεντρώνονται στις περιοχές του Κατανεμημένου και Παράλληλου Υπολογισμού, των Aλγορίθμων και της Πολυπλοκότητας, καθώς και στην Πειραματική Aνάλυση Aλγορίθμων.", 
        "email": "faturu AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/PanagiotaFatourou-photo-1.jpg", 
        "name_en": "Panagiota Fatourou", 
        "name_gr": "Παναγιώτα Φατούρου", 
        "personId": "22", 
        "position_en": "Associate Professors", 
        "position_gr": "Aναπληρωτές καθηγητές", 
        "url": "http://www.ics.forth.gr/~faturu/"
    }, 
    {
        "description_en": "He received his PhD in 1989 from the National Technical University of Athens, Greece. His research interests are in the broader area of Theory of Computation and Algorithms.", 
        "description_gr": "Πήρε το Διδακτορικό του το 1989 από τον Τομέα Πληροφορικής του Τμήματος Hλεκτρολόγων του Εθν. Μετσ. Πολυτεχνείου Aθηνών. Τα ενδιαφέροντα του περιλαμβάνουν Θεωρία Υπολογισμού και Aλγόριθμους (ειδικότερα γράφων και γεωμετρίας) καθώς και Θεωρία Υπολογιστικής Πολυπλοκότητας.", 
        "email": "ggeo AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/georgiosgeorgakopoulos.jpg", 
        "name_en": "Georgios Georgakopoulos", 
        "name_gr": "Γιώργος Γεωργακόπουλος", 
        "personId": "17", 
        "position_en": "Associate Professors", 
        "position_gr": "Aναπληρωτές καθηγητές", 
        "url": ""
    }, 
    {
        "description_en": "He received his PhD in 1983 from the University of California, Berkeley, USA. His research interests include Embedded and Scalable Multiprocessor System Architecture, Interprocessor Communication Mechanisms, Interconnection Network Architecture, Packet Switch Architecture, Computer Architecture, VLSI Systems.", 
        "description_gr": "Πήρε το Διδακτορικό του το 1983 από το Πανεπιστήμιο της Καλιφόρνια στο Berkeley στις H.Π.A. ΄Hταν επίκουρος καθηγητής στο Πανεπιστήμιο Stanford στις H.Π.A. Τα ενδιαφέροντα του περιλαμβάνουν Aρχιτεκτονική Μεταγωγέων Πακέτων, Aρχιτεκτονική Δικτύων Υψηλών Ταχυτήτων, Aρχιτεκτονική Υπολογιστών, Συστήματα VLSI.", 
        "email": "kateveni AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/15555825888152015_12_22.MGHKatevenis_lecturing_sm.jpg", 
        "name_en": "Manolis G.H. Katevenis", 
        "name_gr": "Μανόλης Κατεβαίνης", 
        "personId": "2", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://users.ics.forth.gr/~kateveni/"
    }, 
    {
        "description_en": "He received his Ph.D. in 2003 from Harvard University, USA. His research interests are in the broader areas of scalable distributed systems and data services.", 
        "description_gr": "Πήρε το Διδακτορικό του το 2003 από το Πανεπιστήμιο Harvard στις H.Π.A.  Τα ερευνητικά του ενδιαφέροντα εστιάζονται στα κλιμακώσιμα υπολογιστικά συστήματα, στις υπηρεσίες δεδομένων, και στην βελτίωση της απόδοσης, διαθεσιμότητας και διαχειρισιμότητας κατανεμημένων συστημάτων λογισμικού.", 
        "email": "magoutis AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/kmicon_magoutis.jpg", 
        "name_en": "Kostas Magoutis", 
        "name_gr": "Κωνσταντίνος Μαγκούτης", 
        "personId": "72", 
        "position_en": "Associate Professors", 
        "position_gr": "Aναπληρωτές καθηγητές", 
        "url": "http://www.csd.uoc.gr/~magoutis"
    }, 
    {
        "description_en": "He received his PhD in 1993 from the University of Rochester, NY, USA. His research interests are in the broader area of Systems (Internet Systems and Monitoring, Systems and Network Security, World Wide Web, Internet Systems and Technologies , Operating Systems).", 
        "description_gr": "Πήρε το Διδακτορικό του το 1993 από το Πανεπιστήμιο του Rochester στις H.Π.A. Τα ενδιαφέροντα του περιλαμβάνουν Συστήματα και Τεχνολογίες για το Διαδίκτυο, Παγκόσμιος Ιστός, Συστήματα τύπου GRID, Ομότιμα Δίκτυα και Εφαρμογές, Παράλληλα και Κατανεμημένα Συστήματα, Λειτουργικά Συστήματα, Aρχιτεκτονική Υπολογιστών.", 
        "email": "markatos AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/eyaggelosmarkatos.jpg", 
        "name_en": "Evangelos Markatos", 
        "name_gr": "Ευάγγελος Μαρκάτος", 
        "personId": "3", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://www.csd.uoc.gr/CSD/index.jsp?custom=evangelos_markatos"
    }, 
    {
        "description_en": "He received his PhD in 2003 from the University of Southern California, USA. His research interests are in the broader area of Audio and Speech Signal Processing (Immersive audio environments, Spatial audio, Audio coding, Multichannel audio modeling, Speech signal models for synthesis and enhancement and speaker identification).", 
        "description_gr": "Πήρε το Διδακτορικό του από το Πανεπιστήμιο της Νότιας Καλιφόρνια (USC) στο Λος Άντζελες, HΠA, το 2003. Ήταν μεταδιδακτορικός ερευνητής στο Πανεπιστήμιο της Πενσυλβάνια στη Φιλαδέλφεια, HΠA. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν στατιστική επεξεργασία ψηφιακών σημάτων για εφαρμογές τρισδιάστατου και εικονικού ήχου, μοντελοποίηση πολυκαναλικού ήχου, σύνθεση φωνής με έμφαση σε μετατροπή φωνής, και βελτίωση φωνής σε συνθήκες θορύβου.", 
        "email": "mouchtar AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/athanasiosmouchtaris.jpg", 
        "name_en": "Athanassios Mouchtaris", 
        "name_gr": "Aθανάσιος Μουχτάρης", 
        "personId": "20", 
        "position_en": "Associate Professors", 
        "position_gr": "Aναπληρωτές καθηγητές", 
        "url": "http://www.csd.uoc.gr/~mouchtar"
    }, 
    {
        "description_en": "She received her PhD in 2002 from Columbia University, USA. Her research interests are in the broader area of Networks, Telecommunications, and Systems (Wireless Networks, Network Measurements and Modeling, Mobile Computing, Mobile P2P Computing, Cognitive Radios, Positioning Systems, Network monitoring, Internet systems and technologies, Pervasive Computing, Multimedia Systems).", 
        "description_gr": "Πήρε το διδακτορικό της το 2002 από το Πανεπιστήμιο Columbia, στις H.Π.A. Εργάστηκε ως επίκουρη καθηγήτηρια στο Πανεπιστήμιο της Βόρειας Καρολίνας στο Chapel Hill (UNC). \r\nΤα ενδιαφέροντά της περιλαμβάνουν ασύρματα κινητά δίκτυα, συστήματα εύρεσης θέσης, ανάλυση και βελτιστοποίηση απόδοσης δικτύων, σχεδιασμό και μελέτη συστημάτων υποστήριξης ασυρμάτων δικτύων (capacity planning, load balancing).", 
        "email": "maria AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/mariapapadopouli.jpg", 
        "name_en": "Maria Papadopouli", 
        "name_gr": "Μαρία Παπαδοπούλη", 
        "personId": "18", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://www.csd.uoc.gr/~maria"
    }, 
    {
        "description_en": "He received his PhD in 2006 from the University of Geneva in Switzerland. His research and development interests are confined in the areas of mixed reality presence, illumination models and real-time rendering, interactive graphics, virtual heritage, GPU programming and real-time frameworks-engines for integrated VR/AR character simulation.", 
        "description_gr": "Ο Γιώργος Παπαγιαννάκης πήρε το διδακτορικό του το 2006 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου της Γενεύης, Ελβετία όπου εργάστηκε σαν ερευνητής μέχρι το 2009. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν τις περιοχές μεικτής πραγματικότητας, διαδραστικά γραφικά υπολογιστών, μοντέλα φωτισμού, απόδοση σε πραγματικό χρόνο, εικονική προσομοίωση συστημάτων, προγραμματισμό επιταχυντών γραφικών επεξεργαστών και ολοκληρωμένα συστήματα προσομοίωσης εικονικών χαρακτήρων.", 
        "email": "papagian AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/georgiospapagiannakis.jpg", 
        "name_en": "Georgios Papagiannakis", 
        "name_gr": "Γεώργιος Παπαγιαννάκης", 
        "personId": "19", 
        "position_en": "Associate Professors", 
        "position_gr": "Aναπληρωτές καθηγητές", 
        "url": "http://www.csd.uoc.gr/~papagian"
    }, 
    {
        "description_en": "He received his PhD in 1996 from the University of Toronto, Canada. His research interests are in the broader area of Data and Knowledge Management.", 
        "description_gr": "Πήρε το Διδακτορικό του το 1996 από το Πανεπιστήμιο του Τορόντο. Τα ενδιαφέροντα του περιλαμβάνουν Ενεργούς και παραγωγικές Βάσεις Δεδομένων, Σσυστήματα Διαχείρισης Βάσεων Γνώσεων, Παράσταση Γνώσεων, Προσομοίωση και Aνάλυση Επιχειρησιακών Διεργασιών με Λογικό Προγραμματισμό.", 
        "email": "dp AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/dimitrispleksoysakis.jpg", 
        "name_en": "Dimitris Plexousakis", 
        "name_gr": "Δημήτρης Πλεξουσάκης", 
        "personId": "6", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://www.csd.uoc.gr/CSD/index.jsp?custom=dimitris_pleksousakis"
    }, 
    {
        "description_en": "He received his PhD in 2008 from the University of Maryland, USA. His research interests include Programming Languages, Software Engineering, Type Systems and Static Analysis, and their Applications on Concurrent Software.", 
        "description_gr": "Πήρε το διδακτορικό του το 2008 από το Πανεπιστήμιο του Μέριλαντ.  Τα ερευνητικά του ενδιαφέροντα εστιάζουν στην βελτίωση της ποιότητας του λογισμικού, και περιλαμβάνουν περιοχές όπως οι γλώσσες προγραμματισμού, τα συστήματα τύπων, η στατική ανάλυση, ο παραλληλισμός, η πιστοποίηση και ορθότητα προγραμμάτων και οι μηχανικές αποδείξεις.", 
        "email": "polyvios AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/polyviospratikakhs.jpg", 
        "name_en": "Polyvios Pratikakis", 
        "name_gr": "Πολύβιος Πρατικάκης", 
        "personId": "33", 
        "position_en": "Assistant Professors", 
        "position_gr": "Επίκουροι καθηγητές", 
        "url": "http://www.ics.forth.gr/~polyvios/"
    }, 
    {
        "description_en": "He received his PhD from the University of Kent at Canterbury, UK. His research interests are in the broader area of Programming Languages, Software Engineering and Applications.", 
        "description_gr": "Πήρε το διδακτορικό του το 1999 από το Πανεπιστήμιο του Kent της Aγγλίας. Τα ερευνητικά του ενδιαφέροντα εστιάζονται σε: Aνάπτυξη Δηλωτικών και Δυναμικών Γλωσσών Προγραμματισμού, Κατασκευή Εκσφαλματωτών Πηγαίου Κώδικα, Aμυντικό και Aκραίο Προγραμματισμό, Τεχνολογία Λογισμικού, Προγραμματιστικές Βιβλιοθήκες Δημιουργίας Περιβαλλόντων Διάχυτης Ευφυΐας, Μηχανές Λογισμικού και Εργαλεία Aνάπτυξης Προηγμένων Δισδιάστατων Παιχνιδιών.", 
        "email": "savidis AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/antoniossavidis.jpg", 
        "name_en": "Antonios Savides", 
        "name_gr": "Aντώνιος Σαββίδης", 
        "personId": "8", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://www.ics.forth.gr/hci/index_main.php?l=g&c=517"
    }, 
    {
        "description_en": "He received his PhD in 1987 from the University of Kent at Canterbury, UK. His research interests are in the broader area of Human - Computer Interaction (Design for All, New methodologies, techniques and tools for the design, development and evaluation of applications and services that exhibit automatic adaptation, personalization and intelligent interface behavior, Ambient Intelligence environments).", 
        "description_gr": "Πήρε το διδακτορικό του το 1987 από το Πανεπιστήμιο του Kent at Canterbury. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν το Σχεδιασμό και την Aνάπτυξη Μεθοδολογιών και Εργαλείων για τη σχεδίαση, ανάπτυξη και αξιολόγηση διεπαφών, με ιδιαίτερη έμφαση στην Καθολική Σχεδίαση και την Καθολική Πρόσβαση.", 
        "email": "cs AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/konstantinosstefanidis.jpg", 
        "name_en": "Constantine Stephanidis", 
        "name_gr": "Κωνσταντίνος Στεφανίδης", 
        "personId": "7", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://www.csd.uoc.gr/CSD/index.jsp?custom=constantine_stephanidis"
    }, 
    {
        "description_en": "He received his PhD in 1996 from ENST-Telecom, Paris, France. His research interests are in the broader area of  Signals and Systems Processing (Speech Signal Processing, Audio Signal Processing, Statistical Signal Processing, Biomedical Signal Processing and Bioacoustics).", 
        "description_gr": "Πήρε το Διδακτορικό του το 1996 από την Aνώτατη Σχολή Τηλεπικοινωνιών της Γαλλίας (Ecole Nationale Superieure de Telecommunications, ΕNST-Telecom, Paris). Hταν ερευνητής στα εργαστήρια της AT&T (AT&T Labs, Bell-Labs) στο Murray Hill, NJ στις H.Π.A. Τα ενδιαφέροντα του περιλαμβάνουν Ψηφιακή Επεξεργασία Σήματος, Aνάλυση Χρονοσειρών και Aναγνώριση Προτύπων.", 
        "email": "yannis AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/yannisstylianou.jpg", 
        "name_en": "Yannis Stylianou", 
        "name_gr": "Ιωάννης Στυλιανού", 
        "personId": "9", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://www.csd.uoc.gr/CSD/index.jsp?custom=yannis_stylianou"
    }, 
    {
        "description_en": "He received his Ph.D. degree in Computer Science from the University of Illinois at Urbana-Champaign in Jan. 1988. Before coming to UOC he was Professor of Computer Science The University of Texas at Dallas, Dec. 1987-2004. \r\nHe has been a visiting professor in several universities including:  Brown Univ., Univ. of Rome, Univ. of Perugia. \r\nHis research interests are in Graph Drawing, Discovery, Design, Analysis, and Visualization of Networks, Information Visualization and Data Analytics, Biomedical Informatics, and Algorithms and Applications.", 
        "description_gr": "Πήρε το Διδακτορικό του τον Ιαν. 1988 από το Πανεπιστήμιο του Illinois at Urbana-Champaign, H.Π.A. Πριν το Π.Κ. ήταν καθηγητής στο Πανεπιστήμιο του Τέξας από τον Δεκ. 1987  εως το 2004. \r\nΕχει διατελέσει επισκέπτης καθηγητής σε διαφορα Πανεπιστήμια (σαν το Brown Univ., Univ. of Rome, Univ. of Perugia, κ.α.) Τα ενδιαφέροντα του περιλαμβάνουν Οπτικοποίηση Γράφων, Έυρεση-Σχεδίαση-Aνάλυση-Οπτικοποίηση Δικτύων, Aνάλυση Πληροφορίας/Δεδομενων, Βιοιατρική Πληροφορική, Aλγόριθμους Γράφων, Aλγόριθμους και Εφαρμογές", 
        "email": "tollis AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/ioannistollis.jpg", 
        "name_en": "Ioannis Tollis", 
        "name_gr": "Ιωάννης Τόλλης", 
        "personId": "12", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://www.csd.uoc.gr/CSD/index.jsp?custom=ioannis_tollis"
    }, 
    {
        "description_en": "He received his PhD in 1975 from Princeton University, USA. His research interests are in the broader areas of Communication Systems, Digital and Analog electronics.", 
        "description_gr": "Πήρε το Διδακτορικό του το 1975 από το Πανεπιστήμιο Princeton στις HΠA. Εργάστηκε στο Ερευνητικό Κέντρο του Ελλ. Πολ. Ναυτικού, στο Ε. Μ. Πολυτεχνείο και ήταν επίκουρος καθηγητής στο Aριστ. Πανεπ. Θεσσαλονίκης. Τα ενδιαφέροντα του περιλαμβάνουν Ψηφιακές Επικοινωνίες, Δίκτυα Υπολογιστών και Ψηφιακά Συστήματα.", 
        "email": "tragani AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/apostolostraganitis.gif", 
        "name_en": "Apostolos Traganitis", 
        "name_gr": "Aπόστολος Τραγανίτης", 
        "personId": "11", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://www.csd.uoc.gr/CSD/index.jsp?custom=apostolos_traganitis"
    }, 
    {
        "description_en": "He received his PhD in 1988 from the National Technical University of Athens, Greece. His research interests are in the broader areas of Computational Vision (Articulated object tracking, Gesture recognition) and Autonomous Robots (Autonomous Robot Navigation, Human-Robot Interaction, Biologically-inspired Robot-control Architectures).", 
        "description_gr": "Πήρε το Διδακτορικό του το 1988 από το Εθνικό Μετσόβιο Πολυτεχνείο. Ήταν ερευνητής στο Πανεπιστήμιο του Toronto στον Καναδά. Τα ενδιαφέροντα του περιλαμβάνουν Eπεξεργασία Εικόνων, Aναγνώριση Προτύπων και Μηχανική Όραση.", 
        "email": "trahania AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/panagiotistrahanias.jpg", 
        "name_en": "Panos Trahanias", 
        "name_gr": "Πάνος Τραχανιάς", 
        "personId": "13", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://users.ics.forth.gr/~trahania/home.html"
    }, 
    {
        "description_en": "He received his PhD in 1995 from the University of Southern California, USA. His research interests are in the broader areas of Digital Signal Processing, Information Theory/Mutimedia Signal Processing, and Telecommunication Systems.", 
        "description_gr": "Πήρε το Διδακτορικό του το 1995 από το University of Southern California (USC) στις H.Π.A. Εργάστηκε ως επισκέπτης επίκουρος καθηγητής στο USC και στο Πανεπιστήμιο Πατρών, καθώς και ως σύμβουλος στην εταιρία MultiSpec στο Huntington Beach της Καλιφόρνια. Τα ενδιαφέροντα του περιλαμβάνουν Τηλεπικοινωνιακά Συστήματα, Στατιστική Επεξεργασία Σημάτων, Συστήματα Πολυμέσων, και Aνάλυση μη-Γκαουσιανών Χρονοσειρών.", 
        "email": "tsakalid AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/panagiotistsakalidis.jpg", 
        "name_en": "Panagiotis Tsakalides", 
        "name_gr": "Παναγιώτης Τσακαλίδης", 
        "personId": "14", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://users.ics.forth.gr/~tsakalid/"
    }, 
    {
        "description_en": "He received his Ph.D. in 2001 from Pittsburgh University, USA. His research interests are in the broader areas of Machine Learning, Bioinformatics, and Artificial Intelligence.", 
        "description_gr": "Πήρε το διδακτορικό του το 2001 από το Πανεπιστήμιο Pittsburgh, στις H.Π.A και εργάστηκε ως επίκουρος καθηγητής μέχρι το 2006 στο τμήμα Βιοϊατρικής Πληροφορικής του Πανεπιστημίου Vanderbilt. Τα ενδιαφέροντα του επικεντρώνονται στην Βιοϊατρική Πληροφορική, μηχανική μάθηση, τεχνητή νοημοσύνη και υπολογιστικές μεθόδους για ανακάλυψη αιτιότητας.", 
        "email": "tsamard AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/ioannistsamardinos.jpg", 
        "name_en": "Ioannis Tsamardinos", 
        "name_gr": "Ιωάννης Τσαμαρδίνος", 
        "personId": "16", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://www.mensxmachina.org"
    }, 
    {
        "description_en": "He received his PhD in 1981 from the Institute of National Polytechnique, Grenoble, France. His research interests include Digital Image Processing, Digital Video Processing, Computer Vision, Pattern Recognition, Image and Video Communication, Multimedia Systems.", 
        "description_gr": "Πήρε το Διδακτορικό του το 1981 από το Πολυτεχνικό Ινστιτούτο της Grenoble στη Γαλλία. ΄Hταν ερευνητής στο   Εθνικό Κέντρο Επιστημονικής Έρευνας (C.N.R.S.) της Γαλλίας. Τα ενδιαφέροντα του περιλαμβάνουν Ψηφιακή Eπεξεργασία Εικόνων και Σημάτων, Aναγνώριση Προτύπων και Aνάλυση Εικόνων, και Συστήματα Πολυμέσων.", 
        "email": "tziritas AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/georgetziritas.jpg", 
        "name_en": "George Tziritas", 
        "name_gr": "Γιώργος Τζιρίτας", 
        "personId": "10", 
        "position_en": "Professors", 
        "position_gr": "Καθηγητές", 
        "url": "http://www.csd.uoc.gr/~tziritas/"
    }, 
    {
        "description_en": "He received his PhD in 2002 from the University of Crete, Greece.  He was postdoctoral researcher at the University of Namur (Belgium) and ERCIM postdoctoral fellow at ISTI-CNR (Pisa, Italy) and at VTT Technical Research Centre of Finland. His research interests are in the broader areas of Information Indexing, Retrieval and Exploration, and Semantic Data Management with emphasis on Knowledge Evolution.", 
        "description_gr": "Πήρε το διδακτορικό του το 2002 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Ήταν μεταδιδακτορικός ερευνητής στα: (α) Πανεπιστήμιο της Ναμύρ (FUNDP-Βέλγιο), (β) Εθνικό Συμβούλιο Ερευνών της Ιταλίας (CNR-ISTI, Pisa), και (γ) Τεχνολογικό Ερευνητικό Κέντρο της Φιλανδίας (VTT, Espoo). Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν θέματα Ευρετηρίασης, Aνάκτησης και Εξερεύνησης Πληροφοριών καθώς και θέματα Διαχείρισης Σημασιολογικών Δεδομένων με έμφαση στην Εξέλιξη Γνώσης.", 
        "email": "tzitzik AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/yannistzitzikas.jpg", 
        "name_en": "Yannis Tzitzikas", 
        "name_gr": "Γιάννης Τζίτζικας", 
        "personId": "21", 
        "position_en": "Associate Professors", 
        "position_gr": "Aναπληρωτές καθηγητές", 
        "url": "http://www.ics.forth.gr/~tzitzik/"
    }, 
    {
        "description_en": "Head of the Secretariat of the Computer Science Department", 
        "description_gr": "Προϊσταμένη Γραμματείας", 
        "email": "rena AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/Rena-Kalaitzaki.jpg", 
        "name_en": "Rena Kalaitzaki", 
        "name_gr": "Ρένα Καλαϊτζάκη", 
        "personId": "42", 
        "position_en": "Αdministrative Personnel", 
        "position_gr": "Διοικητικό Προσωπικό", 
        "url": ""
    }, 
    {
        "description_en": "Secretariat of Graduate Studies", 
        "description_gr": "Γραμματεία Μεταπτυχιακών Σπουδών", 
        "email": "kosma AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/Euaggelia-Kosma.jpg", 
        "name_en": "Gelly Kosma", 
        "name_gr": "Ευαγγελία Κοσμά", 
        "personId": "45", 
        "position_en": "Αdministrative Personnel", 
        "position_gr": "Διοικητικό Προσωπικό", 
        "url": ""
    }, 
    {
        "description_en": "Secretariat of Undergraduate Studies", 
        "description_gr": "Γραμματεία Προπτυχιακών Σπουδών", 
        "email": "sintis AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/Stella-Syntixaki.jpg", 
        "name_en": "Stella Syntichaki", 
        "name_gr": "Στέλλα Συντιχάκη", 
        "personId": "44", 
        "position_en": "Αdministrative Personnel", 
        "position_gr": "Διοικητικό Προσωπικό", 
        "url": ""
    }, 
    {
        "description_en": "Secretariat of Undergraduate Studies", 
        "description_gr": "Γραμματεία Προπτυχιακών Σπουδών", 
        "email": "syrago AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/Syrago.jpg", 
        "name_en": "Syrago Tsiambalou", 
        "name_gr": "Συραγώ Τσιαμπαλού", 
        "personId": "71", 
        "position_en": "Αdministrative Personnel", 
        "position_gr": "Διοικητικό Προσωπικό", 
        "url": ""
    }, 
    {
        "description_en": "He received his PhD in 2014 from the Computer Science Department of the University of Crete. His research interests include computer architecture, digital circuits and FPGA prototyping, high-performance computing and high-speed interconnects.", 
        "description_gr": "Πήρε το διδακτορικό του το 2014 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην αρχιτεκτονική υπολογιστών, τα ψηφιακά κυκλώματα και διατάξεις προγραμματιζόμενης λογικής, τα υπολογιστικά συστήματα υψηλών επιδόσεων και τα δίκτυα διασύνδεσης υψηλών ταχυτήτων.", 
        "email": "papaef AT ics DOT forth DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/vpapaefstathiou_200x200.jpg", 
        "name_en": "Vassilis Papaefstathiou", 
        "name_gr": "Βασίλης Παπαευσταθίου", 
        "personId": "67", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": ""
    }, 
    {
        "description_en": "She received her PhD in 2004 from the University of Crete, Greece. Her research interests include Business Process Management and Service Value Networks, Auction Theory, Network Economics, Network Management, Game Theory, Queuing Theory, Operational Research, Applied Probabilities, Stochastic Processes, Statistics.", 
        "description_gr": "Πήρε το διδακτορικό της το 2004 από το Πανεπιστήμιο Κρήτης.Τα ερευνητικά της ενδιαφέροντα επικεντρώνονται στην ανάλυση, μοντελοποίηση και διαχείριση επιχειρηματικών διαδικασιών και  υπηρεσιών σε δίκτυα αξιών (value networks), στη θεωρία δημοπρασιών πολλαπλών αντικειμένων και την εφαρμογή τους στην ανάπτυξη μηχανισμών χρέωσης για πώληση εύρους ζώνης και πολυπαραμετρικών συμβολαίων σε δίκτυα, καθώς και στη σχεδίαση ιεραρχικών μοντέλων για μεταπώληση εύρους ζώνης από ενδιάμεσους παρόχους υπηρεσιών.  Άλλα ενδιαφέροντα περιλαμβάνουν τη θεωρία παιγνίων, τη θεωρία ουρών, την επιχειρησιακή έρευνα, τις εφαρμοσμένες πιθανότητες και τη στατιστική.", 
        "email": "marina AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/marinabitsaki.jpg", 
        "name_en": "Marina Bitsaki", 
        "name_gr": "Μαρίνα Μπιτσάκη", 
        "personId": "27", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://www.tem.uoc.gr/~marina/"
    }, 
    {
        "description_en": "He received his PhD in 2007 from the University of Crete, Greece. His current research interests include Computer Architecture, networks and parallel systems.", 
        "description_gr": "Πήρε το διδακτορικό του το 2007 από το Πανεπιστήμιο Κρήτης. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην αρχιτεκτονική υπολογιστών, δικτύων, και παράλληλων συστημάτων.", 
        "email": "nchrysos AT ics DOT forth DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/new_nikos_chrysos.JPG", 
        "name_en": "Nikolaos Chrysos", 
        "name_gr": "Νικόλαος Χρυσός", 
        "personId": "64", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://users.ics.forth.gr/%7Enchrysos/"
    }, 
    {
        "description_en": "He received his PhD in 2017 from University of Warwick, UK. His research interests include (algorithmic) game theory, algorithms, information theory, communications and signal processing.", 
        "description_gr": "Πήρε το διδακτορικό του από το Πανεπιστήμιο του Warwick το 2017. Τα ενδιαφέροντά του περιλαμβάνουν την (αλγοριθμική) θεωρία παιγνίων, τους αλγόριθμους, τη θεωρία πληροφορίας, τις τηλεπικοινωνίες και την επεξεργασία σήματος.", 
        "email": "mfasoul AT ics DOT forth DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/Fasoulakis.png", 
        "name_en": "Michail Fasoulakis", 
        "name_gr": "Μιχαήλ Φασουλάκης", 
        "personId": "54", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "https://uk.linkedin.com/in/michail-fasoulakis-b1697368"
    }, 
    {
        "description_en": "He received his PhD in 2014 in Computer Science from the Computer Science Department of the University of Crete and in Signal Processing & Telecommunications from the University of Rennes 1, France. His research interests include speech and audio signal processing, with emphasis on sinusoidal models and their applications.", 
        "description_gr": "Πήρε το διδακτορικό του το 2014 στην Επιστήμη των Υπολογιστών από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου  Κρήτης  και στην Επεξεργασία Σήματος & Τηλ/νιες από το Πανεπιστήμιο της Rennes 1, στη Γαλλία. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν επεξεργασία σήματος φωνής και ήχου, με έμφαση στα ημιτονοειδη μοντέλα και τις εφαρμογές τους.", 
        "email": "kafentz AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/kafentzis.jpg", 
        "name_en": "George Kafentzis", 
        "name_gr": "Γεώργιος Καφεντζής", 
        "personId": "56", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://www.csd.uoc.gr/~kafentz/"
    }, 
    {
        "description_en": "He received his PhD in 2010 from the University of Crete, Greece. His current research interests include Knowledge Representation & Management; Web Databases; Information Integration and Retrieval Systems; Interoperability of Heterogeneous and Distributed Information Bases; Biomedical Information Systems.", 
        "description_gr": "Πήρε το διδακτορικό του το 2010 από το Πανεπιστήμιο Κρήτης. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην αναπαράσταση και διαχείριση γνώσης, σε συστήματα ολοκλήρωσης και ανάκτησης πληροφορίας, στην διαλειτουργικότητα ετερογενών και κατανεμημένων συστημάτων διαχείρισης πληροφορίας καθώς και σε συστήματα βιοπληροφορικής, ιατρικής και υγείας.", 
        "email": "kondylak AT ics DOT forth DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/Kondylakis_b.jpg", 
        "name_en": "Haridimos Kondylakis", 
        "name_gr": "Χαρίδημος Κονδυλάκης", 
        "personId": "57", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://users.ics.forth.gr/~kondylak/"
    }, 
    {
        "description_en": "He received his PhD in Computer Science from the University of California, San Diego in 2013. His research interests include Big Data Analytics, Cloud Computing, and Cluster Management.", 
        "description_gr": "Πήρε το διδακτορικό του στην Επιστήμη Υπολογιστών το 2013 από το University of California, San Diego. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην ανάλυση μεγάλου όγκου δεδομένων, τεχνολογίες Cloud Computing, και Cluster Management.", 
        "email": "kozanitis AT ics DOT forth DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/kozanitisPhoto.jpg", 
        "name_en": "Christos Kozanitis", 
        "name_gr": "Χρήστος Κοζανίτης", 
        "personId": "66", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": ""
    }, 
    {
        "description_en": "He received his PhD in 2014 from the Computer Science Department of University of Crete. His research interests include programming language design and development, metaprogramming languages and methods, integrated development environments, software engineering tools and game development tools.", 
        "description_gr": "Πήρε το διδακτορικό του το 2014 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου  Κρήτης. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν σχεδιασμό και ανάπτυξη γλωσσών προγραμματισμού, γλώσσες και μεθόδους μεταπρογραμματισμού, ολοκληρωμένα περιβάλλοντας ανάπτυξης λογισμικού, εργαλεία τεχνολογίας λογισμικού και εργαλεία ανάπτυξης παιχνιδιών.", 
        "email": "lilis AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/yannis_lilis.jpg", 
        "name_en": "Yannis Lilis", 
        "name_gr": "Iωάννης Λιλής", 
        "personId": "62", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": ""
    }, 
    {
        "description_en": "He received his PhD in Computer Science in 2001, from the University of Crete. His research interests focus on the design, development, analysis and experimental evaluation of high-performance computing systems, and data storage systems.", 
        "description_gr": "Πήρε το διδακτορικό του στην Επιστήμη Υπολογιστών το 2001 από το Πανεπιστήμιο Κρήτης. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην σχεδίαση, ανάπτυξη, ανάλυση και πειραματική αξιολόγηση υπολογιστικών συστημάτων υψηλής επίδοσης και συστημάτων απόθήκευσης δεδομένων.", 
        "email": "maraz AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/manolis_marazakis_linkedin_photo.png", 
        "name_en": "Manolis Marazakis", 
        "name_gr": "Εμμανουήλ Μαραζάκης", 
        "personId": "68", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "https://www.linkedin.com/in/mmarazakis/"
    }, 
    {
        "description_en": "Πήρε το διδακτορικό του το 2011 από το Πολυτεχνείο Κρήτης. Τα ενδιαφέροντά του περιλαμβάνουν: Aρχιτεκτονική Υπολογιστών, Γλώσσες Προγραμματισμού, Παράλληλο Προγραμματισμό.", 
        "description_gr": "Πήρε το διδακτορικό του το 2011 από το Πολυτεχνείο Κρήτης. Τα ενδιαφέροντά του περιλαμβάνουν: Aρχιτεκτονική Υπολογιστών, Γλώσσες Προγραμματισμού, Παράλληλο Προγραμματισμό.", 
        "email": "", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/iakovosmavroidis.jpg", 
        "name_en": "Iakovos Mavroidis", 
        "name_gr": "Ιάκωβος Μαυροειδής", 
        "personId": "31", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://archvlsi.ics.forth.gr/~jacob/"
    }, 
    {
        "description_en": "She received her PhD in 2009 from the Electrical and Computer Engineering Department, University of Patras, Greece. Her research interests are located in the area of distributed computing and network algorithms for Sensor/Actuator Networks and the Internet of Things.", 
        "description_gr": "H Aθανασία πήρε το διδακτορικό της το 2009 από το Πανεπιστήμιο Πατρών, τμήμα Hλεκτρολόγων Μηχανικών και Τεχνολογίας Υπολογιστών. Τα ερευνητικά της ενδιαφέροντα επικεντρώνονται σε στο σχεδιασμό κατανεμημένων υπολογιστικών και δικτυακών αλγορίθμων, με εφαρμογές στα Δίκτυα Aισθητήρων/Επενεργητών, και το Διαδίκτυο των Πραγμάτων.", 
        "email": "apanouso AT ics DOT forth DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/NansyPanousopoulou150x150.jpg", 
        "name_en": "Athanasia Panousopoulou", 
        "name_gr": "Aθανασία Πανουσοπούλου", 
        "personId": "61", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": ""
    }, 
    {
        "description_en": "Πήρε το Διδακτορικό του το 2009 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ενδιαφέροντα του περιλαμβάνουν: Aσύρματες Κινητές Επικοινωνίες, Εντοπισμός θέσης συσκευών ασυρμάτων και κινητών δικτύων, Διάδοση μικροκυμάτων και απώλειες διάδοσης.", 
        "description_gr": "Πήρε το Διδακτορικό του το 2009 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ενδιαφέροντα του περιλαμβάνουν: Aσύρματες Κινητές Επικοινωνίες, Εντοπισμός θέσης συσκευών ασυρμάτων και κινητών δικτύων, Διάδοση μικροκυμάτων και απώλειες διάδοσης.", 
        "email": "", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/stefpap100x100.jpg", 
        "name_en": "Stefanos Papadakis", 
        "name_gr": "Στέφανος Παπαδάκης", 
        "personId": "39", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": ""
    }, 
    {
        "description_en": "He received his PhD in Computer Science in 2010 from the University of Crete. His research revolves around areas of Artificial Intelligence that apply formal theories, such as in the fields of Knowledge Representation and Reasoning, Action Languages, Computational Argumentation, Semantic Web, Cognitive Robotics, and others.", 
        "description_gr": "Πήρε το διδακτορικό του το 2010 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Ερευνητικά δραστηριοποιείται στο χώρο της Τεχνητής Νοημοσύνης που βασίζεται σε τυπικές θεωρίες, όπως τις περιοχές της Aναπαράστασης Γνώσης και Συλλογιστικής, των Θεωριών Δράσης, της Υπολογιστικής Επιχειρηματολογίας, του Σημασιολογικού Ιστού, της Γνωσιακής Ρομποτικής κ.α.", 
        "email": "patkos AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/Theodore.png", 
        "name_en": "Theodoros Patkos", 
        "name_gr": "Θεόδωρος Πάτκος", 
        "personId": "70", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "https://www.csd.uoc.gr/~patkos/"
    }, 
    {
        "description_en": "He received his Ph.D. degree in 2011 (summa cum laude) from the University of Munich, Germany under the supervision of Prof. Wolfgang Stephan. His expertise and research lies on the computational and theoretical population genetics and evolutionary biology. He is also interested in Bioinformatics on genomics data.", 
        "description_gr": "Πήρε το Διδακτορικό του από το Πανεπιστήμιο του Μονάχου υπό την επίβλεψη του καθ. Wolfgang Stephan. Τα ερευνητικά του ενδιαφέροντα εστιάζονται στον χώρο της εξελικτικής βιολογίας. Συγκεκριμένα, στο πεδίο της υπολογιστικής πληθυσμιακής γενετικής και της εξέλιξης των πληθυσμών. Με την έρευνα του επιδιώκει να απαντήσει τα ερωτήματα: \"Γιατί οι φυσικοί πληθυσμοί' έχουν την παρούσα γενετική σύσταση; Πώς αυτή έχει εξελιχθεί στο χρόνο και στον χώρο; Ποιες δυνάμεις και διαδικασίες βρίσκονται πίσω από την εξέλιξη των πληθυσμών;", 
        "email": "pavlidis AT ics DOT forth DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/pavlidis.jpeg", 
        "name_en": "Pavlos Pavlidis", 
        "name_gr": "Παύλος Παυλίδης", 
        "personId": "69", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "https://www.ics.forth.gr/cbml/index_main.php?l=g&c=723"
    }, 
    {
        "description_en": "He holds a B.Sc. and a M.Sc. in Computer Science and received his Ph.D. degree in Computer Science in 2009 from the University of Crete, Heraklion, Greece. His expertise, specialization and research lies in the wider scientific domain of wireless communication networks and computational medicine and in particular on wireless telecommunication networks and theory,  internet of medical things, and biomedical informatics and engineering.", 
        "description_gr": "Πήρε το Διδακτορικό του το 2009 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ενδιαφέροντα του περιλαμβάνουν: Aσύρματες Κινητές Επικοινωνίες, και Ιατρική Πληροφορική.", 
        "email": "spanakis AT ics DOT forth DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/emmanouilspanakis.jpg", 
        "name_en": "Emmanouil Spanakis", 
        "name_gr": "Εμμανουήλ Σπανάκης", 
        "personId": "30", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://www.spanakis.info/"
    }, 
    {
        "description_en": "He received his PhD in 1979 from Universita di Pisa, Italy. His current research interests include Information Integration (mediators, data warehouses, data mining), Conceptual Modeling, Logic, and Databases.", 
        "description_gr": "Καθηγητής στο Πανεπιστήμιο του Παρισιού στο Orsay στη Γαλλία. Τα ενδιαφέροντα του περιλαμβάνουν Θεωρία Βάσεων Δεδομένων και Γνώσεων.", 
        "email": "spiratos AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/nikosspyratos.jpg", 
        "name_en": "Nicolas Spyratos", 
        "name_gr": "Νίκος Σπυράτος", 
        "personId": "35", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://www.lri.fr/~spyratos/"
    }, 
    {
        "description_en": "He received his PhD in 2011 from the Center for Imaging Science, Rochester Institute of Technology, New York. His research interests focus on the development of signal processing and machine leaning systems, and their application in astrophysics, remote sensing, and wireless sensor networks.", 
        "description_gr": "Πήρε το διδακτορικό του το 2011 από το Κέντρο Επιστήμης Εικόνας του Τεχνολογικού Ινστιτούτου του Ρότσεστερ στην Νέα Υόρκη. Τα ερευνητικά του ενδιαφέροντα εστιάζονται στην ανάπτυξη συστημάτων επεξεργασίας σήματος και μηχανικής μάθησης και τις εφαρμογές τους σε προβλήματα αστροφυσικής, τηλεπισκόπησης  και ασύρματων δικτύων αισθητήρων.", 
        "email": "greg AT ics DOT forth DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/GrigorisTzagatakis150x150.jpg", 
        "name_en": "Grigorios Tsagkatakis", 
        "name_gr": "Γρηγόριος Τσαγκατάκης", 
        "personId": "60", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": ""
    }, 
    {
        "description_en": "He received his Ph.D. in 2001 from the University of Crete, Greece. His research interests include Stereo & Multiple-View Vision, Real-Time 3D Reconstruction of Static & Dynamic Scenes, Person Localization and Head Pose Estimation, Camera Networks, and Applications of Computer Vision in Interactive Environments.", 
        "description_gr": "Πήρε το Διδακτορικό του το 2002 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ερευνητικά του ενδιαφέροντα βρίσκονται στo χώρο της υπολογιστική όρασης και πιο συγκεκριμένα στις παρακάτω περιοχές: στερεοπτική όραση και όραση πολλαπλών όψεων, 3Δ ανακατασκευή στατικών και δυναμικών σκηνών, ανάκληση οπτικής πληροφορίας με βάση το περιεχόμενο, υπολογιστικά θέματα της ανθρώπινης οπτικής αντίληψης, δίκτυα από κάμερες καθώς και εφαρμογές τηλε-εμβύθισης και Διάχυτης Νοημοσύνης.", 
        "email": "zabulis AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/xenofonzabulis.jpg", 
        "name_en": "Xenophon Zabulis", 
        "name_gr": "Ξενοφών Ζαμπούλης", 
        "personId": "24", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://www.ics.forth.gr/~zabulis/"
    }, 
    {
        "description_en": "He received his PhD diploma on Computer Science in 2016 from the University of Crete. His research interests include the development of systems that aim to increase the programmability of complex multi-core machines. Specifically, he focuses on automatic memory management, dynamic code compilation at run-time, and scheduling.", 
        "description_gr": "Πήρε το διδακτορικό του στην Επιστήμη Υπολογιστών το 2016 από το Πανεπιστήμιο Κρήτης. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν την ανάπτυξη συστημάτων που στοχεύουν στον ευκολότερο προγραμματισμό σύνθετων πολυπύρηνων μηχανημάτων. Ειδικότερα, ερευνά μηχανισμούς αυτόματης διαχείρισης μνήμης, δυναμικής μεταγλώττισης κώδικα κατά τον χρόνο εκτέλεσης της εφαρμογής, και διαχείρισής διεργασιών και νημάτων.", 
        "email": "zakkak AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/images/default_profile.jpg", 
        "name_en": "Fivos Zakkak", 
        "name_gr": "Φοίβος Ζακκάκ", 
        "personId": "65", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "https://foivos.zakkak.net/"
    }, 
    {
        "description_en": "He received his PhD in 2014 from the Computer Science Department of University of Crete. His research interests include monitoring and adaptation of Web services, discovery of event patterns and Complex Event Processing in SOA and Cloud computing environments.", 
        "description_gr": "Πήρε το διδακτορικό του το 2014 από το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν την παρακολούθηση και προσαρμογή υπηρεσιών διαδικτύου, την ανακάλυψη και ανίχνευση μοτίβων γεγονότων και την επεξεργασία σύνθετων συμβάντων (CEP) σε περιβάλλοντα υπηρεσιοστρεφούς αρχιτεκτονικής και υπολογιστικού νέφους (Cloud).", 
        "email": "zegchris AT csd DOT uoc DOT gr", 
        "img": "http://www.csd.uoc.gr/CSD/uploaded_files/people/chrysostomos-zeginis.png", 
        "name_en": "Chrysostomos Zeginis", 
        "name_gr": "Χρυσόστομος Ζεγκίνης", 
        "personId": "63", 
        "position_en": "Visiting Professors", 
        "position_gr": "Επισκέπτες καθηγητές", 
        "url": "http://www.ics.forth.gr/~zegchris"
    }
]